# ================================================================
# CyberDudeBivash SENTINEL APEX v20.0 — Sigma Detection Rules
# Threat  : Important Red Hat Security Advisory kpatch-patch-4_18_0-477_107_1 kpatch-patch-4
# Scenario: VULNERABILITY
# Generated: 2026-03-05T12:44:18.300222 UTC
# Authority: CyberDudeBivash Pvt. Ltd. | intel.cyberdudebivash.com
# ================================================================

title: 'CDB: Important Red Hat Security Advisory kpatch-patch-4_18_0-477_107_1 kpatch-patch-4 - Web Exploit Detection'
id: cdb-313531
status: experimental
description: 'Detects web application exploitation / injection patterns'
author: 'CyberDudeBivash GOC (Automated)'
date: 2026/03/05
tags: ['attack.initial_access.t1190', 'attack.execution.t1059']
logsource:
  category: webserver
  product: any
detection:
  selection_xss:
    c-uri|contains: ['<script>', 'javascript:', 'onerror=', '%3Cscript%3E']
  selection_sqli:
    c-uri|contains: ["' OR '1'='1", 'UNION SELECT', '../../../']
  condition: selection_xss or selection_sqli
falsepositives: ['Security testing / pen testing']
level: high
---
