// ================================================================
// CyberDudeBivash SENTINEL APEX v20.0 — Microsoft Sentinel KQL
// Threat  : CVE-2026-27689 - Denial of service DOS in SAP Supply Chain Management
// Scenario: SUPPLY_CHAIN | CVEs: N/A
// Generated: 2026-03-10 05:11:24 UTC
// Import into: Sentinel → Analytics → + Create → Scheduled Query
// ================================================================

// Query 3: Suspicious PowerShell
SecurityEvent | where TimeGenerated > ago(24h)
| where EventID == 4688
| where CommandLine has_any ('-EncodedCommand', '-enc', 'IEX(', 'Invoke-Expression', 'DownloadFile')
| extend ThreatName="CVE-2026-27689 - Denial of service DOS in SAP Supply Chain Management", Severity="HIGH"
