| tstats count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes
  where Processes.process_name IN ("powershell.exe","pwsh.exe")
  AND (Processes.process IN ("*-enc *","*-EncodedCommand *","*-e *"))
  AND (Processes.process IN ("*-nop*","*-noni*","*hidden*","*bypass*","*DownloadString*","*IEX*","*iex(*"))
  by Processes.dest Processes.user Processes.process_name Processes.process Processes.parent_process_name
| rename Processes.* as *
| eval severity="HIGH"
| eval mitre_technique="T1059.001"
| table firstTime lastTime dest user process_name process severity mitre_technique