{
  "detection_pack_id": "detpack--d2ffc3724e6b",
  "sigma_rules": [
    {
      "id": "sigma--32cb7a09d893",
      "title": "CDB-APEX: CVE-2026-21765 - HCL BigFix Platform is affected by insecure",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--2d161a03c804",
      "title": "CDB-APEX: Public PoC Exploit Released for Nginx-UI Backup Restore Vuln",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--266107442570",
      "title": "CDB-APEX: Google fixes fourth actively exploited Chrome zero-day of 20",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--40ddc6d96896",
      "title": "CDB-APEX: CVE-2026-34751 - Payload has Unvalidated Input in Password R",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--9f61e88b92ef",
      "title": "CDB-APEX: CVE-2026-34875 - Mbed TLS FFDH Key Export Buffer Overflow",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--12519fb1a555",
      "title": "CDB-APEX: Industrialization of the Fraud Ecosystem Blog",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--d0adde4a4680",
      "title": "CDB-APEX: Mercor confirms security incident tied to LiteLLM supply cha",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--22eb499a1ed0",
      "title": "CDB-APEX: Magecart Hackers Uses 100+ Domains to Hijack eStores Checkou",
      "level": "critical",
      "tags": [
        "attack.t1566.002",
        "attack.t1199",
        "attack.t1476"
      ]
    },
    {
      "id": "sigma--b31142719b32",
      "title": "CDB-APEX: CVE-2026-35093 - Libinput: libinput: unauthorized code execu",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--25203e00cd12",
      "title": "CDB-APEX: North Korean hackers linked to Axios npm supply chain compro",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--4371a3b05402",
      "title": "CDB-APEX: Google links Axios npm supply chain attack to North Korea-li",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--4c68a7b5e29a",
      "title": "CDB-APEX: Google fixes Chrome zero-day with in-the-wild exploit (CVE-2",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--e6b794242081",
      "title": "CDB-APEX: Major Cyber Attacks in March 2026: OAuth Phishing,\u00a0SVG Smugg",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--61a288db5af1",
      "title": "CDB-APEX: Malicious Script That Gets Rid of ADS, (Wed, Apr 1st)",
      "level": "high",
      "tags": [
        "attack.t1059.001",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--94f9d8647cca",
      "title": "CDB-APEX: TeamPCP Supply Chain Campaign: Update 005 - First Confirmed ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--e6a46bc81fbb",
      "title": "CDB-APEX: CVE-2026-22767 - Dell AppSync Symlink Following Information ",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--16843b2c318c",
      "title": "CDB-APEX: CVE-2026-22768 - Dell AppSync Privilege Escalation Vulnerabi",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--9f1e6645f834",
      "title": "CDB-APEX: SentinelOne autonomous detection blocks trojaned LiteLLM tri",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--4b593f21f96b",
      "title": "CDB-APEX: New Chrome Zero-Day Vulnerability Actively Exploited in Atta",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1555",
        "attack.t1567"
      ]
    },
    {
      "id": "sigma--3d3ef80a5d0e",
      "title": "CDB-APEX: Russian Hackers Using Remote Access Toolkit \u201cCTRL\u201d for\u00a0 RDP ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--a16093171f22",
      "title": "CDB-APEX: Hackers Actively Exploiting Critical WebLogic RCE Vulnerabil",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1027"
      ]
    },
    {
      "id": "sigma--c4fb992a8e4e",
      "title": "CDB-APEX: Google Cloud\u2019s Vertex AI platform Vulnerability Allow Attack",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1078",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--6abd0fbe9efa",
      "title": "CDB-APEX: A laughing RAT: CrystalX combines spyware, stealer, and pran",
      "level": "critical",
      "tags": [
        "attack.t1593",
        "attack.t1059",
        "attack.t1547.001"
      ]
    },
    {
      "id": "sigma--d707bd052026",
      "title": "CDB-APEX: CVE-2026-5256 - code-projects Simple Laundry System Paramete",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--824fc51b1e04",
      "title": "CDB-APEX: CVE-2026-5257 - code-projects Simple Laundry System Paramete",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_21765___HCL_BigFix_Pl",
      "cves": [
        "CVE-2026-21765"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_34751___Payload_has_U",
      "cves": [
        "CVE-2026-34751"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_34875___Mbed_TLS_FFDH",
      "cves": [
        "CVE-2026-34875"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_35093___Libinput__lib",
      "cves": [
        "CVE-2026-35093"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_Google_fixes_Chrome_zero_day_w",
      "cves": [
        "CVE-2026-5281"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_22767___Dell_AppSync_",
      "cves": [
        "CVE-2026-22767"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_22768___Dell_AppSync_",
      "cves": [
        "CVE-2026-22768"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5256___code_projects_",
      "cves": [
        "CVE-2026-5256"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5257___code_projects_",
      "cves": [
        "CVE-2026-5257"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 3558632,
      "msg": "CDB APEX: CVE-2026-21765 - HCL BigFix Platform is affected b",
      "severity": 2
    },
    {
      "sid": 4340435,
      "msg": "CDB APEX: Public PoC Exploit Released for Nginx-UI Backup Re",
      "severity": 1
    },
    {
      "sid": 3647712,
      "msg": "CDB APEX: Google fixes fourth actively exploited Chrome zero",
      "severity": 1
    },
    {
      "sid": 8982564,
      "msg": "CDB APEX: CVE-2026-34751 - Payload has Unvalidated Input in ",
      "severity": 1
    },
    {
      "sid": 4511012,
      "msg": "CDB APEX: CVE-2026-34875 - Mbed TLS FFDH Key Export Buffer O",
      "severity": 1
    },
    {
      "sid": 3030230,
      "msg": "CDB APEX: Industrialization of the Fraud Ecosystem Blog",
      "severity": 2
    },
    {
      "sid": 8312861,
      "msg": "CDB APEX: Mercor confirms security incident tied to LiteLLM ",
      "severity": 2
    },
    {
      "sid": 6562578,
      "msg": "CDB APEX: Magecart Hackers Uses 100+ Domains to Hijack eStor",
      "severity": 1
    },
    {
      "sid": 9992730,
      "msg": "CDB APEX: CVE-2026-35093 - Libinput: libinput: unauthorized ",
      "severity": 2
    },
    {
      "sid": 3302375,
      "msg": "CDB APEX: North Korean hackers linked to Axios npm supply ch",
      "severity": 1
    },
    {
      "sid": 6921197,
      "msg": "CDB APEX: Google links Axios npm supply chain attack to Nort",
      "severity": 1
    },
    {
      "sid": 1559160,
      "msg": "CDB APEX: Google fixes Chrome zero-day with in-the-wild expl",
      "severity": 1
    },
    {
      "sid": 5129417,
      "msg": "CDB APEX: Major Cyber Attacks in March 2026: OAuth Phishing,",
      "severity": 1
    },
    {
      "sid": 6973716,
      "msg": "CDB APEX: Malicious Script That Gets Rid of ADS, (Wed, Apr 1",
      "severity": 2
    },
    {
      "sid": 2461299,
      "msg": "CDB APEX: TeamPCP Supply Chain Campaign: Update 005 - First ",
      "severity": 1
    },
    {
      "sid": 1223618,
      "msg": "CDB APEX: CVE-2026-22767 - Dell AppSync Symlink Following In",
      "severity": 2
    },
    {
      "sid": 5979409,
      "msg": "CDB APEX: CVE-2026-22768 - Dell AppSync Privilege Escalation",
      "severity": 2
    },
    {
      "sid": 1512885,
      "msg": "CDB APEX: SentinelOne autonomous detection blocks trojaned L",
      "severity": 2
    },
    {
      "sid": 2766929,
      "msg": "CDB APEX: New Chrome Zero-Day Vulnerability Actively Exploit",
      "severity": 1
    },
    {
      "sid": 3749749,
      "msg": "CDB APEX: Russian Hackers Using Remote Access Toolkit \u201cCTRL\u201d",
      "severity": 1
    },
    {
      "sid": 3507405,
      "msg": "CDB APEX: Hackers Actively Exploiting Critical WebLogic RCE ",
      "severity": 1
    },
    {
      "sid": 7712050,
      "msg": "CDB APEX: Google Cloud\u2019s Vertex AI platform Vulnerability Al",
      "severity": 1
    },
    {
      "sid": 7468312,
      "msg": "CDB APEX: A laughing RAT: CrystalX combines spyware, stealer",
      "severity": 1
    },
    {
      "sid": 8686983,
      "msg": "CDB APEX: CVE-2026-5256 - code-projects Simple Laundry Syste",
      "severity": 2
    },
    {
      "sid": 6308108,
      "msg": "CDB APEX: CVE-2026-5257 - code-projects Simple Laundry Syste",
      "severity": 2
    }
  ],
  "snort_rules": [
    {
      "sid": 3558633,
      "msg": "CDB-SNORT: CVE-2026-21765 - HCL BigFix Platform is affected b"
    },
    {
      "sid": 4340436,
      "msg": "CDB-SNORT: Public PoC Exploit Released for Nginx-UI Backup Re"
    },
    {
      "sid": 3647713,
      "msg": "CDB-SNORT: Google fixes fourth actively exploited Chrome zero"
    },
    {
      "sid": 8982565,
      "msg": "CDB-SNORT: CVE-2026-34751 - Payload has Unvalidated Input in "
    },
    {
      "sid": 4511013,
      "msg": "CDB-SNORT: CVE-2026-34875 - Mbed TLS FFDH Key Export Buffer O"
    },
    {
      "sid": 3030231,
      "msg": "CDB-SNORT: Industrialization of the Fraud Ecosystem Blog"
    },
    {
      "sid": 8312862,
      "msg": "CDB-SNORT: Mercor confirms security incident tied to LiteLLM "
    },
    {
      "sid": 6562579,
      "msg": "CDB-SNORT: Magecart Hackers Uses 100+ Domains to Hijack eStor"
    },
    {
      "sid": 9992731,
      "msg": "CDB-SNORT: CVE-2026-35093 - Libinput: libinput: unauthorized "
    },
    {
      "sid": 3302376,
      "msg": "CDB-SNORT: North Korean hackers linked to Axios npm supply ch"
    },
    {
      "sid": 6921198,
      "msg": "CDB-SNORT: Google links Axios npm supply chain attack to Nort"
    },
    {
      "sid": 1559161,
      "msg": "CDB-SNORT: Google fixes Chrome zero-day with in-the-wild expl"
    },
    {
      "sid": 5129418,
      "msg": "CDB-SNORT: Major Cyber Attacks in March 2026: OAuth Phishing,"
    },
    {
      "sid": 6973717,
      "msg": "CDB-SNORT: Malicious Script That Gets Rid of ADS, (Wed, Apr 1"
    },
    {
      "sid": 2461300,
      "msg": "CDB-SNORT: TeamPCP Supply Chain Campaign: Update 005 - First "
    },
    {
      "sid": 1223619,
      "msg": "CDB-SNORT: CVE-2026-22767 - Dell AppSync Symlink Following In"
    },
    {
      "sid": 5979410,
      "msg": "CDB-SNORT: CVE-2026-22768 - Dell AppSync Privilege Escalation"
    },
    {
      "sid": 1512886,
      "msg": "CDB-SNORT: SentinelOne autonomous detection blocks trojaned L"
    },
    {
      "sid": 2766930,
      "msg": "CDB-SNORT: New Chrome Zero-Day Vulnerability Actively Exploit"
    },
    {
      "sid": 3749750,
      "msg": "CDB-SNORT: Russian Hackers Using Remote Access Toolkit \u201cCTRL\u201d"
    },
    {
      "sid": 3507406,
      "msg": "CDB-SNORT: Hackers Actively Exploiting Critical WebLogic RCE "
    },
    {
      "sid": 7712051,
      "msg": "CDB-SNORT: Google Cloud\u2019s Vertex AI platform Vulnerability Al"
    },
    {
      "sid": 7468313,
      "msg": "CDB-SNORT: A laughing RAT: CrystalX combines spyware, stealer"
    },
    {
      "sid": 8686984,
      "msg": "CDB-SNORT: CVE-2026-5256 - code-projects Simple Laundry Syste"
    },
    {
      "sid": 6308109,
      "msg": "CDB-SNORT: CVE-2026-5257 - code-projects Simple Laundry Syste"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: CVE-2026-21765 - HCL BigFix Platform is ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Public PoC Exploit Released for Nginx-UI",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Google fixes fourth actively exploited C",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-34751 - Payload has Unvalidated",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-34875 - Mbed TLS FFDH Key Expor",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Industrialization of the Fraud Ecosystem",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Mercor confirms security incident tied t",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Magecart Hackers Uses 100+ Domains to Hi",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566.002\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-35093 - Libinput: libinput: una",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: North Korean hackers linked to Axios npm",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Google links Axios npm supply chain atta",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Google fixes Chrome zero-day with in-the",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Major Cyber Attacks in March 2026: OAuth",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Malicious Script That Gets Rid of ADS, (",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: TeamPCP Supply Chain Campaign: Update 00",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-22767 - Dell AppSync Symlink Fo",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-22768 - Dell AppSync Privilege ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: SentinelOne autonomous detection blocks ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: New Chrome Zero-Day Vulnerability Active",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Russian Hackers Using Remote Access Tool",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Actively Exploiting Critical Web",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Google Cloud\u2019s Vertex AI platform Vulner",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: A laughing RAT: CrystalX combines spywar",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1593\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5256 - code-projects Simple Lau",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5257 - code-projects Simple Lau",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 109,
    "sigma": 25,
    "yara": 9,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-04-02T03:37:57.595507+00:00"
}