{
  "detection_pack_id": "detpack--5144f18ed50b",
  "sigma_rules": [
    {
      "id": "sigma--d1186c721ba9",
      "title": "CDB-APEX: Trivy supply chain attack enabled European Commission cloud ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--5b7b0a235039",
      "title": "CDB-APEX: APERION releases SmartFlow SDK for secure, on-prem AI govern",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--8a8de620735f",
      "title": "CDB-APEX: CVE-2026-5463 - Metasploit Command Injection",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--05b51a455389",
      "title": "CDB-APEX: North Korea-Related Campaign Abuses GitHub as C2 in New LNK ",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--7433a80d87e6",
      "title": "CDB-APEX: North Korea-Linked Hackers Compromise Axios npm Package in M",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--7d6c2eaaecdd",
      "title": "CDB-APEX: Securing the Supply Chain: How SentinelOne\u00ae\u2019s AI EDR Stops t",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1199",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--aba9bfa78654",
      "title": "CDB-APEX: CVE-2026-32173 - Azure SRE Agent Information Disclosure Vuln",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--a25a60289e27",
      "title": "CDB-APEX: CVE-2026-32211 - Azure MCP Server Information Disclosure Vul",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--63a93cdbde7a",
      "title": "CDB-APEX: CVE-2026-32213 - Azure AI Foundry Elevation of Privilege Vul",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--9ae8724c86fa",
      "title": "CDB-APEX: CVE-2026-33105 - Microsoft Azure Kubernetes Service Elevatio",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--920d64cf89d7",
      "title": "CDB-APEX: CVE-2026-33107 - Azure Databricks Elevation of Privilege Vul",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--26a3ee8307ed",
      "title": "CDB-APEX: Adobe Breach \u2013 Threat Actor Allegedly Claims Leak of 13 Mill",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--3e0ef7aa0379",
      "title": "CDB-APEX: Software supply chain hacks trigger wave of intrusions, data",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--74f691d347b9",
      "title": "CDB-APEX: Latin America and the Caribbean Cybercrime Landscape",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.001",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--b9c01d281bd1",
      "title": "CDB-APEX: Wordfence Intelligence Weekly WordPress Vulnerability Report",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1176"
      ]
    },
    {
      "id": "sigma--9cfa66e14585",
      "title": "CDB-APEX: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2025-30208)",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1203",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--8a2919d75388",
      "title": "CDB-APEX: New Whitepaper: Stealthy BPFDoor Variants are a Needle That ",
      "level": "critical",
      "tags": [
        "attack.t1566.002",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--fc16d1ce84a8",
      "title": "CDB-APEX: vSphere and BRICKSTORM Malware: A Defender's Guide",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--3172beaa7175",
      "title": "CDB-APEX: ZDI-26-251: Foxit PDF Reader Update Service Uncontrolled Sea",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--1d36920c18cb",
      "title": "CDB-APEX: ZDI-26-252: Mozilla Firefox IonMonkey Switch Statement Optim",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1204.002"
      ]
    },
    {
      "id": "sigma--15f4d0cd62fd",
      "title": "CDB-APEX: ZDI-26-253: Microsoft Visual Studio Code mcp.json Command In",
      "level": "high",
      "tags": [
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--ff1e637f5414",
      "title": "CDB-APEX: CVE-2026-5368 - projectworlds Car Rental Project Parameter l",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--b14b9797f12e",
      "title": "CDB-APEX: Hitachi Energy Ellipse",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1567"
      ]
    },
    {
      "id": "sigma--1ea612c16924",
      "title": "CDB-APEX: Yokogawa CENTUM VP",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--ff9de8c371a5",
      "title": "CDB-APEX: Siemens SICAM 8 Products",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1542",
        "attack.t1499"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_5463___Metasploit_Com",
      "cves": [
        "CVE-2026-5463"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_32173___Azure_SRE_Age",
      "cves": [
        "CVE-2026-32173"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_32211___Azure_MCP_Ser",
      "cves": [
        "CVE-2026-32211"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_32213___Azure_AI_Foun",
      "cves": [
        "CVE-2026-32213"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_33105___Microsoft_Azu",
      "cves": [
        "CVE-2026-33105"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_33107___Azure_Databri",
      "cves": [
        "CVE-2026-33107"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_Attempts_to_Exploit_Exposed__V",
      "cves": [
        "CVE-2025-30208"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_5368___projectworlds_",
      "cves": [
        "CVE-2026-5368"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 4370571,
      "msg": "CDB APEX: Trivy supply chain attack enabled European Commiss",
      "severity": 1
    },
    {
      "sid": 6039508,
      "msg": "CDB APEX: APERION releases SmartFlow SDK for secure, on-prem",
      "severity": 2
    },
    {
      "sid": 2061731,
      "msg": "CDB APEX: CVE-2026-5463 - Metasploit Command Injection",
      "severity": 2
    },
    {
      "sid": 9935674,
      "msg": "CDB APEX: North Korea-Related Campaign Abuses GitHub as C2 i",
      "severity": 1
    },
    {
      "sid": 2774835,
      "msg": "CDB APEX: North Korea-Linked Hackers Compromise Axios npm Pa",
      "severity": 2
    },
    {
      "sid": 4420237,
      "msg": "CDB APEX: Securing the Supply Chain: How SentinelOne\u00ae\u2019s AI E",
      "severity": 1
    },
    {
      "sid": 6439013,
      "msg": "CDB APEX: CVE-2026-32173 - Azure SRE Agent Information Discl",
      "severity": 2
    },
    {
      "sid": 6809152,
      "msg": "CDB APEX: CVE-2026-32211 - Azure MCP Server Information Disc",
      "severity": 1
    },
    {
      "sid": 9741741,
      "msg": "CDB APEX: CVE-2026-32213 - Azure AI Foundry Elevation of Pri",
      "severity": 1
    },
    {
      "sid": 9936515,
      "msg": "CDB APEX: CVE-2026-33105 - Microsoft Azure Kubernetes Servic",
      "severity": 1
    },
    {
      "sid": 7989091,
      "msg": "CDB APEX: CVE-2026-33107 - Azure Databricks Elevation of Pri",
      "severity": 1
    },
    {
      "sid": 3219909,
      "msg": "CDB APEX: Adobe Breach \u2013 Threat Actor Allegedly Claims Leak ",
      "severity": 2
    },
    {
      "sid": 1852751,
      "msg": "CDB APEX: Software supply chain hacks trigger wave of intrus",
      "severity": 1
    },
    {
      "sid": 4596882,
      "msg": "CDB APEX: Latin America and the Caribbean Cybercrime Landsca",
      "severity": 1
    },
    {
      "sid": 7193508,
      "msg": "CDB APEX: Wordfence Intelligence Weekly WordPress Vulnerabil",
      "severity": 1
    },
    {
      "sid": 3625571,
      "msg": "CDB APEX: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2",
      "severity": 1
    },
    {
      "sid": 5459191,
      "msg": "CDB APEX: New Whitepaper: Stealthy BPFDoor Variants are a Ne",
      "severity": 1
    },
    {
      "sid": 9409854,
      "msg": "CDB APEX: vSphere and BRICKSTORM Malware: A Defender's Guide",
      "severity": 1
    },
    {
      "sid": 5305088,
      "msg": "CDB APEX: ZDI-26-251: Foxit PDF Reader Update Service Uncont",
      "severity": 2
    },
    {
      "sid": 9934632,
      "msg": "CDB APEX: ZDI-26-252: Mozilla Firefox IonMonkey Switch State",
      "severity": 1
    },
    {
      "sid": 4797823,
      "msg": "CDB APEX: ZDI-26-253: Microsoft Visual Studio Code mcp.json ",
      "severity": 2
    },
    {
      "sid": 5241542,
      "msg": "CDB APEX: CVE-2026-5368 - projectworlds Car Rental Project P",
      "severity": 2
    },
    {
      "sid": 2072282,
      "msg": "CDB APEX: Hitachi Energy Ellipse",
      "severity": 1
    },
    {
      "sid": 8203409,
      "msg": "CDB APEX: Yokogawa CENTUM VP",
      "severity": 2
    },
    {
      "sid": 2284907,
      "msg": "CDB APEX: Siemens SICAM 8 Products",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 4370572,
      "msg": "CDB-SNORT: Trivy supply chain attack enabled European Commiss"
    },
    {
      "sid": 6039509,
      "msg": "CDB-SNORT: APERION releases SmartFlow SDK for secure, on-prem"
    },
    {
      "sid": 2061732,
      "msg": "CDB-SNORT: CVE-2026-5463 - Metasploit Command Injection"
    },
    {
      "sid": 9935675,
      "msg": "CDB-SNORT: North Korea-Related Campaign Abuses GitHub as C2 i"
    },
    {
      "sid": 2774836,
      "msg": "CDB-SNORT: North Korea-Linked Hackers Compromise Axios npm Pa"
    },
    {
      "sid": 4420238,
      "msg": "CDB-SNORT: Securing the Supply Chain: How SentinelOne\u00ae\u2019s AI E"
    },
    {
      "sid": 6439014,
      "msg": "CDB-SNORT: CVE-2026-32173 - Azure SRE Agent Information Discl"
    },
    {
      "sid": 6809153,
      "msg": "CDB-SNORT: CVE-2026-32211 - Azure MCP Server Information Disc"
    },
    {
      "sid": 9741742,
      "msg": "CDB-SNORT: CVE-2026-32213 - Azure AI Foundry Elevation of Pri"
    },
    {
      "sid": 9936516,
      "msg": "CDB-SNORT: CVE-2026-33105 - Microsoft Azure Kubernetes Servic"
    },
    {
      "sid": 7989092,
      "msg": "CDB-SNORT: CVE-2026-33107 - Azure Databricks Elevation of Pri"
    },
    {
      "sid": 3219910,
      "msg": "CDB-SNORT: Adobe Breach \u2013 Threat Actor Allegedly Claims Leak "
    },
    {
      "sid": 1852752,
      "msg": "CDB-SNORT: Software supply chain hacks trigger wave of intrus"
    },
    {
      "sid": 4596883,
      "msg": "CDB-SNORT: Latin America and the Caribbean Cybercrime Landsca"
    },
    {
      "sid": 7193509,
      "msg": "CDB-SNORT: Wordfence Intelligence Weekly WordPress Vulnerabil"
    },
    {
      "sid": 3625572,
      "msg": "CDB-SNORT: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2"
    },
    {
      "sid": 5459192,
      "msg": "CDB-SNORT: New Whitepaper: Stealthy BPFDoor Variants are a Ne"
    },
    {
      "sid": 9409855,
      "msg": "CDB-SNORT: vSphere and BRICKSTORM Malware: A Defender's Guide"
    },
    {
      "sid": 5305089,
      "msg": "CDB-SNORT: ZDI-26-251: Foxit PDF Reader Update Service Uncont"
    },
    {
      "sid": 9934633,
      "msg": "CDB-SNORT: ZDI-26-252: Mozilla Firefox IonMonkey Switch State"
    },
    {
      "sid": 4797824,
      "msg": "CDB-SNORT: ZDI-26-253: Microsoft Visual Studio Code mcp.json "
    },
    {
      "sid": 5241543,
      "msg": "CDB-SNORT: CVE-2026-5368 - projectworlds Car Rental Project P"
    },
    {
      "sid": 2072283,
      "msg": "CDB-SNORT: Hitachi Energy Ellipse"
    },
    {
      "sid": 8203410,
      "msg": "CDB-SNORT: Yokogawa CENTUM VP"
    },
    {
      "sid": 2284908,
      "msg": "CDB-SNORT: Siemens SICAM 8 Products"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: Trivy supply chain attack enabled Europe",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: APERION releases SmartFlow SDK for secur",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5463 - Metasploit Command Injec",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: North Korea-Related Campaign Abuses GitH",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: North Korea-Linked Hackers Compromise Ax",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Securing the Supply Chain: How SentinelO",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-32173 - Azure SRE Agent Informa",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-32211 - Azure MCP Server Inform",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-32213 - Azure AI Foundry Elevat",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-33105 - Microsoft Azure Kuberne",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-33107 - Azure Databricks Elevat",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Adobe Breach \u2013 Threat Actor Allegedly Cl",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Software supply chain hacks trigger wave",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Latin America and the Caribbean Cybercri",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Wordfence Intelligence Weekly WordPress ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Attempts to Exploit Exposed \"Vite\" Insta",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: New Whitepaper: Stealthy BPFDoor Variant",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566.002\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: vSphere and BRICKSTORM Malware: A Defend",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-251: Foxit PDF Reader Update Serv",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-252: Mozilla Firefox IonMonkey Sw",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-253: Microsoft Visual Studio Code",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5368 - projectworlds Car Rental",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hitachi Energy Ellipse",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Yokogawa CENTUM VP",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Siemens SICAM 8 Products",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 108,
    "sigma": 25,
    "yara": 8,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-04-03T07:50:33.008495+00:00"
}