{
  "detection_pack_id": "detpack--cf1f9ebcc81a",
  "sigma_rules": [
    {
      "id": "sigma--3e3d41c24127",
      "title": "CDB-APEX: Cognizant\u2019s TriZetto Provider Solutions data breach impacted",
      "level": "critical",
      "tags": [
        "attack.t1190",
        "attack.t1555",
        "attack.t1530"
      ]
    },
    {
      "id": "sigma--053ad6f66639",
      "title": "CDB-APEX: CVE-2026-3816 - OWASP DefectDojo SonarQubeParser/MSDefenderP",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1499"
      ]
    },
    {
      "id": "sigma--389f0a0d6a16",
      "title": "CDB-APEX: Russia-linked hackers target Signal, WhatsApp of officials g",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1566.002"
      ]
    },
    {
      "id": "sigma--8c2c911e208b",
      "title": "CDB-APEX: Malicious npm Package Posing as OpenClaw Installer Deploys R",
      "level": "high",
      "tags": [
        "attack.t1078",
        "attack.t1547.001",
        "attack.t1036"
      ]
    },
    {
      "id": "sigma--bb4eedf02a0c",
      "title": "CDB-APEX: CISA Adds Three Known Exploited Vulnerabilities to Catalog",
      "level": "critical",
      "tags": [
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--78041b2441d3",
      "title": "CDB-APEX: Everon OCPP Backends",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1203",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--f3196352a9a0",
      "title": "CDB-APEX: Coruna: The Mysterious Journey of a Powerful iOS Exploit Kit",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--5d105aab1dc4",
      "title": "CDB-APEX: Silver Dragon Targets Organizations in Southeast Asia and Eu",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1078",
        "attack.t1476"
      ]
    },
    {
      "id": "sigma--4e149aab9849",
      "title": "CDB-APEX: FBI alert: scammers target zoning permit applicants",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1190",
        "attack.t1036"
      ]
    },
    {
      "id": "sigma--69c834e310eb",
      "title": "CDB-APEX: CVE-2026-27689 - Denial of service (DOS) in SAP Supply Chain",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--6c37551f7faa",
      "title": "CDB-APEX: Law enforcement disrupted Tycoon 2FA phishing-as-a-service p",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1199",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--89ca678e5f6c",
      "title": "CDB-APEX: APT28 Uses BEARDSHELL and COVENANT Malware to Spy on Ukraini",
      "level": "high",
      "tags": [
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--f69400598340",
      "title": "CDB-APEX: Threat actors use custom AuraInspector to harvest data from ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--e6fca3c9e0e1",
      "title": "CDB-APEX: U.S. CISA adds Ivanti EPM, SolarWinds, and Omnissa Workspace",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1199",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--812ede37cc4f",
      "title": "CDB-APEX: Ericsson US confirms breach after third-party provider attac",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1199",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--daf92bed5690",
      "title": "CDB-APEX: BeatBanker: A dual\u2011mode Android Trojan",
      "level": "critical",
      "tags": [
        "attack.t1583.001",
        "attack.t1566",
        "attack.t1566.002"
      ]
    },
    {
      "id": "sigma--01363bba4b8b",
      "title": "CDB-APEX: Interplay between Iranian Targeting of IP Cameras and Physic",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1078.001"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_3816___OWASP_DefectDo",
      "cves": [
        "CVE-2026-3816"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_27689___Denial_of_ser",
      "cves": [
        "CVE-2026-27689"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 1247657,
      "msg": "CDB APEX: Cognizant\u2019s TriZetto Provider Solutions data breac",
      "severity": 1
    },
    {
      "sid": 6276170,
      "msg": "CDB APEX: CVE-2026-3816 - OWASP DefectDojo SonarQubeParser/M",
      "severity": 2
    },
    {
      "sid": 6879669,
      "msg": "CDB APEX: Russia-linked hackers target Signal, WhatsApp of o",
      "severity": 1
    },
    {
      "sid": 1772427,
      "msg": "CDB APEX: Malicious npm Package Posing as OpenClaw Installer",
      "severity": 2
    },
    {
      "sid": 9163277,
      "msg": "CDB APEX: CISA Adds Three Known Exploited Vulnerabilities to",
      "severity": 1
    },
    {
      "sid": 9249882,
      "msg": "CDB APEX: Everon OCPP Backends",
      "severity": 1
    },
    {
      "sid": 3708018,
      "msg": "CDB APEX: Coruna: The Mysterious Journey of a Powerful iOS E",
      "severity": 1
    },
    {
      "sid": 9232913,
      "msg": "CDB APEX: Silver Dragon Targets Organizations in Southeast A",
      "severity": 1
    },
    {
      "sid": 8289701,
      "msg": "CDB APEX: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote",
      "severity": 2
    },
    {
      "sid": 4046451,
      "msg": "CDB APEX: FBI alert: scammers target zoning permit applicant",
      "severity": 1
    },
    {
      "sid": 2808396,
      "msg": "CDB APEX: CVE-2026-27689 - Denial of service (DOS) in SAP Su",
      "severity": 2
    },
    {
      "sid": 2288680,
      "msg": "CDB APEX: Law enforcement disrupted Tycoon 2FA phishing-as-a",
      "severity": 1
    },
    {
      "sid": 7398211,
      "msg": "CDB APEX: APT28 Uses BEARDSHELL and COVENANT Malware to Spy ",
      "severity": 2
    },
    {
      "sid": 6913971,
      "msg": "CDB APEX: Threat actors use custom AuraInspector to harvest ",
      "severity": 1
    },
    {
      "sid": 1714922,
      "msg": "CDB APEX: U.S. CISA adds Ivanti EPM, SolarWinds, and Omnissa",
      "severity": 1
    },
    {
      "sid": 7546840,
      "msg": "CDB APEX: Ericsson US confirms breach after third-party prov",
      "severity": 1
    },
    {
      "sid": 3102208,
      "msg": "CDB APEX: BeatBanker: A dual\u2011mode Android Trojan",
      "severity": 1
    },
    {
      "sid": 4621179,
      "msg": "CDB APEX: Interplay between Iranian Targeting of IP Cameras ",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 1247658,
      "msg": "CDB-SNORT: Cognizant\u2019s TriZetto Provider Solutions data breac"
    },
    {
      "sid": 6276171,
      "msg": "CDB-SNORT: CVE-2026-3816 - OWASP DefectDojo SonarQubeParser/M"
    },
    {
      "sid": 6879670,
      "msg": "CDB-SNORT: Russia-linked hackers target Signal, WhatsApp of o"
    },
    {
      "sid": 1772428,
      "msg": "CDB-SNORT: Malicious npm Package Posing as OpenClaw Installer"
    },
    {
      "sid": 9163278,
      "msg": "CDB-SNORT: CISA Adds Three Known Exploited Vulnerabilities to"
    },
    {
      "sid": 9249883,
      "msg": "CDB-SNORT: Everon OCPP Backends"
    },
    {
      "sid": 3708019,
      "msg": "CDB-SNORT: Coruna: The Mysterious Journey of a Powerful iOS E"
    },
    {
      "sid": 9232914,
      "msg": "CDB-SNORT: Silver Dragon Targets Organizations in Southeast A"
    },
    {
      "sid": 8289702,
      "msg": "CDB-SNORT: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote"
    },
    {
      "sid": 4046452,
      "msg": "CDB-SNORT: FBI alert: scammers target zoning permit applicant"
    },
    {
      "sid": 2808397,
      "msg": "CDB-SNORT: CVE-2026-27689 - Denial of service (DOS) in SAP Su"
    },
    {
      "sid": 2288681,
      "msg": "CDB-SNORT: Law enforcement disrupted Tycoon 2FA phishing-as-a"
    },
    {
      "sid": 7398212,
      "msg": "CDB-SNORT: APT28 Uses BEARDSHELL and COVENANT Malware to Spy "
    },
    {
      "sid": 6913972,
      "msg": "CDB-SNORT: Threat actors use custom AuraInspector to harvest "
    },
    {
      "sid": 1714923,
      "msg": "CDB-SNORT: U.S. CISA adds Ivanti EPM, SolarWinds, and Omnissa"
    },
    {
      "sid": 7546841,
      "msg": "CDB-SNORT: Ericsson US confirms breach after third-party prov"
    },
    {
      "sid": 3102209,
      "msg": "CDB-SNORT: BeatBanker: A dual\u2011mode Android Trojan"
    },
    {
      "sid": 4621180,
      "msg": "CDB-SNORT: Interplay between Iranian Targeting of IP Cameras "
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: Cognizant\u2019s TriZetto Provider Solutions ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-3816 - OWASP DefectDojo SonarQu",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Russia-linked hackers target Signal, Wha",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Malicious npm Package Posing as OpenClaw",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA Adds Three Known Exploited Vulnerab",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Everon OCPP Backends",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Coruna: The Mysterious Journey of a Powe",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Silver Dragon Targets Organizations in S",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: FBI alert: scammers target zoning permit",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-27689 - Denial of service (DOS)",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Law enforcement disrupted Tycoon 2FA phi",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: APT28 Uses BEARDSHELL and COVENANT Malwa",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1547\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Threat actors use custom AuraInspector t",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: U.S. CISA adds Ivanti EPM, SolarWinds, a",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Ericsson US confirms breach after third-",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: BeatBanker: A dual\u2011mode Android Trojan",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1583.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Interplay between Iranian Targeting of I",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 72,
    "sigma": 17,
    "yara": 2,
    "suricata": 18,
    "snort": 18,
    "edr": 17
  },
  "generated_at": "2026-03-10T13:51:26.989730+00:00"
}