{
  "detection_pack_id": "detpack--2b8e4f9ab0f2",
  "sigma_rules": [
    {
      "id": "sigma--c84cb69060d3",
      "title": "CDB-APEX: Attack on Stryker\u2019s Microsoft environment wiped employee dev",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--b88a7a20b5d4",
      "title": "CDB-APEX: Russia-linked APT uses DRILLAPP backdoor to spy on Ukrainian",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--678dca4d242d",
      "title": "CDB-APEX: CVE-2026-4253 - Tenda AC8 Web UploadCfg route_set_user_polic",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--f1337d8ae545",
      "title": "CDB-APEX: Ransomware Under Pressure: Tactics, Techniques, and Procedur",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--4d42dd5c7bed",
      "title": "CDB-APEX: CVE-2026-3644 - Incomplete control character validation in h",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--cf970842ae6e",
      "title": "CDB-APEX: Former Germany\u2019s foreign intelligence VP hit in Signal accou",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--040ea5490e8f",
      "title": "CDB-APEX: FBI launches inquiry into Steam games spreading malware",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1204.002",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--939389b0e17d",
      "title": "CDB-APEX: Free real estate: GoPix, the banking Trojan living off your ",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--be9ac45ca0b5",
      "title": "CDB-APEX: Security Advisory EPM February 2026 for EPM 2024",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--6a58e6dc4b5f",
      "title": "CDB-APEX: Unprivileged users could exploit AppArmor bugs to gain root ",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1542",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--8dbc3c59b309",
      "title": "CDB-APEX: Advanced Protection Mode in Android 17 prevents apps from mi",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1199",
        "attack.t1476"
      ]
    },
    {
      "id": "sigma--80c72cdb190b",
      "title": "CDB-APEX: The ransomware economy is shifting toward straight-up data e",
      "level": "high",
      "tags": [
        "attack.t1078",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--a3673605713b",
      "title": "CDB-APEX: Attackers are exploiting AI faster than defenders can keep u",
      "level": "high",
      "tags": [
        "attack.t1595",
        "attack.t1199",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--df7f539d72af",
      "title": "CDB-APEX: CYBERDUDEBIVASH Sentinel APEX\u2122 v55.3 Public Release The Next",
      "level": "high",
      "tags": [
        "attack.t1595",
        "attack.t1203",
        "attack.t1567"
      ]
    },
    {
      "id": "sigma--d14815754b38",
      "title": "CDB-APEX: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 Building a ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--ddfc0cf2430e",
      "title": "CDB-APEX: Arkanix Stealer: a C++ & Python infostealer",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--01c52c99f5e4",
      "title": "CDB-APEX: Exploits and vulnerabilities in Q4 2025",
      "level": "critical",
      "tags": [
        "attack.t1199",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--1e4933628ac8",
      "title": "CDB-APEX: OneClaw: Discovery and Observability for the Agentic Era",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--6214d39aa6c1",
      "title": "CDB-APEX: Trane Tracer SC, Tracer SC+, and Tracer Concierge",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1203",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--e9cec57d7112",
      "title": "CDB-APEX: How to manage the lifecycle of Amazon Machine Images using A",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1078",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--a360d84b5d1b",
      "title": "CDB-APEX: Iranian MOIS Actors & the Cyber Crime Connection",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1078",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--0d29bcbaae7f",
      "title": "CDB-APEX: \u201cHandala Hack\u201d \u2013 Unveiling Group\u2019s Modus Operandi",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--d5210e54d321",
      "title": "CDB-APEX: Microsoft launches new European Security Program",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--67ba56259c2d",
      "title": "CDB-APEX: Cross-border collaboration: International law enforcement an",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1036",
        "attack.t1486"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_4253___Tenda_AC8_Web_",
      "cves": [
        "CVE-2026-4253"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_3644___Incomplete_con",
      "cves": [
        "CVE-2026-3644"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 4415308,
      "msg": "CDB APEX: Attack on Stryker\u2019s Microsoft environment wiped em",
      "severity": 1
    },
    {
      "sid": 1328805,
      "msg": "CDB APEX: Russia-linked APT uses DRILLAPP backdoor to spy on",
      "severity": 1
    },
    {
      "sid": 7272577,
      "msg": "CDB APEX: CVE-2026-4253 - Tenda AC8 Web UploadCfg route_set_",
      "severity": 2
    },
    {
      "sid": 4367449,
      "msg": "CDB APEX: Ransomware Under Pressure: Tactics, Techniques, an",
      "severity": 1
    },
    {
      "sid": 4620596,
      "msg": "CDB APEX: CVE-2026-3644 - Incomplete control character valid",
      "severity": 2
    },
    {
      "sid": 4614668,
      "msg": "CDB APEX: Former Germany\u2019s foreign intelligence VP hit in Si",
      "severity": 1
    },
    {
      "sid": 6860878,
      "msg": "CDB APEX: FBI launches inquiry into Steam games spreading ma",
      "severity": 1
    },
    {
      "sid": 2848267,
      "msg": "CDB APEX: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote",
      "severity": 2
    },
    {
      "sid": 1012995,
      "msg": "CDB APEX: Free real estate: GoPix, the banking Trojan living",
      "severity": 1
    },
    {
      "sid": 7049387,
      "msg": "CDB APEX: Security Advisory EPM February 2026 for EPM 2024",
      "severity": 2
    },
    {
      "sid": 1139465,
      "msg": "CDB APEX: Unprivileged users could exploit AppArmor bugs to ",
      "severity": 1
    },
    {
      "sid": 8092317,
      "msg": "CDB APEX: Advanced Protection Mode in Android 17 prevents ap",
      "severity": 1
    },
    {
      "sid": 4604537,
      "msg": "CDB APEX: The ransomware economy is shifting toward straight",
      "severity": 2
    },
    {
      "sid": 7566464,
      "msg": "CDB APEX: Attackers are exploiting AI faster than defenders ",
      "severity": 2
    },
    {
      "sid": 9428887,
      "msg": "CDB APEX: CYBERDUDEBIVASH Sentinel APEX\u2122 v55.3 Public Releas",
      "severity": 2
    },
    {
      "sid": 7733755,
      "msg": "CDB APEX: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 B",
      "severity": 1
    },
    {
      "sid": 4060169,
      "msg": "CDB APEX: Arkanix Stealer: a C++ & Python infostealer",
      "severity": 1
    },
    {
      "sid": 4851728,
      "msg": "CDB APEX: Exploits and vulnerabilities in Q4 2025",
      "severity": 1
    },
    {
      "sid": 7523454,
      "msg": "CDB APEX: OneClaw: Discovery and Observability for the Agent",
      "severity": 2
    },
    {
      "sid": 1043532,
      "msg": "CDB APEX: Trane Tracer SC, Tracer SC+, and Tracer Concierge",
      "severity": 1
    },
    {
      "sid": 3651739,
      "msg": "CDB APEX: How to manage the lifecycle of Amazon Machine Imag",
      "severity": 1
    },
    {
      "sid": 3064742,
      "msg": "CDB APEX: Iranian MOIS Actors & the Cyber Crime Connection",
      "severity": 1
    },
    {
      "sid": 9893158,
      "msg": "CDB APEX: \u201cHandala Hack\u201d \u2013 Unveiling Group\u2019s Modus Operandi",
      "severity": 1
    },
    {
      "sid": 8452771,
      "msg": "CDB APEX: Microsoft launches new European Security Program",
      "severity": 1
    },
    {
      "sid": 4777616,
      "msg": "CDB APEX: Cross-border collaboration: International law enfo",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 4415309,
      "msg": "CDB-SNORT: Attack on Stryker\u2019s Microsoft environment wiped em"
    },
    {
      "sid": 1328806,
      "msg": "CDB-SNORT: Russia-linked APT uses DRILLAPP backdoor to spy on"
    },
    {
      "sid": 7272578,
      "msg": "CDB-SNORT: CVE-2026-4253 - Tenda AC8 Web UploadCfg route_set_"
    },
    {
      "sid": 4367450,
      "msg": "CDB-SNORT: Ransomware Under Pressure: Tactics, Techniques, an"
    },
    {
      "sid": 4620597,
      "msg": "CDB-SNORT: CVE-2026-3644 - Incomplete control character valid"
    },
    {
      "sid": 4614669,
      "msg": "CDB-SNORT: Former Germany\u2019s foreign intelligence VP hit in Si"
    },
    {
      "sid": 6860879,
      "msg": "CDB-SNORT: FBI launches inquiry into Steam games spreading ma"
    },
    {
      "sid": 2848268,
      "msg": "CDB-SNORT: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote"
    },
    {
      "sid": 1012996,
      "msg": "CDB-SNORT: Free real estate: GoPix, the banking Trojan living"
    },
    {
      "sid": 7049388,
      "msg": "CDB-SNORT: Security Advisory EPM February 2026 for EPM 2024"
    },
    {
      "sid": 1139466,
      "msg": "CDB-SNORT: Unprivileged users could exploit AppArmor bugs to "
    },
    {
      "sid": 8092318,
      "msg": "CDB-SNORT: Advanced Protection Mode in Android 17 prevents ap"
    },
    {
      "sid": 4604538,
      "msg": "CDB-SNORT: The ransomware economy is shifting toward straight"
    },
    {
      "sid": 7566465,
      "msg": "CDB-SNORT: Attackers are exploiting AI faster than defenders "
    },
    {
      "sid": 9428888,
      "msg": "CDB-SNORT: CYBERDUDEBIVASH Sentinel APEX\u2122 v55.3 Public Releas"
    },
    {
      "sid": 7733756,
      "msg": "CDB-SNORT: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 B"
    },
    {
      "sid": 4060170,
      "msg": "CDB-SNORT: Arkanix Stealer: a C++ & Python infostealer"
    },
    {
      "sid": 4851729,
      "msg": "CDB-SNORT: Exploits and vulnerabilities in Q4 2025"
    },
    {
      "sid": 7523455,
      "msg": "CDB-SNORT: OneClaw: Discovery and Observability for the Agent"
    },
    {
      "sid": 1043533,
      "msg": "CDB-SNORT: Trane Tracer SC, Tracer SC+, and Tracer Concierge"
    },
    {
      "sid": 3651740,
      "msg": "CDB-SNORT: How to manage the lifecycle of Amazon Machine Imag"
    },
    {
      "sid": 3064743,
      "msg": "CDB-SNORT: Iranian MOIS Actors & the Cyber Crime Connection"
    },
    {
      "sid": 9893159,
      "msg": "CDB-SNORT: \u201cHandala Hack\u201d \u2013 Unveiling Group\u2019s Modus Operandi"
    },
    {
      "sid": 8452772,
      "msg": "CDB-SNORT: Microsoft launches new European Security Program"
    },
    {
      "sid": 4777617,
      "msg": "CDB-SNORT: Cross-border collaboration: International law enfo"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: Attack on Stryker\u2019s Microsoft environmen",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Russia-linked APT uses DRILLAPP backdoor",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4253 - Tenda AC8 Web UploadCfg ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Ransomware Under Pressure: Tactics, Tech",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-3644 - Incomplete control chara",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Former Germany\u2019s foreign intelligence VP",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: FBI launches inquiry into Steam games sp",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Free real estate: GoPix, the banking Tro",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Security Advisory EPM February 2026 for ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Unprivileged users could exploit AppArmo",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Advanced Protection Mode in Android 17 p",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: The ransomware economy is shifting towar",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Attackers are exploiting AI faster than ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CYBERDUDEBIVASH Sentinel APEX\u2122 v55.3 Pub",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Official Launch: CYBERDUDEBIVASH\u00ae CyberT",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Arkanix Stealer: a C++ & Python infostea",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Exploits and vulnerabilities in Q4 2025",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1199\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: OneClaw: Discovery and Observability for",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Trane Tracer SC, Tracer SC+, and Tracer ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: How to manage the lifecycle of Amazon Ma",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Iranian MOIS Actors & the Cyber Crime Co",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: \u201cHandala Hack\u201d \u2013 Unveiling Group\u2019s Modus",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Microsoft launches new European Security",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Cross-border collaboration: Internationa",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 100,
    "sigma": 24,
    "yara": 2,
    "suricata": 25,
    "snort": 25,
    "edr": 24
  },
  "generated_at": "2026-03-23T03:37:59.679006+00:00"
}