{
  "detection_pack_id": "detpack--df98bdef8a8f",
  "sigma_rules": [
    {
      "id": "sigma--3e0ef7aa0379",
      "title": "CDB-APEX: Software supply chain hacks trigger wave of intrusions, data",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--74f691d347b9",
      "title": "CDB-APEX: Latin America and the Caribbean Cybercrime Landscape",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.001",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--b9c01d281bd1",
      "title": "CDB-APEX: Wordfence Intelligence Weekly WordPress Vulnerability Report",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1176"
      ]
    },
    {
      "id": "sigma--9cfa66e14585",
      "title": "CDB-APEX: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2025-30208)",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1203",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--8a2919d75388",
      "title": "CDB-APEX: New Whitepaper: Stealthy BPFDoor Variants are a Needle That ",
      "level": "critical",
      "tags": [
        "attack.t1566.002",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--fc16d1ce84a8",
      "title": "CDB-APEX: vSphere and BRICKSTORM Malware: A Defender's Guide",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--3172beaa7175",
      "title": "CDB-APEX: ZDI-26-251: Foxit PDF Reader Update Service Uncontrolled Sea",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--1d36920c18cb",
      "title": "CDB-APEX: ZDI-26-252: Mozilla Firefox IonMonkey Switch Statement Optim",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1204.002"
      ]
    },
    {
      "id": "sigma--15f4d0cd62fd",
      "title": "CDB-APEX: ZDI-26-253: Microsoft Visual Studio Code mcp.json Command In",
      "level": "high",
      "tags": [
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--ff1e637f5414",
      "title": "CDB-APEX: CVE-2026-5368 - projectworlds Car Rental Project Parameter l",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--b14b9797f12e",
      "title": "CDB-APEX: Hitachi Energy Ellipse",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1567"
      ]
    },
    {
      "id": "sigma--1ea612c16924",
      "title": "CDB-APEX: Yokogawa CENTUM VP",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--ff9de8c371a5",
      "title": "CDB-APEX: Siemens SICAM 8 Products",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1542",
        "attack.t1499"
      ]
    },
    {
      "id": "sigma--1368175afca6",
      "title": "CDB-APEX: Threat actor UAC-0255 impersonate CERT-UA to spread AGEWHEEZ",
      "level": "critical",
      "tags": [
        "attack.t1583.001",
        "attack.t1566",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--8729ae5fa34e",
      "title": "CDB-APEX: Cisco fixed critical and high-severity flaws",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--5eb0e3cdd5eb",
      "title": "CDB-APEX: Hasbro hit by cyberattack, investigates possible data breach",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--62aec6d9ecc7",
      "title": "CDB-APEX: OpenSSH 10.3 Fixes Shell Injection and Multiple SSH Security",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1475",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--8c20e9d59931",
      "title": "CDB-APEX: Qilin Ransomware Uses Malicious DLL to Kill Almost Every Ven",
      "level": "critical",
      "tags": [
        "attack.t1593",
        "attack.t1476",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--9389e592e019",
      "title": "CDB-APEX: Hackers Clone CERT-UA Site to Trick Victims Into Installing ",
      "level": "high",
      "tags": [
        "attack.t1583.001",
        "attack.t1566",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--c107b049c2fd",
      "title": "CDB-APEX: TrueConf zero-day vulnerability exploited to target governme",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--7df345175f89",
      "title": "CDB-APEX: The Identity Paradox: The Hidden Risks in Your Valid Credent",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--155061b984da",
      "title": "CDB-APEX: Italian spyware vendor creates Fake WhatsApp app, targeting ",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1475",
        "attack.t1195.003"
      ]
    },
    {
      "id": "sigma--417e626cb9f3",
      "title": "CDB-APEX: Cisco Smart Software Manager Vulnerability Let Attackers Exe",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1203",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--c55b4d821587",
      "title": "CDB-APEX: Apple Expands iOS 18.7.7 Update to More Devices to Shield Us",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1176"
      ]
    },
    {
      "id": "sigma--b5fe23b943b8",
      "title": "CDB-APEX: Microsoft Details Steps to Mitigate the Axios npm Supply Cha",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1078",
        "attack.t1203"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_Attempts_to_Exploit_Exposed__V",
      "cves": [
        "CVE-2025-30208"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_5368___projectworlds_",
      "cves": [
        "CVE-2026-5368"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 5731316,
      "msg": "CDB APEX: Software supply chain hacks trigger wave of intrus",
      "severity": 1
    },
    {
      "sid": 4262481,
      "msg": "CDB APEX: Latin America and the Caribbean Cybercrime Landsca",
      "severity": 1
    },
    {
      "sid": 6547254,
      "msg": "CDB APEX: Wordfence Intelligence Weekly WordPress Vulnerabil",
      "severity": 1
    },
    {
      "sid": 3918558,
      "msg": "CDB APEX: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2",
      "severity": 1
    },
    {
      "sid": 5961332,
      "msg": "CDB APEX: New Whitepaper: Stealthy BPFDoor Variants are a Ne",
      "severity": 1
    },
    {
      "sid": 9901888,
      "msg": "CDB APEX: vSphere and BRICKSTORM Malware: A Defender's Guide",
      "severity": 1
    },
    {
      "sid": 6447319,
      "msg": "CDB APEX: ZDI-26-251: Foxit PDF Reader Update Service Uncont",
      "severity": 2
    },
    {
      "sid": 9031212,
      "msg": "CDB APEX: ZDI-26-252: Mozilla Firefox IonMonkey Switch State",
      "severity": 1
    },
    {
      "sid": 1627215,
      "msg": "CDB APEX: ZDI-26-253: Microsoft Visual Studio Code mcp.json ",
      "severity": 2
    },
    {
      "sid": 7224089,
      "msg": "CDB APEX: CVE-2026-5368 - projectworlds Car Rental Project P",
      "severity": 2
    },
    {
      "sid": 9550611,
      "msg": "CDB APEX: Hitachi Energy Ellipse",
      "severity": 1
    },
    {
      "sid": 8492087,
      "msg": "CDB APEX: Yokogawa CENTUM VP",
      "severity": 2
    },
    {
      "sid": 7645941,
      "msg": "CDB APEX: Siemens SICAM 8 Products",
      "severity": 1
    },
    {
      "sid": 9131145,
      "msg": "CDB APEX: Threat actor UAC-0255 impersonate CERT-UA to sprea",
      "severity": 1
    },
    {
      "sid": 5683068,
      "msg": "CDB APEX: Cisco fixed critical and high-severity flaws",
      "severity": 1
    },
    {
      "sid": 2669086,
      "msg": "CDB APEX: Hasbro hit by cyberattack, investigates possible d",
      "severity": 1
    },
    {
      "sid": 3648178,
      "msg": "CDB APEX: OpenSSH 10.3 Fixes Shell Injection and Multiple SS",
      "severity": 1
    },
    {
      "sid": 7328447,
      "msg": "CDB APEX: Qilin Ransomware Uses Malicious DLL to Kill Almost",
      "severity": 1
    },
    {
      "sid": 1357575,
      "msg": "CDB APEX: Hackers Clone CERT-UA Site to Trick Victims Into I",
      "severity": 2
    },
    {
      "sid": 1719252,
      "msg": "CDB APEX: TrueConf zero-day vulnerability exploited to targe",
      "severity": 1
    },
    {
      "sid": 1853322,
      "msg": "CDB APEX: The Identity Paradox: The Hidden Risks in Your Val",
      "severity": 1
    },
    {
      "sid": 4862903,
      "msg": "CDB APEX: Italian spyware vendor creates Fake WhatsApp app, ",
      "severity": 1
    },
    {
      "sid": 4429562,
      "msg": "CDB APEX: Cisco Smart Software Manager Vulnerability Let Att",
      "severity": 1
    },
    {
      "sid": 2527582,
      "msg": "CDB APEX: Apple Expands iOS 18.7.7 Update to More Devices to",
      "severity": 1
    },
    {
      "sid": 5514206,
      "msg": "CDB APEX: Microsoft Details Steps to Mitigate the Axios npm ",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 5731317,
      "msg": "CDB-SNORT: Software supply chain hacks trigger wave of intrus"
    },
    {
      "sid": 4262482,
      "msg": "CDB-SNORT: Latin America and the Caribbean Cybercrime Landsca"
    },
    {
      "sid": 6547255,
      "msg": "CDB-SNORT: Wordfence Intelligence Weekly WordPress Vulnerabil"
    },
    {
      "sid": 3918559,
      "msg": "CDB-SNORT: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2"
    },
    {
      "sid": 5961333,
      "msg": "CDB-SNORT: New Whitepaper: Stealthy BPFDoor Variants are a Ne"
    },
    {
      "sid": 9901889,
      "msg": "CDB-SNORT: vSphere and BRICKSTORM Malware: A Defender's Guide"
    },
    {
      "sid": 6447320,
      "msg": "CDB-SNORT: ZDI-26-251: Foxit PDF Reader Update Service Uncont"
    },
    {
      "sid": 9031213,
      "msg": "CDB-SNORT: ZDI-26-252: Mozilla Firefox IonMonkey Switch State"
    },
    {
      "sid": 1627216,
      "msg": "CDB-SNORT: ZDI-26-253: Microsoft Visual Studio Code mcp.json "
    },
    {
      "sid": 7224090,
      "msg": "CDB-SNORT: CVE-2026-5368 - projectworlds Car Rental Project P"
    },
    {
      "sid": 9550612,
      "msg": "CDB-SNORT: Hitachi Energy Ellipse"
    },
    {
      "sid": 8492088,
      "msg": "CDB-SNORT: Yokogawa CENTUM VP"
    },
    {
      "sid": 7645942,
      "msg": "CDB-SNORT: Siemens SICAM 8 Products"
    },
    {
      "sid": 9131146,
      "msg": "CDB-SNORT: Threat actor UAC-0255 impersonate CERT-UA to sprea"
    },
    {
      "sid": 5683069,
      "msg": "CDB-SNORT: Cisco fixed critical and high-severity flaws"
    },
    {
      "sid": 2669087,
      "msg": "CDB-SNORT: Hasbro hit by cyberattack, investigates possible d"
    },
    {
      "sid": 3648179,
      "msg": "CDB-SNORT: OpenSSH 10.3 Fixes Shell Injection and Multiple SS"
    },
    {
      "sid": 7328448,
      "msg": "CDB-SNORT: Qilin Ransomware Uses Malicious DLL to Kill Almost"
    },
    {
      "sid": 1357576,
      "msg": "CDB-SNORT: Hackers Clone CERT-UA Site to Trick Victims Into I"
    },
    {
      "sid": 1719253,
      "msg": "CDB-SNORT: TrueConf zero-day vulnerability exploited to targe"
    },
    {
      "sid": 1853323,
      "msg": "CDB-SNORT: The Identity Paradox: The Hidden Risks in Your Val"
    },
    {
      "sid": 4862904,
      "msg": "CDB-SNORT: Italian spyware vendor creates Fake WhatsApp app, "
    },
    {
      "sid": 4429563,
      "msg": "CDB-SNORT: Cisco Smart Software Manager Vulnerability Let Att"
    },
    {
      "sid": 2527583,
      "msg": "CDB-SNORT: Apple Expands iOS 18.7.7 Update to More Devices to"
    },
    {
      "sid": 5514207,
      "msg": "CDB-SNORT: Microsoft Details Steps to Mitigate the Axios npm "
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: Software supply chain hacks trigger wave",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Latin America and the Caribbean Cybercri",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Wordfence Intelligence Weekly WordPress ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Attempts to Exploit Exposed \"Vite\" Insta",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: New Whitepaper: Stealthy BPFDoor Variant",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566.002\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: vSphere and BRICKSTORM Malware: A Defend",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-251: Foxit PDF Reader Update Serv",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-252: Mozilla Firefox IonMonkey Sw",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-253: Microsoft Visual Studio Code",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5368 - projectworlds Car Rental",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hitachi Energy Ellipse",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Yokogawa CENTUM VP",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Siemens SICAM 8 Products",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Threat actor UAC-0255 impersonate CERT-U",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1583.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Cisco fixed critical and high-severity f",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hasbro hit by cyberattack, investigates ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: OpenSSH 10.3 Fixes Shell Injection and M",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Qilin Ransomware Uses Malicious DLL to K",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1593\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Clone CERT-UA Site to Trick Vict",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1583.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: TrueConf zero-day vulnerability exploite",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: The Identity Paradox: The Hidden Risks i",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Italian spyware vendor creates Fake What",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Cisco Smart Software Manager Vulnerabili",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Apple Expands iOS 18.7.7 Update to More ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Microsoft Details Steps to Mitigate the ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 102,
    "sigma": 25,
    "yara": 2,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-04-02T19:39:08.137755+00:00"
}