{
  "detection_pack_id": "detpack--2a9bf438924c",
  "sigma_rules": [
    {
      "id": "sigma--e209d66c0e3e",
      "title": "CDB-APEX: Iran-linked hackers target IP cameras across Israel and Gulf",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1078.001",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--120f4c2de0ce",
      "title": "CDB-APEX: \u2018Starkiller\u2019 Phishing Service Proxies Real Login Pages, MFA",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1204.001"
      ]
    },
    {
      "id": "sigma--70166ab63271",
      "title": "CDB-APEX: Reading White House President Trump\u2019s Cyber Strategy for Ame",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1204.001"
      ]
    },
    {
      "id": "sigma--7f44f188a224",
      "title": "CDB-APEX: CVE-2026-30863 - Parse Server: JWT audience validation bypas",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--3b24d370cd9d",
      "title": "CDB-APEX: FBI probing intrusion into a system managing sensitive surve",
      "level": "high",
      "tags": [
        "attack.t1190",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--5d23fd8832e6",
      "title": "CDB-APEX: CVE-2026-3714 - OpenCart Incomplete Fix CVE-2024-36694 templ",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--b999d42c217b",
      "title": "CDB-APEX: Security Affairs newsletter Round 566 by Pierluigi Paganini ",
      "level": "critical",
      "tags": [
        "attack.t1593",
        "attack.t1566",
        "attack.t1566.002"
      ]
    },
    {
      "id": "sigma--f5260168e567",
      "title": "CDB-APEX: Massive GitHub malware operation spreads BoryptGrab stealer",
      "level": "critical",
      "tags": [
        "attack.t1059.001",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--b36798a88da7",
      "title": "CDB-APEX: SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 87",
      "level": "critical",
      "tags": [
        "attack.t1593",
        "attack.t1566",
        "attack.t1566.001"
      ]
    },
    {
      "id": "sigma--1beb34f95e84",
      "title": "CDB-APEX: Exposing the Undercurrent: Disrupting the GRIDTIDE Global Cy",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--e132e06df22d",
      "title": "CDB-APEX: From BRICKSTORM to GRIMBOLT: UNC6201 Exploiting a Dell Recov",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1203",
        "attack.t1059"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_30863___Parse_Server_",
      "cves": [
        "CVE-2026-30863"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_3714___OpenCart_Incom",
      "cves": [
        "CVE-2026-3714",
        "CVE-2024-36694"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 8162109,
      "msg": "CDB APEX: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote",
      "severity": 2
    },
    {
      "sid": 7918847,
      "msg": "CDB APEX: Iran-linked hackers target IP cameras across Israe",
      "severity": 1
    },
    {
      "sid": 4650204,
      "msg": "CDB APEX: \u2018Starkiller\u2019 Phishing Service Proxies Real Login P",
      "severity": 1
    },
    {
      "sid": 4907201,
      "msg": "CDB APEX: Reading White House President Trump\u2019s Cyber Strate",
      "severity": 1
    },
    {
      "sid": 1899363,
      "msg": "CDB APEX: CVE-2026-30863 - Parse Server: JWT audience valida",
      "severity": 2
    },
    {
      "sid": 5476986,
      "msg": "CDB APEX: FBI probing intrusion into a system managing sensi",
      "severity": 2
    },
    {
      "sid": 1129725,
      "msg": "CDB APEX: CVE-2026-3714 - OpenCart Incomplete Fix CVE-2024-3",
      "severity": 2
    },
    {
      "sid": 8965064,
      "msg": "CDB APEX: Security Affairs newsletter Round 566 by Pierluigi",
      "severity": 1
    },
    {
      "sid": 3554723,
      "msg": "CDB APEX: Massive GitHub malware operation spreads BoryptGra",
      "severity": 1
    },
    {
      "sid": 8410764,
      "msg": "CDB APEX: SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 87",
      "severity": 1
    },
    {
      "sid": 5095214,
      "msg": "CDB APEX: Exposing the Undercurrent: Disrupting the GRIDTIDE",
      "severity": 1
    },
    {
      "sid": 9117867,
      "msg": "CDB APEX: From BRICKSTORM to GRIMBOLT: UNC6201 Exploiting a ",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 8162110,
      "msg": "CDB-SNORT: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote"
    },
    {
      "sid": 7918848,
      "msg": "CDB-SNORT: Iran-linked hackers target IP cameras across Israe"
    },
    {
      "sid": 4650205,
      "msg": "CDB-SNORT: \u2018Starkiller\u2019 Phishing Service Proxies Real Login P"
    },
    {
      "sid": 4907202,
      "msg": "CDB-SNORT: Reading White House President Trump\u2019s Cyber Strate"
    },
    {
      "sid": 1899364,
      "msg": "CDB-SNORT: CVE-2026-30863 - Parse Server: JWT audience valida"
    },
    {
      "sid": 5476987,
      "msg": "CDB-SNORT: FBI probing intrusion into a system managing sensi"
    },
    {
      "sid": 1129726,
      "msg": "CDB-SNORT: CVE-2026-3714 - OpenCart Incomplete Fix CVE-2024-3"
    },
    {
      "sid": 8965065,
      "msg": "CDB-SNORT: Security Affairs newsletter Round 566 by Pierluigi"
    },
    {
      "sid": 3554724,
      "msg": "CDB-SNORT: Massive GitHub malware operation spreads BoryptGra"
    },
    {
      "sid": 8410765,
      "msg": "CDB-SNORT: SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 87"
    },
    {
      "sid": 5095215,
      "msg": "CDB-SNORT: Exposing the Undercurrent: Disrupting the GRIDTIDE"
    },
    {
      "sid": 9117868,
      "msg": "CDB-SNORT: From BRICKSTORM to GRIMBOLT: UNC6201 Exploiting a "
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: Iran-linked hackers target IP cameras ac",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: \u2018Starkiller\u2019 Phishing Service Proxies Re",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Reading White House President Trump\u2019s Cy",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-30863 - Parse Server: JWT audie",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: FBI probing intrusion into a system mana",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-3714 - OpenCart Incomplete Fix ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Security Affairs newsletter Round 566 by",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1593\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Massive GitHub malware operation spreads",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: SECURITY AFFAIRS MALWARE NEWSLETTER ROUN",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1593\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Exposing the Undercurrent: Disrupting th",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: From BRICKSTORM to GRIMBOLT: UNC6201 Exp",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 48,
    "sigma": 11,
    "yara": 2,
    "suricata": 12,
    "snort": 12,
    "edr": 11
  },
  "generated_at": "2026-03-08T19:04:08.973258+00:00"
}