{
  "detection_pack_id": "detpack--07d9c278d320",
  "sigma_rules": [
    {
      "id": "sigma--69c834e310eb",
      "title": "CDB-APEX: CVE-2026-27689 - Denial of service (DOS) in SAP Supply Chain",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--6c37551f7faa",
      "title": "CDB-APEX: Law enforcement disrupted Tycoon 2FA phishing-as-a-service p",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1199",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--89ca678e5f6c",
      "title": "CDB-APEX: APT28 Uses BEARDSHELL and COVENANT Malware to Spy on Ukraini",
      "level": "high",
      "tags": [
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--f69400598340",
      "title": "CDB-APEX: Threat actors use custom AuraInspector to harvest data from ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--e6fca3c9e0e1",
      "title": "CDB-APEX: U.S. CISA adds Ivanti EPM, SolarWinds, and Omnissa Workspace",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1199",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--812ede37cc4f",
      "title": "CDB-APEX: Ericsson US confirms breach after third-party provider attac",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1199",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--daf92bed5690",
      "title": "CDB-APEX: BeatBanker: A dual\u2011mode Android Trojan",
      "level": "critical",
      "tags": [
        "attack.t1583.001",
        "attack.t1566",
        "attack.t1566.002"
      ]
    },
    {
      "id": "sigma--01363bba4b8b",
      "title": "CDB-APEX: Interplay between Iranian Targeting of IP Cameras and Physic",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1078.001"
      ]
    },
    {
      "id": "sigma--9a04ea13e299",
      "title": "CDB-APEX: APT28 conducts long-term espionage on Ukrainian forces using",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1199",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--4e0f2059c01f",
      "title": "CDB-APEX: FortiGate Edge Intrusions | Stolen Service Accounts Lead to ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1078",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--3a043718945e",
      "title": "CDB-APEX: Mobile malware evolution in 2025",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--0b004cdda2bf",
      "title": "CDB-APEX: AWS Security Hub is expanding to unify security operations a",
      "level": "high",
      "tags": [
        "attack.t1595",
        "attack.t1542",
        "attack.t1556"
      ]
    },
    {
      "id": "sigma--d1706d15429f",
      "title": "CDB-APEX: Microsoft\u2019s monthly Patch Tuesday is first in 6 months with ",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1486"
      ]
    },
    {
      "id": "sigma--2475519da978",
      "title": "CDB-APEX: FBI says even in an AI-powered world, security basics still ",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1555",
        "attack.t1111"
      ]
    },
    {
      "id": "sigma--ce84d1ba3d98",
      "title": "CDB-APEX: Critical defect in Java security engine poses serious downst",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1486"
      ]
    },
    {
      "id": "sigma--1847737162da",
      "title": "CDB-APEX: Attackers exploit FortiGate devices to access sensitive netw",
      "level": "critical",
      "tags": [
        "attack.t1199",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--a360d84b5d1b",
      "title": "CDB-APEX: Iranian MOIS Actors & the Cyber Crime Connection",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1078",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--adcb9884398f",
      "title": "CDB-APEX: Security is a team sport: AWS at RSAC 2026 Conference",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1542"
      ]
    },
    {
      "id": "sigma--08acfc1ed8e1",
      "title": "CDB-APEX: Microsoft Patch Tuesday, March 2026 Edition",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1542",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--c7e32fd9383c",
      "title": "CDB-APEX: Microsoft Patch Tuesday security updates for March 2026 fixe",
      "level": "critical",
      "tags": [
        "attack.t1199",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--94c322bb52b7",
      "title": "CDB-APEX: Honeywell IQ4x BMS Controller",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1203",
        "attack.t1542"
      ]
    },
    {
      "id": "sigma--8c5c38954ee4",
      "title": "CDB-APEX: Ceragon Siklu MultiHaul and EtherHaul Series",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1542",
        "attack.t1486"
      ]
    },
    {
      "id": "sigma--dda4dde0f3a3",
      "title": "CDB-APEX: Apeman Cameras",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--279e21394076",
      "title": "CDB-APEX: Lantronix EDS3000PS and EDS5000",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1203",
        "attack.t1542"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_27689___Denial_of_ser",
      "cves": [
        "CVE-2026-27689"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 5451717,
      "msg": "CDB APEX: CVE-2026-27689 - Denial of service (DOS) in SAP Su",
      "severity": 2
    },
    {
      "sid": 5459194,
      "msg": "CDB APEX: Law enforcement disrupted Tycoon 2FA phishing-as-a",
      "severity": 1
    },
    {
      "sid": 9027953,
      "msg": "CDB APEX: APT28 Uses BEARDSHELL and COVENANT Malware to Spy ",
      "severity": 2
    },
    {
      "sid": 1196610,
      "msg": "CDB APEX: Threat actors use custom AuraInspector to harvest ",
      "severity": 1
    },
    {
      "sid": 7467688,
      "msg": "CDB APEX: U.S. CISA adds Ivanti EPM, SolarWinds, and Omnissa",
      "severity": 1
    },
    {
      "sid": 2809456,
      "msg": "CDB APEX: Ericsson US confirms breach after third-party prov",
      "severity": 1
    },
    {
      "sid": 4988278,
      "msg": "CDB APEX: BeatBanker: A dual\u2011mode Android Trojan",
      "severity": 1
    },
    {
      "sid": 2438321,
      "msg": "CDB APEX: Interplay between Iranian Targeting of IP Cameras ",
      "severity": 1
    },
    {
      "sid": 2178798,
      "msg": "CDB APEX: KadNap Malware Infects 14,000+ Edge Devices to Pow",
      "severity": 2
    },
    {
      "sid": 6109343,
      "msg": "CDB APEX: APT28 conducts long-term espionage on Ukrainian fo",
      "severity": 1
    },
    {
      "sid": 2435326,
      "msg": "CDB APEX: FortiGate Edge Intrusions | Stolen Service Account",
      "severity": 1
    },
    {
      "sid": 6651116,
      "msg": "CDB APEX: Mobile malware evolution in 2025",
      "severity": 1
    },
    {
      "sid": 6249488,
      "msg": "CDB APEX: AWS Security Hub is expanding to unify security op",
      "severity": 2
    },
    {
      "sid": 6621027,
      "msg": "CDB APEX: Microsoft\u2019s monthly Patch Tuesday is first in 6 mo",
      "severity": 1
    },
    {
      "sid": 2633003,
      "msg": "CDB APEX: FBI says even in an AI-powered world, security bas",
      "severity": 2
    },
    {
      "sid": 8078257,
      "msg": "CDB APEX: Critical defect in Java security engine poses seri",
      "severity": 2
    },
    {
      "sid": 5577865,
      "msg": "CDB APEX: Attackers exploit FortiGate devices to access sens",
      "severity": 1
    },
    {
      "sid": 2859034,
      "msg": "CDB APEX: Iranian MOIS Actors & the Cyber Crime Connection",
      "severity": 1
    },
    {
      "sid": 2137929,
      "msg": "CDB APEX: Security is a team sport: AWS at RSAC 2026 Confere",
      "severity": 1
    },
    {
      "sid": 9859595,
      "msg": "CDB APEX: Microsoft Patch Tuesday, March 2026 Edition",
      "severity": 1
    },
    {
      "sid": 3449771,
      "msg": "CDB APEX: Microsoft Patch Tuesday security updates for March",
      "severity": 1
    },
    {
      "sid": 5780999,
      "msg": "CDB APEX: Honeywell IQ4x BMS Controller",
      "severity": 1
    },
    {
      "sid": 6952810,
      "msg": "CDB APEX: Ceragon Siklu MultiHaul and EtherHaul Series",
      "severity": 1
    },
    {
      "sid": 5676829,
      "msg": "CDB APEX: Apeman Cameras",
      "severity": 1
    },
    {
      "sid": 6057589,
      "msg": "CDB APEX: Lantronix EDS3000PS and EDS5000",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 5451718,
      "msg": "CDB-SNORT: CVE-2026-27689 - Denial of service (DOS) in SAP Su"
    },
    {
      "sid": 5459195,
      "msg": "CDB-SNORT: Law enforcement disrupted Tycoon 2FA phishing-as-a"
    },
    {
      "sid": 9027954,
      "msg": "CDB-SNORT: APT28 Uses BEARDSHELL and COVENANT Malware to Spy "
    },
    {
      "sid": 1196611,
      "msg": "CDB-SNORT: Threat actors use custom AuraInspector to harvest "
    },
    {
      "sid": 7467689,
      "msg": "CDB-SNORT: U.S. CISA adds Ivanti EPM, SolarWinds, and Omnissa"
    },
    {
      "sid": 2809457,
      "msg": "CDB-SNORT: Ericsson US confirms breach after third-party prov"
    },
    {
      "sid": 4988279,
      "msg": "CDB-SNORT: BeatBanker: A dual\u2011mode Android Trojan"
    },
    {
      "sid": 2438322,
      "msg": "CDB-SNORT: Interplay between Iranian Targeting of IP Cameras "
    },
    {
      "sid": 2178799,
      "msg": "CDB-SNORT: KadNap Malware Infects 14,000+ Edge Devices to Pow"
    },
    {
      "sid": 6109344,
      "msg": "CDB-SNORT: APT28 conducts long-term espionage on Ukrainian fo"
    },
    {
      "sid": 2435327,
      "msg": "CDB-SNORT: FortiGate Edge Intrusions | Stolen Service Account"
    },
    {
      "sid": 6651117,
      "msg": "CDB-SNORT: Mobile malware evolution in 2025"
    },
    {
      "sid": 6249489,
      "msg": "CDB-SNORT: AWS Security Hub is expanding to unify security op"
    },
    {
      "sid": 6621028,
      "msg": "CDB-SNORT: Microsoft\u2019s monthly Patch Tuesday is first in 6 mo"
    },
    {
      "sid": 2633004,
      "msg": "CDB-SNORT: FBI says even in an AI-powered world, security bas"
    },
    {
      "sid": 8078258,
      "msg": "CDB-SNORT: Critical defect in Java security engine poses seri"
    },
    {
      "sid": 5577866,
      "msg": "CDB-SNORT: Attackers exploit FortiGate devices to access sens"
    },
    {
      "sid": 2859035,
      "msg": "CDB-SNORT: Iranian MOIS Actors & the Cyber Crime Connection"
    },
    {
      "sid": 2137930,
      "msg": "CDB-SNORT: Security is a team sport: AWS at RSAC 2026 Confere"
    },
    {
      "sid": 9859596,
      "msg": "CDB-SNORT: Microsoft Patch Tuesday, March 2026 Edition"
    },
    {
      "sid": 3449772,
      "msg": "CDB-SNORT: Microsoft Patch Tuesday security updates for March"
    },
    {
      "sid": 5781000,
      "msg": "CDB-SNORT: Honeywell IQ4x BMS Controller"
    },
    {
      "sid": 6952811,
      "msg": "CDB-SNORT: Ceragon Siklu MultiHaul and EtherHaul Series"
    },
    {
      "sid": 5676830,
      "msg": "CDB-SNORT: Apeman Cameras"
    },
    {
      "sid": 6057590,
      "msg": "CDB-SNORT: Lantronix EDS3000PS and EDS5000"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: CVE-2026-27689 - Denial of service (DOS)",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Law enforcement disrupted Tycoon 2FA phi",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: APT28 Uses BEARDSHELL and COVENANT Malwa",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1547\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Threat actors use custom AuraInspector t",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: U.S. CISA adds Ivanti EPM, SolarWinds, a",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Ericsson US confirms breach after third-",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: BeatBanker: A dual\u2011mode Android Trojan",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1583.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Interplay between Iranian Targeting of I",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: APT28 conducts long-term espionage on Uk",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: FortiGate Edge Intrusions | Stolen Servi",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Mobile malware evolution in 2025",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: AWS Security Hub is expanding to unify s",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Microsoft\u2019s monthly Patch Tuesday is fir",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: FBI says even in an AI-powered world, se",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Critical defect in Java security engine ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Attackers exploit FortiGate devices to a",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1199\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Iranian MOIS Actors & the Cyber Crime Co",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Security is a team sport: AWS at RSAC 20",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Microsoft Patch Tuesday, March 2026 Edit",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Microsoft Patch Tuesday security updates",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1199\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Honeywell IQ4x BMS Controller",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Ceragon Siklu MultiHaul and EtherHaul Se",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Apeman Cameras",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Lantronix EDS3000PS and EDS5000",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 99,
    "sigma": 24,
    "yara": 1,
    "suricata": 25,
    "snort": 25,
    "edr": 24
  },
  "generated_at": "2026-03-11T07:34:54.374574+00:00"
}