{
  "detection_pack_id": "detpack--51c8237f135d",
  "sigma_rules": [
    {
      "id": "sigma--3efe35c2b29f",
      "title": "CDB-APEX: CVE-2026-0545 - Missing Authentication for Critical Function",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1555",
        "attack.t1499"
      ]
    },
    {
      "id": "sigma--7f94bbb89e8a",
      "title": "CDB-APEX: CVE-2026-28373 - Stackfield Desktop App Path Traversal Vulne",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--be6d7204a4cb",
      "title": "CDB-APEX: Blast Radius of TeamPCP Attacks Expands Amid Hacker Infighti",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--a469a8730613",
      "title": "CDB-APEX: North Korea\u2013linked hackers drain $285M from Drift in sophist",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--1644bd02ac3d",
      "title": "CDB-APEX: EU cyber agency attributes major data breach to TeamPCP hack",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--8b3ea5291c4c",
      "title": "CDB-APEX: Hackers Abuse Trusted Platforms to Steal Bank Credentials Fr",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--14a87e40b60e",
      "title": "CDB-APEX: Axios Maintainer Confirms The npm Compromise Was via a Targe",
      "level": "high",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--6599b0b3a3cd",
      "title": "CDB-APEX: Kimsuky Deploys Malicious LNK Files to Deliver Python-Based ",
      "level": "high",
      "tags": [
        "attack.t1059.001",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--6daba68611e0",
      "title": "CDB-APEX: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid Active RCE",
      "level": "critical",
      "tags": [
        "attack.t1190",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--cdb2c305f6c3",
      "title": "CDB-APEX: Claude Code source leak exploited to spread malware",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--156612cc7eeb",
      "title": "CDB-APEX: Cisco IMC auth bypass vulnerability allows attackers to alte",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1204"
      ]
    },
    {
      "id": "sigma--94f9d8647cca",
      "title": "CDB-APEX: TeamPCP Supply Chain Campaign: Update 006 - CERT-EU Confirms",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1078",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--08c16dc7803f",
      "title": "CDB-APEX: The Good, the Bad and the Ugly in Cybersecurity \u2013 Week 14",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--2e29db4208de",
      "title": "CDB-APEX: CVE-2025-7024 - Local privilege escalation in Windows Server",
      "level": "high",
      "tags": [
        "attack.t1059",
        "attack.t1204",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--58374a58243e",
      "title": "CDB-APEX: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authenticated (Subs",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--b5f1de1b5e8b",
      "title": "CDB-APEX: CVE-2026-28754 - Stored XSS Vulnerability",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--5b019d3a4281",
      "title": "CDB-APEX: CVE-2026-28756 - Stored XSS Vulnerability",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--2413741cdcf7",
      "title": "CDB-APEX: CISA Adds One Known Exploited Vulnerability to Catalog",
      "level": "high",
      "tags": [
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--b777e7f5d40d",
      "title": "CDB-APEX: Pro-Iran Handala group breached Israeli defence contractor P",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--5d6cd0280204",
      "title": "CDB-APEX: Multiple TP-Link Vulnerabilities Let Attackers Trigger DoS a",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--77b99327e881",
      "title": "CDB-APEX: Hackers Use Venom Stealer to Turn ClickFix Lures Into Full D",
      "level": "high",
      "tags": [
        "attack.t1078",
        "attack.t1203",
        "attack.t1059.001"
      ]
    },
    {
      "id": "sigma--f7b53b5e9ddf",
      "title": "CDB-APEX: Hackers Use Phorpiex Botnet to Spread Ransomware, Sextortion",
      "level": "high",
      "tags": [
        "attack.t1204.001",
        "attack.t1547.001",
        "attack.t1542"
      ]
    },
    {
      "id": "sigma--d1186c721ba9",
      "title": "CDB-APEX: Trivy supply chain attack enabled European Commission cloud ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--5b7b0a235039",
      "title": "CDB-APEX: APERION releases SmartFlow SDK for secure, on-prem AI govern",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--8a8de620735f",
      "title": "CDB-APEX: CVE-2026-5463 - Metasploit Command Injection",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_0545___Missing_Authen",
      "cves": [
        "CVE-2026-0545"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_28373___Stackfield_De",
      "cves": [
        "CVE-2026-28373"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_Cisco_IMC_auth_bypass_vulnerab",
      "cves": [
        "CVE-2026-20093"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2025_7024___Local_privileg",
      "cves": [
        "CVE-2025-7024"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_4350___Perfmatters___",
      "cves": [
        "CVE-2026-4350"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_28754___Stored_XSS_Vu",
      "cves": [
        "CVE-2026-28754"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_28756___Stored_XSS_Vu",
      "cves": [
        "CVE-2026-28756"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5463___Metasploit_Com",
      "cves": [
        "CVE-2026-5463"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 4088986,
      "msg": "CDB APEX: CVE-2026-0545 - Missing Authentication for Critica",
      "severity": 1
    },
    {
      "sid": 6019004,
      "msg": "CDB APEX: CVE-2026-28373 - Stackfield Desktop App Path Trave",
      "severity": 1
    },
    {
      "sid": 1617406,
      "msg": "CDB APEX: Blast Radius of TeamPCP Attacks Expands Amid Hacke",
      "severity": 2
    },
    {
      "sid": 8209993,
      "msg": "CDB APEX: North Korea\u2013linked hackers drain $285M from Drift ",
      "severity": 2
    },
    {
      "sid": 9872245,
      "msg": "CDB APEX: EU cyber agency attributes major data breach to Te",
      "severity": 2
    },
    {
      "sid": 6543635,
      "msg": "CDB APEX: Hackers Abuse Trusted Platforms to Steal Bank Cred",
      "severity": 1
    },
    {
      "sid": 7785397,
      "msg": "CDB APEX: Axios Maintainer Confirms The npm Compromise Was v",
      "severity": 2
    },
    {
      "sid": 6068164,
      "msg": "CDB APEX: Kimsuky Deploys Malicious LNK Files to Deliver Pyt",
      "severity": 2
    },
    {
      "sid": 3268689,
      "msg": "CDB APEX: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid ",
      "severity": 1
    },
    {
      "sid": 6351790,
      "msg": "CDB APEX: Claude Code source leak exploited to spread malwar",
      "severity": 2
    },
    {
      "sid": 4577204,
      "msg": "CDB APEX: Cisco IMC auth bypass vulnerability allows attacke",
      "severity": 1
    },
    {
      "sid": 8635548,
      "msg": "CDB APEX: TeamPCP Supply Chain Campaign: Update 006 - CERT-E",
      "severity": 1
    },
    {
      "sid": 5518212,
      "msg": "CDB APEX: The Good, the Bad and the Ugly in Cybersecurity \u2013 ",
      "severity": 1
    },
    {
      "sid": 1666523,
      "msg": "CDB APEX: CVE-2025-7024 - Local privilege escalation in Wind",
      "severity": 2
    },
    {
      "sid": 8616345,
      "msg": "CDB APEX: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authentic",
      "severity": 2
    },
    {
      "sid": 1305606,
      "msg": "CDB APEX: CVE-2026-28754 - Stored XSS Vulnerability",
      "severity": 2
    },
    {
      "sid": 7564470,
      "msg": "CDB APEX: CVE-2026-28756 - Stored XSS Vulnerability",
      "severity": 2
    },
    {
      "sid": 1689903,
      "msg": "CDB APEX: CISA Adds One Known Exploited Vulnerability to Cat",
      "severity": 2
    },
    {
      "sid": 2111788,
      "msg": "CDB APEX: Pro-Iran Handala group breached Israeli defence co",
      "severity": 2
    },
    {
      "sid": 4302819,
      "msg": "CDB APEX: Multiple TP-Link Vulnerabilities Let Attackers Tri",
      "severity": 1
    },
    {
      "sid": 1978526,
      "msg": "CDB APEX: Hackers Use Venom Stealer to Turn ClickFix Lures I",
      "severity": 2
    },
    {
      "sid": 4589852,
      "msg": "CDB APEX: Hackers Use Phorpiex Botnet to Spread Ransomware, ",
      "severity": 2
    },
    {
      "sid": 8736005,
      "msg": "CDB APEX: Trivy supply chain attack enabled European Commiss",
      "severity": 1
    },
    {
      "sid": 7637917,
      "msg": "CDB APEX: APERION releases SmartFlow SDK for secure, on-prem",
      "severity": 2
    },
    {
      "sid": 1937647,
      "msg": "CDB APEX: CVE-2026-5463 - Metasploit Command Injection",
      "severity": 2
    }
  ],
  "snort_rules": [
    {
      "sid": 4088987,
      "msg": "CDB-SNORT: CVE-2026-0545 - Missing Authentication for Critica"
    },
    {
      "sid": 6019005,
      "msg": "CDB-SNORT: CVE-2026-28373 - Stackfield Desktop App Path Trave"
    },
    {
      "sid": 1617407,
      "msg": "CDB-SNORT: Blast Radius of TeamPCP Attacks Expands Amid Hacke"
    },
    {
      "sid": 8209994,
      "msg": "CDB-SNORT: North Korea\u2013linked hackers drain $285M from Drift "
    },
    {
      "sid": 9872246,
      "msg": "CDB-SNORT: EU cyber agency attributes major data breach to Te"
    },
    {
      "sid": 6543636,
      "msg": "CDB-SNORT: Hackers Abuse Trusted Platforms to Steal Bank Cred"
    },
    {
      "sid": 7785398,
      "msg": "CDB-SNORT: Axios Maintainer Confirms The npm Compromise Was v"
    },
    {
      "sid": 6068165,
      "msg": "CDB-SNORT: Kimsuky Deploys Malicious LNK Files to Deliver Pyt"
    },
    {
      "sid": 3268690,
      "msg": "CDB-SNORT: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid "
    },
    {
      "sid": 6351791,
      "msg": "CDB-SNORT: Claude Code source leak exploited to spread malwar"
    },
    {
      "sid": 4577205,
      "msg": "CDB-SNORT: Cisco IMC auth bypass vulnerability allows attacke"
    },
    {
      "sid": 8635549,
      "msg": "CDB-SNORT: TeamPCP Supply Chain Campaign: Update 006 - CERT-E"
    },
    {
      "sid": 5518213,
      "msg": "CDB-SNORT: The Good, the Bad and the Ugly in Cybersecurity \u2013 "
    },
    {
      "sid": 1666524,
      "msg": "CDB-SNORT: CVE-2025-7024 - Local privilege escalation in Wind"
    },
    {
      "sid": 8616346,
      "msg": "CDB-SNORT: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authentic"
    },
    {
      "sid": 1305607,
      "msg": "CDB-SNORT: CVE-2026-28754 - Stored XSS Vulnerability"
    },
    {
      "sid": 7564471,
      "msg": "CDB-SNORT: CVE-2026-28756 - Stored XSS Vulnerability"
    },
    {
      "sid": 1689904,
      "msg": "CDB-SNORT: CISA Adds One Known Exploited Vulnerability to Cat"
    },
    {
      "sid": 2111789,
      "msg": "CDB-SNORT: Pro-Iran Handala group breached Israeli defence co"
    },
    {
      "sid": 4302820,
      "msg": "CDB-SNORT: Multiple TP-Link Vulnerabilities Let Attackers Tri"
    },
    {
      "sid": 1978527,
      "msg": "CDB-SNORT: Hackers Use Venom Stealer to Turn ClickFix Lures I"
    },
    {
      "sid": 4589853,
      "msg": "CDB-SNORT: Hackers Use Phorpiex Botnet to Spread Ransomware, "
    },
    {
      "sid": 8736006,
      "msg": "CDB-SNORT: Trivy supply chain attack enabled European Commiss"
    },
    {
      "sid": 7637918,
      "msg": "CDB-SNORT: APERION releases SmartFlow SDK for secure, on-prem"
    },
    {
      "sid": 1937648,
      "msg": "CDB-SNORT: CVE-2026-5463 - Metasploit Command Injection"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: CVE-2026-0545 - Missing Authentication f",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-28373 - Stackfield Desktop App ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Blast Radius of TeamPCP Attacks Expands ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: North Korea\u2013linked hackers drain $285M f",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: EU cyber agency attributes major data br",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Abuse Trusted Platforms to Steal",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Axios Maintainer Confirms The npm Compro",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Kimsuky Deploys Malicious LNK Files to D",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: 14,000+ F5 BIG-IP APM Devices Exposed On",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Claude Code source leak exploited to spr",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Cisco IMC auth bypass vulnerability allo",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: TeamPCP Supply Chain Campaign: Update 00",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: The Good, the Bad and the Ugly in Cybers",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2025-7024 - Local privilege escalati",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4350 - Perfmatters <= 2.5.9.1 -",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-28754 - Stored XSS Vulnerabilit",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-28756 - Stored XSS Vulnerabilit",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA Adds One Known Exploited Vulnerabil",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Pro-Iran Handala group breached Israeli ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Multiple TP-Link Vulnerabilities Let Att",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Use Venom Stealer to Turn ClickF",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Use Phorpiex Botnet to Spread Ra",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1204.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Trivy supply chain attack enabled Europe",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: APERION releases SmartFlow SDK for secur",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5463 - Metasploit Command Injec",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 108,
    "sigma": 25,
    "yara": 8,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-04-03T19:29:36.503819+00:00"
}