{
  "detection_pack_id": "detpack--f9ecef55757b",
  "sigma_rules": [
    {
      "id": "sigma--cec4783922f5",
      "title": "CDB-APEX: That dream job offer from Coca-Cola or Ferrari? It\u2019s a trap ",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--361a1dba3348",
      "title": "CDB-APEX: Metasploit Wrap-Up 04/03/2026",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--2d3ee5f61ae7",
      "title": "CDB-APEX: CVE-2026-34955 - PraisonAI: Sandbox Escape via shell=True an",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--d7034fd570b1",
      "title": "CDB-APEX: CVE-2026-34780 - Electron: Context Isolation bypass via cont",
      "level": "high",
      "tags": [
        "attack.t1059",
        "attack.t1567"
      ]
    },
    {
      "id": "sigma--8b642f205ed4",
      "title": "CDB-APEX: CVE-2026-35616 - Fortinet FortiClientEMS Remote Code Executi",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--25d36ce4a98e",
      "title": "CDB-APEX: CISA gives agencies two weeks to patch video conferencing bu",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1203",
        "attack.t1204.002"
      ]
    },
    {
      "id": "sigma--4ed45d87ea5d",
      "title": "CDB-APEX: High-Stakes Security: Protecting the Digital Infrastructure ",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1190",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--3efe35c2b29f",
      "title": "CDB-APEX: CVE-2026-0545 - Missing Authentication for Critical Function",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1555",
        "attack.t1499"
      ]
    },
    {
      "id": "sigma--7f94bbb89e8a",
      "title": "CDB-APEX: CVE-2026-28373 - Stackfield Desktop App Path Traversal Vulne",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--be6d7204a4cb",
      "title": "CDB-APEX: Blast Radius of TeamPCP Attacks Expands Amid Hacker Infighti",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--a469a8730613",
      "title": "CDB-APEX: North Korea\u2013linked hackers drain $285M from Drift in sophist",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--1644bd02ac3d",
      "title": "CDB-APEX: EU cyber agency attributes major data breach to TeamPCP hack",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--8b3ea5291c4c",
      "title": "CDB-APEX: Hackers Abuse Trusted Platforms to Steal Bank Credentials Fr",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--14a87e40b60e",
      "title": "CDB-APEX: Axios Maintainer Confirms The npm Compromise Was via a Targe",
      "level": "high",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--6599b0b3a3cd",
      "title": "CDB-APEX: Kimsuky Deploys Malicious LNK Files to Deliver Python-Based ",
      "level": "high",
      "tags": [
        "attack.t1059.001",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--6daba68611e0",
      "title": "CDB-APEX: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid Active RCE",
      "level": "critical",
      "tags": [
        "attack.t1190",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--cdb2c305f6c3",
      "title": "CDB-APEX: Claude Code source leak exploited to spread malware",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--156612cc7eeb",
      "title": "CDB-APEX: Cisco IMC auth bypass vulnerability allows attackers to alte",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1204"
      ]
    },
    {
      "id": "sigma--94f9d8647cca",
      "title": "CDB-APEX: TeamPCP Supply Chain Campaign: Update 006 - CERT-EU Confirms",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1078",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--08c16dc7803f",
      "title": "CDB-APEX: The Good, the Bad and the Ugly in Cybersecurity \u2013 Week 14",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--2e29db4208de",
      "title": "CDB-APEX: CVE-2025-7024 - Local privilege escalation in Windows Server",
      "level": "high",
      "tags": [
        "attack.t1059",
        "attack.t1204",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--58374a58243e",
      "title": "CDB-APEX: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authenticated (Subs",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--b5f1de1b5e8b",
      "title": "CDB-APEX: CVE-2026-28754 - Stored XSS Vulnerability",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--5b019d3a4281",
      "title": "CDB-APEX: CVE-2026-28756 - Stored XSS Vulnerability",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--2413741cdcf7",
      "title": "CDB-APEX: CISA Adds One Known Exploited Vulnerability to Catalog",
      "level": "high",
      "tags": [
        "attack.t1203"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_34955___PraisonAI__Sa",
      "cves": [
        "CVE-2026-34955"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_34780___Electron__Con",
      "cves": [
        "CVE-2026-34780"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_35616___Fortinet_Fort",
      "cves": [
        "CVE-2026-35616"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_0545___Missing_Authen",
      "cves": [
        "CVE-2026-0545"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_28373___Stackfield_De",
      "cves": [
        "CVE-2026-28373"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_Cisco_IMC_auth_bypass_vulnerab",
      "cves": [
        "CVE-2026-20093"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2025_7024___Local_privileg",
      "cves": [
        "CVE-2025-7024"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_4350___Perfmatters___",
      "cves": [
        "CVE-2026-4350"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_28754___Stored_XSS_Vu",
      "cves": [
        "CVE-2026-28754"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_28756___Stored_XSS_Vu",
      "cves": [
        "CVE-2026-28756"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 1438349,
      "msg": "CDB APEX: That dream job offer from Coca-Cola or Ferrari? It",
      "severity": 2
    },
    {
      "sid": 8703811,
      "msg": "CDB APEX: Metasploit Wrap-Up 04/03/2026",
      "severity": 1
    },
    {
      "sid": 4834664,
      "msg": "CDB APEX: CVE-2026-34955 - PraisonAI: Sandbox Escape via she",
      "severity": 2
    },
    {
      "sid": 2661865,
      "msg": "CDB APEX: CVE-2026-34780 - Electron: Context Isolation bypas",
      "severity": 2
    },
    {
      "sid": 3290154,
      "msg": "CDB APEX: CVE-2026-35616 - Fortinet FortiClientEMS Remote Co",
      "severity": 1
    },
    {
      "sid": 6963249,
      "msg": "CDB APEX: CISA gives agencies two weeks to patch video confe",
      "severity": 1
    },
    {
      "sid": 5024883,
      "msg": "CDB APEX: High-Stakes Security: Protecting the Digital Infra",
      "severity": 1
    },
    {
      "sid": 7095059,
      "msg": "CDB APEX: CVE-2026-0545 - Missing Authentication for Critica",
      "severity": 1
    },
    {
      "sid": 2662512,
      "msg": "CDB APEX: CVE-2026-28373 - Stackfield Desktop App Path Trave",
      "severity": 1
    },
    {
      "sid": 8124071,
      "msg": "CDB APEX: Blast Radius of TeamPCP Attacks Expands Amid Hacke",
      "severity": 2
    },
    {
      "sid": 7967267,
      "msg": "CDB APEX: North Korea\u2013linked hackers drain $285M from Drift ",
      "severity": 2
    },
    {
      "sid": 2452815,
      "msg": "CDB APEX: EU cyber agency attributes major data breach to Te",
      "severity": 2
    },
    {
      "sid": 6874563,
      "msg": "CDB APEX: Hackers Abuse Trusted Platforms to Steal Bank Cred",
      "severity": 1
    },
    {
      "sid": 8878749,
      "msg": "CDB APEX: Axios Maintainer Confirms The npm Compromise Was v",
      "severity": 2
    },
    {
      "sid": 8013812,
      "msg": "CDB APEX: Kimsuky Deploys Malicious LNK Files to Deliver Pyt",
      "severity": 2
    },
    {
      "sid": 1371593,
      "msg": "CDB APEX: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid ",
      "severity": 1
    },
    {
      "sid": 1058793,
      "msg": "CDB APEX: Claude Code source leak exploited to spread malwar",
      "severity": 2
    },
    {
      "sid": 4114248,
      "msg": "CDB APEX: Cisco IMC auth bypass vulnerability allows attacke",
      "severity": 1
    },
    {
      "sid": 8149446,
      "msg": "CDB APEX: TeamPCP Supply Chain Campaign: Update 006 - CERT-E",
      "severity": 1
    },
    {
      "sid": 2395924,
      "msg": "CDB APEX: The Good, the Bad and the Ugly in Cybersecurity \u2013 ",
      "severity": 1
    },
    {
      "sid": 9005011,
      "msg": "CDB APEX: CVE-2025-7024 - Local privilege escalation in Wind",
      "severity": 2
    },
    {
      "sid": 6332207,
      "msg": "CDB APEX: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authentic",
      "severity": 2
    },
    {
      "sid": 7452452,
      "msg": "CDB APEX: CVE-2026-28754 - Stored XSS Vulnerability",
      "severity": 2
    },
    {
      "sid": 5310652,
      "msg": "CDB APEX: CVE-2026-28756 - Stored XSS Vulnerability",
      "severity": 2
    },
    {
      "sid": 9426811,
      "msg": "CDB APEX: CISA Adds One Known Exploited Vulnerability to Cat",
      "severity": 2
    }
  ],
  "snort_rules": [
    {
      "sid": 1438350,
      "msg": "CDB-SNORT: That dream job offer from Coca-Cola or Ferrari? It"
    },
    {
      "sid": 8703812,
      "msg": "CDB-SNORT: Metasploit Wrap-Up 04/03/2026"
    },
    {
      "sid": 4834665,
      "msg": "CDB-SNORT: CVE-2026-34955 - PraisonAI: Sandbox Escape via she"
    },
    {
      "sid": 2661866,
      "msg": "CDB-SNORT: CVE-2026-34780 - Electron: Context Isolation bypas"
    },
    {
      "sid": 3290155,
      "msg": "CDB-SNORT: CVE-2026-35616 - Fortinet FortiClientEMS Remote Co"
    },
    {
      "sid": 6963250,
      "msg": "CDB-SNORT: CISA gives agencies two weeks to patch video confe"
    },
    {
      "sid": 5024884,
      "msg": "CDB-SNORT: High-Stakes Security: Protecting the Digital Infra"
    },
    {
      "sid": 7095060,
      "msg": "CDB-SNORT: CVE-2026-0545 - Missing Authentication for Critica"
    },
    {
      "sid": 2662513,
      "msg": "CDB-SNORT: CVE-2026-28373 - Stackfield Desktop App Path Trave"
    },
    {
      "sid": 8124072,
      "msg": "CDB-SNORT: Blast Radius of TeamPCP Attacks Expands Amid Hacke"
    },
    {
      "sid": 7967268,
      "msg": "CDB-SNORT: North Korea\u2013linked hackers drain $285M from Drift "
    },
    {
      "sid": 2452816,
      "msg": "CDB-SNORT: EU cyber agency attributes major data breach to Te"
    },
    {
      "sid": 6874564,
      "msg": "CDB-SNORT: Hackers Abuse Trusted Platforms to Steal Bank Cred"
    },
    {
      "sid": 8878750,
      "msg": "CDB-SNORT: Axios Maintainer Confirms The npm Compromise Was v"
    },
    {
      "sid": 8013813,
      "msg": "CDB-SNORT: Kimsuky Deploys Malicious LNK Files to Deliver Pyt"
    },
    {
      "sid": 1371594,
      "msg": "CDB-SNORT: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid "
    },
    {
      "sid": 1058794,
      "msg": "CDB-SNORT: Claude Code source leak exploited to spread malwar"
    },
    {
      "sid": 4114249,
      "msg": "CDB-SNORT: Cisco IMC auth bypass vulnerability allows attacke"
    },
    {
      "sid": 8149447,
      "msg": "CDB-SNORT: TeamPCP Supply Chain Campaign: Update 006 - CERT-E"
    },
    {
      "sid": 2395925,
      "msg": "CDB-SNORT: The Good, the Bad and the Ugly in Cybersecurity \u2013 "
    },
    {
      "sid": 9005012,
      "msg": "CDB-SNORT: CVE-2025-7024 - Local privilege escalation in Wind"
    },
    {
      "sid": 6332208,
      "msg": "CDB-SNORT: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authentic"
    },
    {
      "sid": 7452453,
      "msg": "CDB-SNORT: CVE-2026-28754 - Stored XSS Vulnerability"
    },
    {
      "sid": 5310653,
      "msg": "CDB-SNORT: CVE-2026-28756 - Stored XSS Vulnerability"
    },
    {
      "sid": 9426812,
      "msg": "CDB-SNORT: CISA Adds One Known Exploited Vulnerability to Cat"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: That dream job offer from Coca-Cola or F",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Metasploit Wrap-Up 04/03/2026",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-34955 - PraisonAI: Sandbox Esca",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-34780 - Electron: Context Isola",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-35616 - Fortinet FortiClientEMS",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA gives agencies two weeks to patch v",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: High-Stakes Security: Protecting the Dig",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-0545 - Missing Authentication f",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-28373 - Stackfield Desktop App ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Blast Radius of TeamPCP Attacks Expands ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: North Korea\u2013linked hackers drain $285M f",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: EU cyber agency attributes major data br",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Abuse Trusted Platforms to Steal",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Axios Maintainer Confirms The npm Compro",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Kimsuky Deploys Malicious LNK Files to D",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: 14,000+ F5 BIG-IP APM Devices Exposed On",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Claude Code source leak exploited to spr",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Cisco IMC auth bypass vulnerability allo",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: TeamPCP Supply Chain Campaign: Update 00",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: The Good, the Bad and the Ugly in Cybers",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2025-7024 - Local privilege escalati",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4350 - Perfmatters <= 2.5.9.1 -",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-28754 - Stored XSS Vulnerabilit",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-28756 - Stored XSS Vulnerabilit",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA Adds One Known Exploited Vulnerabil",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 110,
    "sigma": 25,
    "yara": 10,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-04-04T03:27:59.659141+00:00"
}