{
  "detection_pack_id": "detpack--d371a922fd68",
  "sigma_rules": [
    {
      "id": "sigma--7d6c2eaaecdd",
      "title": "CDB-APEX: Securing the Supply Chain: How SentinelOne\u00ae\u2019s AI EDR Stops t",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1199",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--aba9bfa78654",
      "title": "CDB-APEX: CVE-2026-32173 - Azure SRE Agent Information Disclosure Vuln",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--a25a60289e27",
      "title": "CDB-APEX: CVE-2026-32211 - Azure MCP Server Information Disclosure Vul",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--63a93cdbde7a",
      "title": "CDB-APEX: CVE-2026-32213 - Azure AI Foundry Elevation of Privilege Vul",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--9ae8724c86fa",
      "title": "CDB-APEX: CVE-2026-33105 - Microsoft Azure Kubernetes Service Elevatio",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--920d64cf89d7",
      "title": "CDB-APEX: CVE-2026-33107 - Azure Databricks Elevation of Privilege Vul",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--26a3ee8307ed",
      "title": "CDB-APEX: Adobe Breach \u2013 Threat Actor Allegedly Claims Leak of 13 Mill",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--3e0ef7aa0379",
      "title": "CDB-APEX: Software supply chain hacks trigger wave of intrusions, data",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--74f691d347b9",
      "title": "CDB-APEX: Latin America and the Caribbean Cybercrime Landscape",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.001",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--b9c01d281bd1",
      "title": "CDB-APEX: Wordfence Intelligence Weekly WordPress Vulnerability Report",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1176"
      ]
    },
    {
      "id": "sigma--9cfa66e14585",
      "title": "CDB-APEX: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2025-30208)",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1203",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--8a2919d75388",
      "title": "CDB-APEX: New Whitepaper: Stealthy BPFDoor Variants are a Needle That ",
      "level": "critical",
      "tags": [
        "attack.t1566.002",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--fc16d1ce84a8",
      "title": "CDB-APEX: vSphere and BRICKSTORM Malware: A Defender's Guide",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--3172beaa7175",
      "title": "CDB-APEX: ZDI-26-251: Foxit PDF Reader Update Service Uncontrolled Sea",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--1d36920c18cb",
      "title": "CDB-APEX: ZDI-26-252: Mozilla Firefox IonMonkey Switch Statement Optim",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1204.002"
      ]
    },
    {
      "id": "sigma--15f4d0cd62fd",
      "title": "CDB-APEX: ZDI-26-253: Microsoft Visual Studio Code mcp.json Command In",
      "level": "high",
      "tags": [
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--ff1e637f5414",
      "title": "CDB-APEX: CVE-2026-5368 - projectworlds Car Rental Project Parameter l",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--b14b9797f12e",
      "title": "CDB-APEX: Hitachi Energy Ellipse",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1567"
      ]
    },
    {
      "id": "sigma--1ea612c16924",
      "title": "CDB-APEX: Yokogawa CENTUM VP",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--ff9de8c371a5",
      "title": "CDB-APEX: Siemens SICAM 8 Products",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1542",
        "attack.t1499"
      ]
    },
    {
      "id": "sigma--1368175afca6",
      "title": "CDB-APEX: Threat actor UAC-0255 impersonate CERT-UA to spread AGEWHEEZ",
      "level": "critical",
      "tags": [
        "attack.t1583.001",
        "attack.t1566",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--8729ae5fa34e",
      "title": "CDB-APEX: Cisco fixed critical and high-severity flaws",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--5eb0e3cdd5eb",
      "title": "CDB-APEX: Hasbro hit by cyberattack, investigates possible data breach",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--62aec6d9ecc7",
      "title": "CDB-APEX: OpenSSH 10.3 Fixes Shell Injection and Multiple SSH Security",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1475",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--8c20e9d59931",
      "title": "CDB-APEX: Qilin Ransomware Uses Malicious DLL to Kill Almost Every Ven",
      "level": "critical",
      "tags": [
        "attack.t1593",
        "attack.t1476",
        "attack.t1203"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_32173___Azure_SRE_Age",
      "cves": [
        "CVE-2026-32173"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_32211___Azure_MCP_Ser",
      "cves": [
        "CVE-2026-32211"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_32213___Azure_AI_Foun",
      "cves": [
        "CVE-2026-32213"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_33105___Microsoft_Azu",
      "cves": [
        "CVE-2026-33105"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_33107___Azure_Databri",
      "cves": [
        "CVE-2026-33107"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_Attempts_to_Exploit_Exposed__V",
      "cves": [
        "CVE-2025-30208"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_5368___projectworlds_",
      "cves": [
        "CVE-2026-5368"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 3368696,
      "msg": "CDB APEX: Securing the Supply Chain: How SentinelOne\u00ae\u2019s AI E",
      "severity": 1
    },
    {
      "sid": 2926313,
      "msg": "CDB APEX: CVE-2026-32173 - Azure SRE Agent Information Discl",
      "severity": 2
    },
    {
      "sid": 3080414,
      "msg": "CDB APEX: CVE-2026-32211 - Azure MCP Server Information Disc",
      "severity": 1
    },
    {
      "sid": 2635288,
      "msg": "CDB APEX: CVE-2026-32213 - Azure AI Foundry Elevation of Pri",
      "severity": 1
    },
    {
      "sid": 4545544,
      "msg": "CDB APEX: CVE-2026-33105 - Microsoft Azure Kubernetes Servic",
      "severity": 1
    },
    {
      "sid": 8025619,
      "msg": "CDB APEX: CVE-2026-33107 - Azure Databricks Elevation of Pri",
      "severity": 1
    },
    {
      "sid": 6372692,
      "msg": "CDB APEX: Adobe Breach \u2013 Threat Actor Allegedly Claims Leak ",
      "severity": 2
    },
    {
      "sid": 6238516,
      "msg": "CDB APEX: Software supply chain hacks trigger wave of intrus",
      "severity": 1
    },
    {
      "sid": 4793366,
      "msg": "CDB APEX: Latin America and the Caribbean Cybercrime Landsca",
      "severity": 1
    },
    {
      "sid": 3164554,
      "msg": "CDB APEX: Wordfence Intelligence Weekly WordPress Vulnerabil",
      "severity": 1
    },
    {
      "sid": 9488293,
      "msg": "CDB APEX: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2",
      "severity": 1
    },
    {
      "sid": 4388456,
      "msg": "CDB APEX: New Whitepaper: Stealthy BPFDoor Variants are a Ne",
      "severity": 1
    },
    {
      "sid": 7192889,
      "msg": "CDB APEX: vSphere and BRICKSTORM Malware: A Defender's Guide",
      "severity": 1
    },
    {
      "sid": 1327692,
      "msg": "CDB APEX: ZDI-26-251: Foxit PDF Reader Update Service Uncont",
      "severity": 2
    },
    {
      "sid": 8918594,
      "msg": "CDB APEX: ZDI-26-252: Mozilla Firefox IonMonkey Switch State",
      "severity": 1
    },
    {
      "sid": 7473156,
      "msg": "CDB APEX: ZDI-26-253: Microsoft Visual Studio Code mcp.json ",
      "severity": 2
    },
    {
      "sid": 2882530,
      "msg": "CDB APEX: CVE-2026-5368 - projectworlds Car Rental Project P",
      "severity": 2
    },
    {
      "sid": 3753343,
      "msg": "CDB APEX: Hitachi Energy Ellipse",
      "severity": 1
    },
    {
      "sid": 6748097,
      "msg": "CDB APEX: Yokogawa CENTUM VP",
      "severity": 2
    },
    {
      "sid": 8430806,
      "msg": "CDB APEX: Siemens SICAM 8 Products",
      "severity": 1
    },
    {
      "sid": 6325448,
      "msg": "CDB APEX: Threat actor UAC-0255 impersonate CERT-UA to sprea",
      "severity": 1
    },
    {
      "sid": 3996571,
      "msg": "CDB APEX: Cisco fixed critical and high-severity flaws",
      "severity": 1
    },
    {
      "sid": 7796146,
      "msg": "CDB APEX: Hasbro hit by cyberattack, investigates possible d",
      "severity": 1
    },
    {
      "sid": 1250064,
      "msg": "CDB APEX: OpenSSH 10.3 Fixes Shell Injection and Multiple SS",
      "severity": 1
    },
    {
      "sid": 2910944,
      "msg": "CDB APEX: Qilin Ransomware Uses Malicious DLL to Kill Almost",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 3368697,
      "msg": "CDB-SNORT: Securing the Supply Chain: How SentinelOne\u00ae\u2019s AI E"
    },
    {
      "sid": 2926314,
      "msg": "CDB-SNORT: CVE-2026-32173 - Azure SRE Agent Information Discl"
    },
    {
      "sid": 3080415,
      "msg": "CDB-SNORT: CVE-2026-32211 - Azure MCP Server Information Disc"
    },
    {
      "sid": 2635289,
      "msg": "CDB-SNORT: CVE-2026-32213 - Azure AI Foundry Elevation of Pri"
    },
    {
      "sid": 4545545,
      "msg": "CDB-SNORT: CVE-2026-33105 - Microsoft Azure Kubernetes Servic"
    },
    {
      "sid": 8025620,
      "msg": "CDB-SNORT: CVE-2026-33107 - Azure Databricks Elevation of Pri"
    },
    {
      "sid": 6372693,
      "msg": "CDB-SNORT: Adobe Breach \u2013 Threat Actor Allegedly Claims Leak "
    },
    {
      "sid": 6238517,
      "msg": "CDB-SNORT: Software supply chain hacks trigger wave of intrus"
    },
    {
      "sid": 4793367,
      "msg": "CDB-SNORT: Latin America and the Caribbean Cybercrime Landsca"
    },
    {
      "sid": 3164555,
      "msg": "CDB-SNORT: Wordfence Intelligence Weekly WordPress Vulnerabil"
    },
    {
      "sid": 9488294,
      "msg": "CDB-SNORT: Attempts to Exploit Exposed \"Vite\" Installs (CVE-2"
    },
    {
      "sid": 4388457,
      "msg": "CDB-SNORT: New Whitepaper: Stealthy BPFDoor Variants are a Ne"
    },
    {
      "sid": 7192890,
      "msg": "CDB-SNORT: vSphere and BRICKSTORM Malware: A Defender's Guide"
    },
    {
      "sid": 1327693,
      "msg": "CDB-SNORT: ZDI-26-251: Foxit PDF Reader Update Service Uncont"
    },
    {
      "sid": 8918595,
      "msg": "CDB-SNORT: ZDI-26-252: Mozilla Firefox IonMonkey Switch State"
    },
    {
      "sid": 7473157,
      "msg": "CDB-SNORT: ZDI-26-253: Microsoft Visual Studio Code mcp.json "
    },
    {
      "sid": 2882531,
      "msg": "CDB-SNORT: CVE-2026-5368 - projectworlds Car Rental Project P"
    },
    {
      "sid": 3753344,
      "msg": "CDB-SNORT: Hitachi Energy Ellipse"
    },
    {
      "sid": 6748098,
      "msg": "CDB-SNORT: Yokogawa CENTUM VP"
    },
    {
      "sid": 8430807,
      "msg": "CDB-SNORT: Siemens SICAM 8 Products"
    },
    {
      "sid": 6325449,
      "msg": "CDB-SNORT: Threat actor UAC-0255 impersonate CERT-UA to sprea"
    },
    {
      "sid": 3996572,
      "msg": "CDB-SNORT: Cisco fixed critical and high-severity flaws"
    },
    {
      "sid": 7796147,
      "msg": "CDB-SNORT: Hasbro hit by cyberattack, investigates possible d"
    },
    {
      "sid": 1250065,
      "msg": "CDB-SNORT: OpenSSH 10.3 Fixes Shell Injection and Multiple SS"
    },
    {
      "sid": 2910945,
      "msg": "CDB-SNORT: Qilin Ransomware Uses Malicious DLL to Kill Almost"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: Securing the Supply Chain: How SentinelO",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-32173 - Azure SRE Agent Informa",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-32211 - Azure MCP Server Inform",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-32213 - Azure AI Foundry Elevat",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-33105 - Microsoft Azure Kuberne",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-33107 - Azure Databricks Elevat",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Adobe Breach \u2013 Threat Actor Allegedly Cl",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Software supply chain hacks trigger wave",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Latin America and the Caribbean Cybercri",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Wordfence Intelligence Weekly WordPress ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Attempts to Exploit Exposed \"Vite\" Insta",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: New Whitepaper: Stealthy BPFDoor Variant",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566.002\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: vSphere and BRICKSTORM Malware: A Defend",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-251: Foxit PDF Reader Update Serv",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-252: Mozilla Firefox IonMonkey Sw",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ZDI-26-253: Microsoft Visual Studio Code",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5368 - projectworlds Car Rental",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hitachi Energy Ellipse",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Yokogawa CENTUM VP",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Siemens SICAM 8 Products",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Threat actor UAC-0255 impersonate CERT-U",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1583.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Cisco fixed critical and high-severity f",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hasbro hit by cyberattack, investigates ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: OpenSSH 10.3 Fixes Shell Injection and M",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Qilin Ransomware Uses Malicious DLL to K",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1593\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 107,
    "sigma": 25,
    "yara": 7,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-04-03T03:39:59.650449+00:00"
}