{
  "detection_pack_id": "detpack--9fcd7bff0eb3",
  "sigma_rules": [
    {
      "id": "sigma--bbc081901632",
      "title": "CDB-APEX: CVE-2026-29182 - Parse Server: Cloud Hooks and Cloud Jobs by",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1041"
      ]
    },
    {
      "id": "sigma--8c32a80c5752",
      "title": "CDB-APEX: The long-awaited Trump cyber strategy has arrived",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--d14815754b38",
      "title": "CDB-APEX: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 Building a ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--e209d66c0e3e",
      "title": "CDB-APEX: Iran-linked hackers target IP cameras across Israel and Gulf",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1078.001",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--120f4c2de0ce",
      "title": "CDB-APEX: \u2018Starkiller\u2019 Phishing Service Proxies Real Login Pages, MFA",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1204.001"
      ]
    },
    {
      "id": "sigma--70166ab63271",
      "title": "CDB-APEX: Reading White House President Trump\u2019s Cyber Strategy for Ame",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1204.001"
      ]
    },
    {
      "id": "sigma--7f44f188a224",
      "title": "CDB-APEX: CVE-2026-30863 - Parse Server: JWT audience validation bypas",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--3b24d370cd9d",
      "title": "CDB-APEX: FBI probing intrusion into a system managing sensitive surve",
      "level": "high",
      "tags": [
        "attack.t1190",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--5d23fd8832e6",
      "title": "CDB-APEX: CVE-2026-3714 - OpenCart Incomplete Fix CVE-2024-36694 templ",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--b999d42c217b",
      "title": "CDB-APEX: Security Affairs newsletter Round 566 by Pierluigi Paganini ",
      "level": "critical",
      "tags": [
        "attack.t1593",
        "attack.t1566",
        "attack.t1566.002"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_29182___Parse_Server_",
      "cves": [
        "CVE-2026-29182"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_30863___Parse_Server_",
      "cves": [
        "CVE-2026-30863"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_3714___OpenCart_Incom",
      "cves": [
        "CVE-2026-3714",
        "CVE-2024-36694"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 8459268,
      "msg": "CDB APEX: CVE-2026-29182 - Parse Server: Cloud Hooks and Clo",
      "severity": 2
    },
    {
      "sid": 6757772,
      "msg": "CDB APEX: The long-awaited Trump cyber strategy has arrived",
      "severity": 1
    },
    {
      "sid": 1216149,
      "msg": "CDB APEX: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 B",
      "severity": 1
    },
    {
      "sid": 6742825,
      "msg": "CDB APEX: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote",
      "severity": 2
    },
    {
      "sid": 9182858,
      "msg": "CDB APEX: Iran-linked hackers target IP cameras across Israe",
      "severity": 1
    },
    {
      "sid": 6788461,
      "msg": "CDB APEX: \u2018Starkiller\u2019 Phishing Service Proxies Real Login P",
      "severity": 1
    },
    {
      "sid": 4115284,
      "msg": "CDB APEX: Reading White House President Trump\u2019s Cyber Strate",
      "severity": 1
    },
    {
      "sid": 2618056,
      "msg": "CDB APEX: CVE-2026-30863 - Parse Server: JWT audience valida",
      "severity": 2
    },
    {
      "sid": 7764590,
      "msg": "CDB APEX: FBI probing intrusion into a system managing sensi",
      "severity": 2
    },
    {
      "sid": 2143736,
      "msg": "CDB APEX: CVE-2026-3714 - OpenCart Incomplete Fix CVE-2024-3",
      "severity": 2
    },
    {
      "sid": 6257628,
      "msg": "CDB APEX: Security Affairs newsletter Round 566 by Pierluigi",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 8459269,
      "msg": "CDB-SNORT: CVE-2026-29182 - Parse Server: Cloud Hooks and Clo"
    },
    {
      "sid": 6757773,
      "msg": "CDB-SNORT: The long-awaited Trump cyber strategy has arrived"
    },
    {
      "sid": 1216150,
      "msg": "CDB-SNORT: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 B"
    },
    {
      "sid": 6742826,
      "msg": "CDB-SNORT: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote"
    },
    {
      "sid": 9182859,
      "msg": "CDB-SNORT: Iran-linked hackers target IP cameras across Israe"
    },
    {
      "sid": 6788462,
      "msg": "CDB-SNORT: \u2018Starkiller\u2019 Phishing Service Proxies Real Login P"
    },
    {
      "sid": 4115285,
      "msg": "CDB-SNORT: Reading White House President Trump\u2019s Cyber Strate"
    },
    {
      "sid": 2618057,
      "msg": "CDB-SNORT: CVE-2026-30863 - Parse Server: JWT audience valida"
    },
    {
      "sid": 7764591,
      "msg": "CDB-SNORT: FBI probing intrusion into a system managing sensi"
    },
    {
      "sid": 2143737,
      "msg": "CDB-SNORT: CVE-2026-3714 - OpenCart Incomplete Fix CVE-2024-3"
    },
    {
      "sid": 6257629,
      "msg": "CDB-SNORT: Security Affairs newsletter Round 566 by Pierluigi"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: CVE-2026-29182 - Parse Server: Cloud Hoo",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: The long-awaited Trump cyber strategy ha",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Official Launch: CYBERDUDEBIVASH\u00ae CyberT",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Iran-linked hackers target IP cameras ac",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: \u2018Starkiller\u2019 Phishing Service Proxies Re",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Reading White House President Trump\u2019s Cy",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-30863 - Parse Server: JWT audie",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: FBI probing intrusion into a system mana",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-3714 - OpenCart Incomplete Fix ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Security Affairs newsletter Round 566 by",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1593\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 45,
    "sigma": 10,
    "yara": 3,
    "suricata": 11,
    "snort": 11,
    "edr": 10
  },
  "generated_at": "2026-03-08T13:29:50.458590+00:00"
}