{
  "detection_pack_id": "detpack--7a93c12e6922",
  "sigma_rules": [
    {
      "id": "sigma--a3daed36c97f",
      "title": "CDB-APEX: Initial Access Brokers have Shifted to High-Value Targets an",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--bd27a4749e4e",
      "title": "CDB-APEX: Operation TrueChaos: 0-Day Exploitation Against Southeast As",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--d416e69d4f40",
      "title": "CDB-APEX: CVE-2026-34509 - OpenClaw < 2026.3.8 - Sender Allowlist Bypa",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--e1b005336d3e",
      "title": "CDB-APEX: CVE-2026-4267 - Query Monitor <= 3.20.3 - Reflected Cross-Si",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--c36300f44fac",
      "title": "CDB-APEX: CVE-2026-5198 - code-projects Student Membership System Admi",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--2d4719e40e39",
      "title": "CDB-APEX: CISA tells federal agencies to patch Citrix NetScaler bug by",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1486"
      ]
    },
    {
      "id": "sigma--d58850964344",
      "title": "CDB-APEX: Hackers Deploy Telegram-Based ResokerRAT With Screenshot and",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1059.001",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--67afd101b1c3",
      "title": "CDB-APEX: Hackers Weaponize Legitimate Windows Tools to Disable Antivi",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--4d0c17109479",
      "title": "CDB-APEX: Axios npm packages backdoored in supply chain attack",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--c03c8d2f66ff",
      "title": "CDB-APEX: Release Notes: Cross-Platform\u00a0Threat Analysis with macOS, SS",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--1acb73ffbe0f",
      "title": "CDB-APEX: Application Control Bypass for Data Exfiltration, (Tue, Mar ",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1071.004"
      ]
    },
    {
      "id": "sigma--cb7105079342",
      "title": "CDB-APEX: CVE-2026-5195 - code-projects Student Membership System User",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--ca0a0f1ca8e9",
      "title": "CDB-APEX: CVE-2026-5201 - Gdk-pixbuf: gdk-pixbuf: denial of service vi",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1499"
      ]
    },
    {
      "id": "sigma--c3b7821d3863",
      "title": "CDB-APEX: CareCloud Data Breach \u2013 Hackers Accessed IT Infrastructure a",
      "level": "high",
      "tags": [
        "attack.t1078",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--c573cda03544",
      "title": "CDB-APEX: ChatGPT Vulnerability Let Attackers Silently Exfiltrate User",
      "level": "high",
      "tags": [
        "attack.t1190",
        "attack.t1203",
        "attack.t1204.001"
      ]
    },
    {
      "id": "sigma--0cd90870d78d",
      "title": "CDB-APEX: EvilTokens Emerges as New Phishing-as-a-Service Platform for",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1566.002"
      ]
    },
    {
      "id": "sigma--97fe222fbf72",
      "title": "CDB-APEX: WordPress Plugin Vulnerability Exposes Sensitive Data From 8",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--a8fa1146bf76",
      "title": "CDB-APEX: GhostSocks Turns Victim Systems Into Residential Proxies for",
      "level": "critical",
      "tags": [
        "attack.t1593",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--6174f0f40196",
      "title": "CDB-APEX: CVE-2026-5179 - SourceCodester Simple Doctors Appointment Sy",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--e6365d073281",
      "title": "CDB-APEX: CVE-2026-5180 - SourceCodester Simple Doctors Appointment Sy",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--4966a5d18d60",
      "title": "CDB-APEX: CVE-2026-34070 - LangChain Core has Path Traversal vulnerabi",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--47dd34da6359",
      "title": "CDB-APEX: CVE-2026-3300 - Everest Forms Pro <= 1.9.12 - Unauthenticate",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1176"
      ]
    },
    {
      "id": "sigma--a79f3d5675c2",
      "title": "CDB-APEX: CVE-2026-4020 - Gravity SMTP <= 2.1.4 - Unauthenticated Sens",
      "level": "high",
      "tags": [
        "attack.t1190",
        "attack.t1059",
        "attack.t1213"
      ]
    },
    {
      "id": "sigma--c253fd9c2216",
      "title": "CDB-APEX: CVE-2026-5176 - Totolink A3300R cstecgi.cgi setSyslogCfg com",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--04ab0b5f12f9",
      "title": "CDB-APEX: Axios NPM Packages Compromised to Inject Malicious Codes in ",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1059"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_34509___OpenClaw___20",
      "cves": [
        "CVE-2026-34509"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_4267___Query_Monitor_",
      "cves": [
        "CVE-2026-4267"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5198___code_projects_",
      "cves": [
        "CVE-2026-5198"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5195___code_projects_",
      "cves": [
        "CVE-2026-5195"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5201___Gdk_pixbuf__gd",
      "cves": [
        "CVE-2026-5201"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5179___SourceCodester",
      "cves": [
        "CVE-2026-5179"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5180___SourceCodester",
      "cves": [
        "CVE-2026-5180"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_34070___LangChain_Cor",
      "cves": [
        "CVE-2026-34070"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_3300___Everest_Forms_",
      "cves": [
        "CVE-2026-3300"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_4020___Gravity_SMTP__",
      "cves": [
        "CVE-2026-4020"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5176___Totolink_A3300",
      "cves": [
        "CVE-2026-5176"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 6715450,
      "msg": "CDB APEX: Initial Access Brokers have Shifted to High-Value ",
      "severity": 1
    },
    {
      "sid": 2770257,
      "msg": "CDB APEX: Operation TrueChaos: 0-Day Exploitation Against So",
      "severity": 1
    },
    {
      "sid": 7218264,
      "msg": "CDB APEX: CVE-2026-34509 - OpenClaw < 2026.3.8 - Sender Allo",
      "severity": 2
    },
    {
      "sid": 9794686,
      "msg": "CDB APEX: CVE-2026-4267 - Query Monitor <= 3.20.3 - Reflecte",
      "severity": 2
    },
    {
      "sid": 8918431,
      "msg": "CDB APEX: CVE-2026-5198 - code-projects Student Membership S",
      "severity": 2
    },
    {
      "sid": 6951498,
      "msg": "CDB APEX: CISA tells federal agencies to patch Citrix NetSca",
      "severity": 1
    },
    {
      "sid": 1523172,
      "msg": "CDB APEX: Hackers Deploy Telegram-Based ResokerRAT With Scre",
      "severity": 1
    },
    {
      "sid": 1581529,
      "msg": "CDB APEX: Hackers Weaponize Legitimate Windows Tools to Disa",
      "severity": 2
    },
    {
      "sid": 2540065,
      "msg": "CDB APEX: Axios npm packages backdoored in supply chain atta",
      "severity": 1
    },
    {
      "sid": 3013529,
      "msg": "CDB APEX: Release Notes: Cross-Platform\u00a0Threat Analysis with",
      "severity": 1
    },
    {
      "sid": 6511646,
      "msg": "CDB APEX: Application Control Bypass for Data Exfiltration, ",
      "severity": 1
    },
    {
      "sid": 2910613,
      "msg": "CDB APEX: CVE-2026-5195 - code-projects Student Membership S",
      "severity": 2
    },
    {
      "sid": 6398802,
      "msg": "CDB APEX: CVE-2026-5201 - Gdk-pixbuf: gdk-pixbuf: denial of ",
      "severity": 2
    },
    {
      "sid": 8607935,
      "msg": "CDB APEX: CareCloud Data Breach \u2013 Hackers Accessed IT Infras",
      "severity": 2
    },
    {
      "sid": 1845625,
      "msg": "CDB APEX: ChatGPT Vulnerability Let Attackers Silently Exfil",
      "severity": 2
    },
    {
      "sid": 7428483,
      "msg": "CDB APEX: EvilTokens Emerges as New Phishing-as-a-Service Pl",
      "severity": 1
    },
    {
      "sid": 3260743,
      "msg": "CDB APEX: WordPress Plugin Vulnerability Exposes Sensitive D",
      "severity": 2
    },
    {
      "sid": 8039548,
      "msg": "CDB APEX: GhostSocks Turns Victim Systems Into Residential P",
      "severity": 1
    },
    {
      "sid": 3767903,
      "msg": "CDB APEX: CVE-2026-5179 - SourceCodester Simple Doctors Appo",
      "severity": 2
    },
    {
      "sid": 9377574,
      "msg": "CDB APEX: CVE-2026-5180 - SourceCodester Simple Doctors Appo",
      "severity": 2
    },
    {
      "sid": 9663915,
      "msg": "CDB APEX: CVE-2026-34070 - LangChain Core has Path Traversal",
      "severity": 2
    },
    {
      "sid": 3513035,
      "msg": "CDB APEX: CVE-2026-3300 - Everest Forms Pro <= 1.9.12 - Unau",
      "severity": 1
    },
    {
      "sid": 1243184,
      "msg": "CDB APEX: CVE-2026-4020 - Gravity SMTP <= 2.1.4 - Unauthenti",
      "severity": 2
    },
    {
      "sid": 2806741,
      "msg": "CDB APEX: CVE-2026-5176 - Totolink A3300R cstecgi.cgi setSys",
      "severity": 2
    },
    {
      "sid": 3378000,
      "msg": "CDB APEX: Axios NPM Packages Compromised to Inject Malicious",
      "severity": 2
    }
  ],
  "snort_rules": [
    {
      "sid": 6715451,
      "msg": "CDB-SNORT: Initial Access Brokers have Shifted to High-Value "
    },
    {
      "sid": 2770258,
      "msg": "CDB-SNORT: Operation TrueChaos: 0-Day Exploitation Against So"
    },
    {
      "sid": 7218265,
      "msg": "CDB-SNORT: CVE-2026-34509 - OpenClaw < 2026.3.8 - Sender Allo"
    },
    {
      "sid": 9794687,
      "msg": "CDB-SNORT: CVE-2026-4267 - Query Monitor <= 3.20.3 - Reflecte"
    },
    {
      "sid": 8918432,
      "msg": "CDB-SNORT: CVE-2026-5198 - code-projects Student Membership S"
    },
    {
      "sid": 6951499,
      "msg": "CDB-SNORT: CISA tells federal agencies to patch Citrix NetSca"
    },
    {
      "sid": 1523173,
      "msg": "CDB-SNORT: Hackers Deploy Telegram-Based ResokerRAT With Scre"
    },
    {
      "sid": 1581530,
      "msg": "CDB-SNORT: Hackers Weaponize Legitimate Windows Tools to Disa"
    },
    {
      "sid": 2540066,
      "msg": "CDB-SNORT: Axios npm packages backdoored in supply chain atta"
    },
    {
      "sid": 3013530,
      "msg": "CDB-SNORT: Release Notes: Cross-Platform\u00a0Threat Analysis with"
    },
    {
      "sid": 6511647,
      "msg": "CDB-SNORT: Application Control Bypass for Data Exfiltration, "
    },
    {
      "sid": 2910614,
      "msg": "CDB-SNORT: CVE-2026-5195 - code-projects Student Membership S"
    },
    {
      "sid": 6398803,
      "msg": "CDB-SNORT: CVE-2026-5201 - Gdk-pixbuf: gdk-pixbuf: denial of "
    },
    {
      "sid": 8607936,
      "msg": "CDB-SNORT: CareCloud Data Breach \u2013 Hackers Accessed IT Infras"
    },
    {
      "sid": 1845626,
      "msg": "CDB-SNORT: ChatGPT Vulnerability Let Attackers Silently Exfil"
    },
    {
      "sid": 7428484,
      "msg": "CDB-SNORT: EvilTokens Emerges as New Phishing-as-a-Service Pl"
    },
    {
      "sid": 3260744,
      "msg": "CDB-SNORT: WordPress Plugin Vulnerability Exposes Sensitive D"
    },
    {
      "sid": 8039549,
      "msg": "CDB-SNORT: GhostSocks Turns Victim Systems Into Residential P"
    },
    {
      "sid": 3767904,
      "msg": "CDB-SNORT: CVE-2026-5179 - SourceCodester Simple Doctors Appo"
    },
    {
      "sid": 9377575,
      "msg": "CDB-SNORT: CVE-2026-5180 - SourceCodester Simple Doctors Appo"
    },
    {
      "sid": 9663916,
      "msg": "CDB-SNORT: CVE-2026-34070 - LangChain Core has Path Traversal"
    },
    {
      "sid": 3513036,
      "msg": "CDB-SNORT: CVE-2026-3300 - Everest Forms Pro <= 1.9.12 - Unau"
    },
    {
      "sid": 1243185,
      "msg": "CDB-SNORT: CVE-2026-4020 - Gravity SMTP <= 2.1.4 - Unauthenti"
    },
    {
      "sid": 2806742,
      "msg": "CDB-SNORT: CVE-2026-5176 - Totolink A3300R cstecgi.cgi setSys"
    },
    {
      "sid": 3378001,
      "msg": "CDB-SNORT: Axios NPM Packages Compromised to Inject Malicious"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: Initial Access Brokers have Shifted to H",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Operation TrueChaos: 0-Day Exploitation ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-34509 - OpenClaw < 2026.3.8 - S",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4267 - Query Monitor <= 3.20.3 ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5198 - code-projects Student Me",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA tells federal agencies to patch Cit",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Deploy Telegram-Based ResokerRAT",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Weaponize Legitimate Windows Too",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Axios npm packages backdoored in supply ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Release Notes: Cross-Platform\u00a0Threat Ana",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Application Control Bypass for Data Exfi",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5195 - code-projects Student Me",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5201 - Gdk-pixbuf: gdk-pixbuf: ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CareCloud Data Breach \u2013 Hackers Accessed",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: ChatGPT Vulnerability Let Attackers Sile",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: EvilTokens Emerges as New Phishing-as-a-",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: WordPress Plugin Vulnerability Exposes S",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: GhostSocks Turns Victim Systems Into Res",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1593\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5179 - SourceCodester Simple Do",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5180 - SourceCodester Simple Do",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-34070 - LangChain Core has Path",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-3300 - Everest Forms Pro <= 1.9",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4020 - Gravity SMTP <= 2.1.4 - ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5176 - Totolink A3300R cstecgi.",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Axios NPM Packages Compromised to Inject",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 111,
    "sigma": 25,
    "yara": 11,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-03-31T14:19:39.136178+00:00"
}