{
  "detection_pack_id": "detpack--4ce6cee04c5e",
  "sigma_rules": [
    {
      "id": "sigma--5680bd52520f",
      "title": "CDB-APEX: Iran-linked MuddyWater deploys Dindoor malware against U.S. ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--e15d10ee2af2",
      "title": "CDB-APEX: CVE-2026-29790 - dbt-common: commonprefix() doesn't protect ",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--d8ce0dcdd57e",
      "title": "CDB-APEX: CVE-2026-30229 - Parse Server: Endpoint `/loginAs` allows `r",
      "level": "high",
      "tags": [
        "attack.t1059",
        "attack.t1036",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--bbc081901632",
      "title": "CDB-APEX: CVE-2026-29182 - Parse Server: Cloud Hooks and Cloud Jobs by",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1041"
      ]
    },
    {
      "id": "sigma--8c32a80c5752",
      "title": "CDB-APEX: The long-awaited Trump cyber strategy has arrived",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--d14815754b38",
      "title": "CDB-APEX: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 Building a ",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1190",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--e209d66c0e3e",
      "title": "CDB-APEX: Iran-linked hackers target IP cameras across Israel and Gulf",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1078.001",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--120f4c2de0ce",
      "title": "CDB-APEX: \u2018Starkiller\u2019 Phishing Service Proxies Real Login Pages, MFA",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1204.001"
      ]
    },
    {
      "id": "sigma--70166ab63271",
      "title": "CDB-APEX: Reading White House President Trump\u2019s Cyber Strategy for Ame",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1203",
        "attack.t1204.001"
      ]
    },
    {
      "id": "sigma--7f44f188a224",
      "title": "CDB-APEX: CVE-2026-30863 - Parse Server: JWT audience validation bypas",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--3b24d370cd9d",
      "title": "CDB-APEX: FBI probing intrusion into a system managing sensitive surve",
      "level": "high",
      "tags": [
        "attack.t1190",
        "attack.t1078",
        "attack.t1203"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_29790___dbt_common__c",
      "cves": [
        "CVE-2026-29790"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_30229___Parse_Server_",
      "cves": [
        "CVE-2026-30229"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_29182___Parse_Server_",
      "cves": [
        "CVE-2026-29182"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_30863___Parse_Server_",
      "cves": [
        "CVE-2026-30863"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 7587853,
      "msg": "CDB APEX: Iran-linked MuddyWater deploys Dindoor malware aga",
      "severity": 1
    },
    {
      "sid": 3424190,
      "msg": "CDB APEX: CVE-2026-29790 - dbt-common: commonprefix() doesn'",
      "severity": 2
    },
    {
      "sid": 4194488,
      "msg": "CDB APEX: CVE-2026-30229 - Parse Server: Endpoint `/loginAs`",
      "severity": 2
    },
    {
      "sid": 1669700,
      "msg": "CDB APEX: CVE-2026-29182 - Parse Server: Cloud Hooks and Clo",
      "severity": 2
    },
    {
      "sid": 4628062,
      "msg": "CDB APEX: The long-awaited Trump cyber strategy has arrived",
      "severity": 1
    },
    {
      "sid": 3997590,
      "msg": "CDB APEX: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 B",
      "severity": 1
    },
    {
      "sid": 6408740,
      "msg": "CDB APEX: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote",
      "severity": 2
    },
    {
      "sid": 7786020,
      "msg": "CDB APEX: Iran-linked hackers target IP cameras across Israe",
      "severity": 1
    },
    {
      "sid": 7741625,
      "msg": "CDB APEX: \u2018Starkiller\u2019 Phishing Service Proxies Real Login P",
      "severity": 1
    },
    {
      "sid": 6263877,
      "msg": "CDB APEX: Reading White House President Trump\u2019s Cyber Strate",
      "severity": 1
    },
    {
      "sid": 4622444,
      "msg": "CDB APEX: CVE-2026-30863 - Parse Server: JWT audience valida",
      "severity": 2
    },
    {
      "sid": 5300713,
      "msg": "CDB APEX: FBI probing intrusion into a system managing sensi",
      "severity": 2
    }
  ],
  "snort_rules": [
    {
      "sid": 7587854,
      "msg": "CDB-SNORT: Iran-linked MuddyWater deploys Dindoor malware aga"
    },
    {
      "sid": 3424191,
      "msg": "CDB-SNORT: CVE-2026-29790 - dbt-common: commonprefix() doesn'"
    },
    {
      "sid": 4194489,
      "msg": "CDB-SNORT: CVE-2026-30229 - Parse Server: Endpoint `/loginAs`"
    },
    {
      "sid": 1669701,
      "msg": "CDB-SNORT: CVE-2026-29182 - Parse Server: Cloud Hooks and Clo"
    },
    {
      "sid": 4628063,
      "msg": "CDB-SNORT: The long-awaited Trump cyber strategy has arrived"
    },
    {
      "sid": 3997591,
      "msg": "CDB-SNORT: Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 B"
    },
    {
      "sid": 6408741,
      "msg": "CDB-SNORT: Dark Web Intercept: Telegram_RaaS_Syndicate - Pote"
    },
    {
      "sid": 7786021,
      "msg": "CDB-SNORT: Iran-linked hackers target IP cameras across Israe"
    },
    {
      "sid": 7741626,
      "msg": "CDB-SNORT: \u2018Starkiller\u2019 Phishing Service Proxies Real Login P"
    },
    {
      "sid": 6263878,
      "msg": "CDB-SNORT: Reading White House President Trump\u2019s Cyber Strate"
    },
    {
      "sid": 4622445,
      "msg": "CDB-SNORT: CVE-2026-30863 - Parse Server: JWT audience valida"
    },
    {
      "sid": 5300714,
      "msg": "CDB-SNORT: FBI probing intrusion into a system managing sensi"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: Iran-linked MuddyWater deploys Dindoor m",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-29790 - dbt-common: commonprefi",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-30229 - Parse Server: Endpoint ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-29182 - Parse Server: Cloud Hoo",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: The long-awaited Trump cyber strategy ha",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Official Launch: CYBERDUDEBIVASH\u00ae CyberT",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Iran-linked hackers target IP cameras ac",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: \u2018Starkiller\u2019 Phishing Service Proxies Re",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Reading White House President Trump\u2019s Cy",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-30863 - Parse Server: JWT audie",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: FBI probing intrusion into a system mana",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 50,
    "sigma": 11,
    "yara": 4,
    "suricata": 12,
    "snort": 12,
    "edr": 11
  },
  "generated_at": "2026-03-08T07:21:25.595548+00:00"
}