{
  "detection_pack_id": "detpack--1700612a8cd7",
  "sigma_rules": [
    {
      "id": "sigma--55b720a24b80",
      "title": "CDB-APEX: LinkedIn Hidden Code Secretly Searches Your Browser for Inst",
      "level": "high",
      "tags": [
        "attack.t1595",
        "attack.t1199",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--1a0eb91f57b8",
      "title": "CDB-APEX: Top 10 Best VPN For Chrome in 2026",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1199"
      ]
    },
    {
      "id": "sigma--64b6672c9dc8",
      "title": "CDB-APEX: Top 10 Best User Access Management Tools in 2026",
      "level": "high",
      "tags": [
        "attack.t1199",
        "attack.t1078",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--cec4783922f5",
      "title": "CDB-APEX: That dream job offer from Coca-Cola or Ferrari? It\u2019s a trap ",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--361a1dba3348",
      "title": "CDB-APEX: Metasploit Wrap-Up 04/03/2026",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--2d3ee5f61ae7",
      "title": "CDB-APEX: CVE-2026-34955 - PraisonAI: Sandbox Escape via shell=True an",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--d7034fd570b1",
      "title": "CDB-APEX: CVE-2026-34780 - Electron: Context Isolation bypass via cont",
      "level": "high",
      "tags": [
        "attack.t1059",
        "attack.t1567"
      ]
    },
    {
      "id": "sigma--8b642f205ed4",
      "title": "CDB-APEX: CVE-2026-35616 - Fortinet FortiClientEMS Remote Code Executi",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--25d36ce4a98e",
      "title": "CDB-APEX: CISA gives agencies two weeks to patch video conferencing bu",
      "level": "critical",
      "tags": [
        "attack.t1078",
        "attack.t1203",
        "attack.t1204.002"
      ]
    },
    {
      "id": "sigma--4ed45d87ea5d",
      "title": "CDB-APEX: High-Stakes Security: Protecting the Digital Infrastructure ",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1190",
        "attack.t1195"
      ]
    },
    {
      "id": "sigma--3efe35c2b29f",
      "title": "CDB-APEX: CVE-2026-0545 - Missing Authentication for Critical Function",
      "level": "critical",
      "tags": [
        "attack.t1059",
        "attack.t1555",
        "attack.t1499"
      ]
    },
    {
      "id": "sigma--7f94bbb89e8a",
      "title": "CDB-APEX: CVE-2026-28373 - Stackfield Desktop App Path Traversal Vulne",
      "level": "critical",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--be6d7204a4cb",
      "title": "CDB-APEX: Blast Radius of TeamPCP Attacks Expands Amid Hacker Infighti",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--a469a8730613",
      "title": "CDB-APEX: North Korea\u2013linked hackers drain $285M from Drift in sophist",
      "level": "high",
      "tags": [
        "attack.t1566",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--1644bd02ac3d",
      "title": "CDB-APEX: EU cyber agency attributes major data breach to TeamPCP hack",
      "level": "high",
      "tags": [
        "attack.t1195",
        "attack.t1190",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--8b3ea5291c4c",
      "title": "CDB-APEX: Hackers Abuse Trusted Platforms to Steal Bank Credentials Fr",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--14a87e40b60e",
      "title": "CDB-APEX: Axios Maintainer Confirms The npm Compromise Was via a Targe",
      "level": "high",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--6599b0b3a3cd",
      "title": "CDB-APEX: Kimsuky Deploys Malicious LNK Files to Deliver Python-Based ",
      "level": "high",
      "tags": [
        "attack.t1059.001",
        "attack.t1059",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--6daba68611e0",
      "title": "CDB-APEX: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid Active RCE",
      "level": "critical",
      "tags": [
        "attack.t1190",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--cdb2c305f6c3",
      "title": "CDB-APEX: Claude Code source leak exploited to spread malware",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1555"
      ]
    },
    {
      "id": "sigma--156612cc7eeb",
      "title": "CDB-APEX: Cisco IMC auth bypass vulnerability allows attackers to alte",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1204"
      ]
    },
    {
      "id": "sigma--94f9d8647cca",
      "title": "CDB-APEX: TeamPCP Supply Chain Campaign: Update 006 - CERT-EU Confirms",
      "level": "critical",
      "tags": [
        "attack.t1195",
        "attack.t1078",
        "attack.t1190"
      ]
    },
    {
      "id": "sigma--08c16dc7803f",
      "title": "CDB-APEX: The Good, the Bad and the Ugly in Cybersecurity \u2013 Week 14",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--2e29db4208de",
      "title": "CDB-APEX: CVE-2025-7024 - Local privilege escalation in Windows Server",
      "level": "high",
      "tags": [
        "attack.t1059",
        "attack.t1204",
        "attack.t1068"
      ]
    },
    {
      "id": "sigma--58374a58243e",
      "title": "CDB-APEX: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authenticated (Subs",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_34955___PraisonAI__Sa",
      "cves": [
        "CVE-2026-34955"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_34780___Electron__Con",
      "cves": [
        "CVE-2026-34780"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_35616___Fortinet_Fort",
      "cves": [
        "CVE-2026-35616"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_0545___Missing_Authen",
      "cves": [
        "CVE-2026-0545"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_28373___Stackfield_De",
      "cves": [
        "CVE-2026-28373"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_Cisco_IMC_auth_bypass_vulnerab",
      "cves": [
        "CVE-2026-20093"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2025_7024___Local_privileg",
      "cves": [
        "CVE-2025-7024"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_4350___Perfmatters___",
      "cves": [
        "CVE-2026-4350"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 7198229,
      "msg": "CDB APEX: LinkedIn Hidden Code Secretly Searches Your Browse",
      "severity": 2
    },
    {
      "sid": 8319857,
      "msg": "CDB APEX: Top 10 Best VPN For Chrome in 2026",
      "severity": 1
    },
    {
      "sid": 4070498,
      "msg": "CDB APEX: Top 10 Best User Access Management Tools in 2026",
      "severity": 2
    },
    {
      "sid": 5301908,
      "msg": "CDB APEX: That dream job offer from Coca-Cola or Ferrari? It",
      "severity": 2
    },
    {
      "sid": 4754992,
      "msg": "CDB APEX: Metasploit Wrap-Up 04/03/2026",
      "severity": 1
    },
    {
      "sid": 3125931,
      "msg": "CDB APEX: CVE-2026-34955 - PraisonAI: Sandbox Escape via she",
      "severity": 2
    },
    {
      "sid": 1980528,
      "msg": "CDB APEX: CVE-2026-34780 - Electron: Context Isolation bypas",
      "severity": 2
    },
    {
      "sid": 9152797,
      "msg": "CDB APEX: CVE-2026-35616 - Fortinet FortiClientEMS Remote Co",
      "severity": 1
    },
    {
      "sid": 5863802,
      "msg": "CDB APEX: CISA gives agencies two weeks to patch video confe",
      "severity": 1
    },
    {
      "sid": 5882701,
      "msg": "CDB APEX: High-Stakes Security: Protecting the Digital Infra",
      "severity": 1
    },
    {
      "sid": 1158849,
      "msg": "CDB APEX: CVE-2026-0545 - Missing Authentication for Critica",
      "severity": 1
    },
    {
      "sid": 3876658,
      "msg": "CDB APEX: CVE-2026-28373 - Stackfield Desktop App Path Trave",
      "severity": 1
    },
    {
      "sid": 2960370,
      "msg": "CDB APEX: Blast Radius of TeamPCP Attacks Expands Amid Hacke",
      "severity": 2
    },
    {
      "sid": 7490832,
      "msg": "CDB APEX: North Korea\u2013linked hackers drain $285M from Drift ",
      "severity": 2
    },
    {
      "sid": 3318997,
      "msg": "CDB APEX: EU cyber agency attributes major data breach to Te",
      "severity": 2
    },
    {
      "sid": 2663240,
      "msg": "CDB APEX: Hackers Abuse Trusted Platforms to Steal Bank Cred",
      "severity": 1
    },
    {
      "sid": 2292167,
      "msg": "CDB APEX: Axios Maintainer Confirms The npm Compromise Was v",
      "severity": 2
    },
    {
      "sid": 4194778,
      "msg": "CDB APEX: Kimsuky Deploys Malicious LNK Files to Deliver Pyt",
      "severity": 2
    },
    {
      "sid": 6974497,
      "msg": "CDB APEX: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid ",
      "severity": 1
    },
    {
      "sid": 7992635,
      "msg": "CDB APEX: Claude Code source leak exploited to spread malwar",
      "severity": 2
    },
    {
      "sid": 9572565,
      "msg": "CDB APEX: Cisco IMC auth bypass vulnerability allows attacke",
      "severity": 1
    },
    {
      "sid": 3386746,
      "msg": "CDB APEX: TeamPCP Supply Chain Campaign: Update 006 - CERT-E",
      "severity": 1
    },
    {
      "sid": 6543048,
      "msg": "CDB APEX: The Good, the Bad and the Ugly in Cybersecurity \u2013 ",
      "severity": 1
    },
    {
      "sid": 1246918,
      "msg": "CDB APEX: CVE-2025-7024 - Local privilege escalation in Wind",
      "severity": 2
    },
    {
      "sid": 8902791,
      "msg": "CDB APEX: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authentic",
      "severity": 2
    }
  ],
  "snort_rules": [
    {
      "sid": 7198230,
      "msg": "CDB-SNORT: LinkedIn Hidden Code Secretly Searches Your Browse"
    },
    {
      "sid": 8319858,
      "msg": "CDB-SNORT: Top 10 Best VPN For Chrome in 2026"
    },
    {
      "sid": 4070499,
      "msg": "CDB-SNORT: Top 10 Best User Access Management Tools in 2026"
    },
    {
      "sid": 5301909,
      "msg": "CDB-SNORT: That dream job offer from Coca-Cola or Ferrari? It"
    },
    {
      "sid": 4754993,
      "msg": "CDB-SNORT: Metasploit Wrap-Up 04/03/2026"
    },
    {
      "sid": 3125932,
      "msg": "CDB-SNORT: CVE-2026-34955 - PraisonAI: Sandbox Escape via she"
    },
    {
      "sid": 1980529,
      "msg": "CDB-SNORT: CVE-2026-34780 - Electron: Context Isolation bypas"
    },
    {
      "sid": 9152798,
      "msg": "CDB-SNORT: CVE-2026-35616 - Fortinet FortiClientEMS Remote Co"
    },
    {
      "sid": 5863803,
      "msg": "CDB-SNORT: CISA gives agencies two weeks to patch video confe"
    },
    {
      "sid": 5882702,
      "msg": "CDB-SNORT: High-Stakes Security: Protecting the Digital Infra"
    },
    {
      "sid": 1158850,
      "msg": "CDB-SNORT: CVE-2026-0545 - Missing Authentication for Critica"
    },
    {
      "sid": 3876659,
      "msg": "CDB-SNORT: CVE-2026-28373 - Stackfield Desktop App Path Trave"
    },
    {
      "sid": 2960371,
      "msg": "CDB-SNORT: Blast Radius of TeamPCP Attacks Expands Amid Hacke"
    },
    {
      "sid": 7490833,
      "msg": "CDB-SNORT: North Korea\u2013linked hackers drain $285M from Drift "
    },
    {
      "sid": 3318998,
      "msg": "CDB-SNORT: EU cyber agency attributes major data breach to Te"
    },
    {
      "sid": 2663241,
      "msg": "CDB-SNORT: Hackers Abuse Trusted Platforms to Steal Bank Cred"
    },
    {
      "sid": 2292168,
      "msg": "CDB-SNORT: Axios Maintainer Confirms The npm Compromise Was v"
    },
    {
      "sid": 4194779,
      "msg": "CDB-SNORT: Kimsuky Deploys Malicious LNK Files to Deliver Pyt"
    },
    {
      "sid": 6974498,
      "msg": "CDB-SNORT: 14,000+ F5 BIG-IP APM Devices Exposed Online Amid "
    },
    {
      "sid": 7992636,
      "msg": "CDB-SNORT: Claude Code source leak exploited to spread malwar"
    },
    {
      "sid": 9572566,
      "msg": "CDB-SNORT: Cisco IMC auth bypass vulnerability allows attacke"
    },
    {
      "sid": 3386747,
      "msg": "CDB-SNORT: TeamPCP Supply Chain Campaign: Update 006 - CERT-E"
    },
    {
      "sid": 6543049,
      "msg": "CDB-SNORT: The Good, the Bad and the Ugly in Cybersecurity \u2013 "
    },
    {
      "sid": 1246919,
      "msg": "CDB-SNORT: CVE-2025-7024 - Local privilege escalation in Wind"
    },
    {
      "sid": 8902792,
      "msg": "CDB-SNORT: CVE-2026-4350 - Perfmatters <= 2.5.9.1 - Authentic"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: LinkedIn Hidden Code Secretly Searches Y",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Top 10 Best VPN For Chrome in 2026",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Top 10 Best User Access Management Tools",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1199\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: That dream job offer from Coca-Cola or F",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Metasploit Wrap-Up 04/03/2026",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-34955 - PraisonAI: Sandbox Esca",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-34780 - Electron: Context Isola",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-35616 - Fortinet FortiClientEMS",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA gives agencies two weeks to patch v",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1078\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: High-Stakes Security: Protecting the Dig",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-0545 - Missing Authentication f",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-28373 - Stackfield Desktop App ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Blast Radius of TeamPCP Attacks Expands ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: North Korea\u2013linked hackers drain $285M f",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: EU cyber agency attributes major data br",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Hackers Abuse Trusted Platforms to Steal",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Axios Maintainer Confirms The npm Compro",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Kimsuky Deploys Malicious LNK Files to D",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: 14,000+ F5 BIG-IP APM Devices Exposed On",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Claude Code source leak exploited to spr",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Cisco IMC auth bypass vulnerability allo",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: TeamPCP Supply Chain Campaign: Update 00",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1195\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: The Good, the Bad and the Ugly in Cybers",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2025-7024 - Local privilege escalati",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4350 - Perfmatters <= 2.5.9.1 -",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 108,
    "sigma": 25,
    "yara": 8,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-04-04T07:39:52.237737+00:00"
}