{
  "detection_pack_id": "detpack--471476e4ea58",
  "sigma_rules": [
    {
      "id": "sigma--d01aaafc01e5",
      "title": "CDB-APEX: CVE-2026-5002 - PromtEngineer localGPT LLM Prompt server.py ",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--1eba324eff95",
      "title": "CDB-APEX: CVE-2026-5004 - Wavlink WL-WN579X3-C UPNP firewall.cgi sub_4",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--9f209fd3b46a",
      "title": "CDB-APEX: CVE-2026-5001 - PromtEngineer localGPT server.py do_POST unr",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--94f9d8647cca",
      "title": "CDB-APEX: TeamPCP Supply Chain Campaign: Update 003 - Operational Temp",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--5f3f2652eedf",
      "title": "CDB-APEX: CVE-2026-4998 - Sinaptik AI PandasAI Chat Message code_execu",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--0f5279f97f0b",
      "title": "CDB-APEX: CVE-2026-4999 - z-9527 admin isImg Check upload.js uploadFil",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059",
        "attack.t1071"
      ]
    },
    {
      "id": "sigma--963f27e0368e",
      "title": "CDB-APEX: CVE-2026-5000 - PromtEngineer localGPT API Endpoint server.p",
      "level": "high",
      "tags": [
        "attack.t1190",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--128a0941a2ec",
      "title": "CDB-APEX: CISA Warns of F5 BIG-IP Vulnerability Actively Exploited in ",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1547",
        "attack.t1021"
      ]
    },
    {
      "id": "sigma--0f89420b0948",
      "title": "CDB-APEX: CVE-2018-25224 - PMS 0.42 Stack-Based Buffer Overflow via Co",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--7fab460348bd",
      "title": "CDB-APEX: CVE-2018-25225 - SIPP 3.3 Stack-Based Buffer Overflow via Co",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--d3bb2512bd4d",
      "title": "CDB-APEX: CVE-2026-4996 - Sinaptik AI PandasAI pandasai-lancedb Extens",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--83de3fe37373",
      "title": "CDB-APEX: Attackers are exploiting RCE vulnerability in BIG-IP APM sys",
      "level": "critical",
      "tags": [
        "attack.t1190",
        "attack.t1078",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--3ebff4308145",
      "title": "CDB-APEX: U.S. CISA adds a flaw in F5 BIG-IP AMP to its Known Exploite",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--1a8581e2fdc2",
      "title": "CDB-APEX: Iran-linked group Handala hacked FBI Director Kash Patel\u2019s p",
      "level": "high",
      "tags": [
        "attack.t1583.001",
        "attack.t1566",
        "attack.t1566.002"
      ]
    },
    {
      "id": "sigma--d30c62533e99",
      "title": "CDB-APEX: CISA Adds CVE-2025-53521 to KEV After Active F5 BIG-IP APM E",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1021"
      ]
    },
    {
      "id": "sigma--602b7d607a7a",
      "title": "CDB-APEX: Metasploit Wrap-Up 03/27/2026",
      "level": "critical",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--f1337d8ae545",
      "title": "CDB-APEX: Ransomware Under Pressure: Tactics, Techniques, and Procedur",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1566",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--939389b0e17d",
      "title": "CDB-APEX: Free real estate: GoPix, the banking Trojan living off your ",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1566.002",
        "attack.t1203"
      ]
    },
    {
      "id": "sigma--5f87dce7ef6e",
      "title": "CDB-APEX: CVE-2026-1679 - net: eswifi socket send payload length not b",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--f87971811cf8",
      "title": "CDB-APEX: CVE-2026-4987 - SureForms <= 2.5.2 - Unauthenticated Payment",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--04c5d499857a",
      "title": "CDB-APEX: CVE-2025-12886 - Oxygen <= 6.0.8 - Unauthenticated Server-Si",
      "level": "high",
      "tags": [
        "attack.t1059"
      ]
    },
    {
      "id": "sigma--b9cfb9a0592c",
      "title": "CDB-APEX: CISA and BSI warn orgs of critical PTC Windchill and FlexPLM",
      "level": "critical",
      "tags": [
        "attack.t1566",
        "attack.t1203",
        "attack.t1547"
      ]
    },
    {
      "id": "sigma--6fae518874fe",
      "title": "CDB-APEX: Security leaders say the next two years are going to be \u2018ins",
      "level": "high",
      "tags": [
        "attack.t1203",
        "attack.t1547",
        "attack.t1542"
      ]
    },
    {
      "id": "sigma--82c68a5a7f43",
      "title": "CDB-APEX: CISA Adds Aquasecurity Trivy Scanner Vulnerability to KEV Ca",
      "level": "critical",
      "tags": [
        "attack.t1595",
        "attack.t1195",
        "attack.t1078"
      ]
    },
    {
      "id": "sigma--e9f30dfaf5d6",
      "title": "CDB-APEX: CYBERDUDEBIVASH Sentinel APEX\u2122 \u2014 Building a Real-Time AI Cyb",
      "level": "critical",
      "tags": [
        "attack.t1190",
        "attack.t1203"
      ]
    }
  ],
  "yara_rules": [
    {
      "name": "CDB_CVE_2026_5002___PromtEngineer_",
      "cves": [
        "CVE-2026-5002"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5004___Wavlink_WL_WN5",
      "cves": [
        "CVE-2026-5004"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5001___PromtEngineer_",
      "cves": [
        "CVE-2026-5001"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_4998___Sinaptik_AI_Pa",
      "cves": [
        "CVE-2026-4998"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_4999___z_9527_admin_i",
      "cves": [
        "CVE-2026-4999"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_5000___PromtEngineer_",
      "cves": [
        "CVE-2026-5000"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2018_25224___PMS_0_42_Stac",
      "cves": [
        "CVE-2018-25224"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2018_25225___SIPP_3_3_Stac",
      "cves": [
        "CVE-2018-25225"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_4996___Sinaptik_AI_Pa",
      "cves": [
        "CVE-2026-4996"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_Attackers_are_exploiting_RCE_v",
      "cves": [
        "CVE-2025-53521"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CISA_Adds_CVE_2025_53521_to_KE",
      "cves": [
        "CVE-2025-53521"
      ],
      "severity": "critical"
    },
    {
      "name": "CDB_CVE_2026_1679___net__eswifi_so",
      "cves": [
        "CVE-2026-1679"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2026_4987___SureForms____2",
      "cves": [
        "CVE-2026-4987"
      ],
      "severity": "high"
    },
    {
      "name": "CDB_CVE_2025_12886___Oxygen____6_0",
      "cves": [
        "CVE-2025-12886"
      ],
      "severity": "high"
    }
  ],
  "suricata_rules": [
    {
      "sid": 6166622,
      "msg": "CDB APEX: CVE-2026-5002 - PromtEngineer localGPT LLM Prompt ",
      "severity": 2
    },
    {
      "sid": 6395912,
      "msg": "CDB APEX: CVE-2026-5004 - Wavlink WL-WN579X3-C UPNP firewall",
      "severity": 2
    },
    {
      "sid": 2778081,
      "msg": "CDB APEX: CVE-2026-5001 - PromtEngineer localGPT server.py d",
      "severity": 2
    },
    {
      "sid": 9147921,
      "msg": "CDB APEX: TeamPCP Supply Chain Campaign: Update 003 - Operat",
      "severity": 1
    },
    {
      "sid": 4049163,
      "msg": "CDB APEX: CVE-2026-4998 - Sinaptik AI PandasAI Chat Message ",
      "severity": 2
    },
    {
      "sid": 8943788,
      "msg": "CDB APEX: CVE-2026-4999 - z-9527 admin isImg Check upload.js",
      "severity": 2
    },
    {
      "sid": 4881125,
      "msg": "CDB APEX: CVE-2026-5000 - PromtEngineer localGPT API Endpoin",
      "severity": 2
    },
    {
      "sid": 8318250,
      "msg": "CDB APEX: CISA Warns of F5 BIG-IP Vulnerability Actively Exp",
      "severity": 1
    },
    {
      "sid": 1108204,
      "msg": "CDB APEX: CVE-2018-25224 - PMS 0.42 Stack-Based Buffer Overf",
      "severity": 2
    },
    {
      "sid": 7133883,
      "msg": "CDB APEX: CVE-2018-25225 - SIPP 3.3 Stack-Based Buffer Overf",
      "severity": 2
    },
    {
      "sid": 3104196,
      "msg": "CDB APEX: CVE-2026-4996 - Sinaptik AI PandasAI pandasai-lanc",
      "severity": 2
    },
    {
      "sid": 6550492,
      "msg": "CDB APEX: Attackers are exploiting RCE vulnerability in BIG-",
      "severity": 1
    },
    {
      "sid": 8681752,
      "msg": "CDB APEX: U.S. CISA adds a flaw in F5 BIG-IP AMP to its Know",
      "severity": 1
    },
    {
      "sid": 2849002,
      "msg": "CDB APEX: Iran-linked group Handala hacked FBI Director Kash",
      "severity": 2
    },
    {
      "sid": 7055658,
      "msg": "CDB APEX: CISA Adds CVE-2025-53521 to KEV After Active F5 BI",
      "severity": 1
    },
    {
      "sid": 3694601,
      "msg": "CDB APEX: Metasploit Wrap-Up 03/27/2026",
      "severity": 1
    },
    {
      "sid": 8861382,
      "msg": "CDB APEX: Ransomware Under Pressure: Tactics, Techniques, an",
      "severity": 1
    },
    {
      "sid": 4737928,
      "msg": "CDB APEX: Free real estate: GoPix, the banking Trojan living",
      "severity": 1
    },
    {
      "sid": 6208658,
      "msg": "CDB APEX: CVE-2026-1679 - net: eswifi socket send payload le",
      "severity": 2
    },
    {
      "sid": 7945848,
      "msg": "CDB APEX: CVE-2026-4987 - SureForms <= 2.5.2 - Unauthenticat",
      "severity": 2
    },
    {
      "sid": 2133487,
      "msg": "CDB APEX: CVE-2025-12886 - Oxygen <= 6.0.8 - Unauthenticated",
      "severity": 2
    },
    {
      "sid": 8853582,
      "msg": "CDB APEX: CISA and BSI warn orgs of critical PTC Windchill a",
      "severity": 1
    },
    {
      "sid": 9088782,
      "msg": "CDB APEX: Security leaders say the next two years are going ",
      "severity": 2
    },
    {
      "sid": 4251662,
      "msg": "CDB APEX: CISA Adds Aquasecurity Trivy Scanner Vulnerability",
      "severity": 1
    },
    {
      "sid": 4147054,
      "msg": "CDB APEX: CYBERDUDEBIVASH Sentinel APEX\u2122 \u2014 Building a Real-T",
      "severity": 1
    }
  ],
  "snort_rules": [
    {
      "sid": 6166623,
      "msg": "CDB-SNORT: CVE-2026-5002 - PromtEngineer localGPT LLM Prompt "
    },
    {
      "sid": 6395913,
      "msg": "CDB-SNORT: CVE-2026-5004 - Wavlink WL-WN579X3-C UPNP firewall"
    },
    {
      "sid": 2778082,
      "msg": "CDB-SNORT: CVE-2026-5001 - PromtEngineer localGPT server.py d"
    },
    {
      "sid": 9147922,
      "msg": "CDB-SNORT: TeamPCP Supply Chain Campaign: Update 003 - Operat"
    },
    {
      "sid": 4049164,
      "msg": "CDB-SNORT: CVE-2026-4998 - Sinaptik AI PandasAI Chat Message "
    },
    {
      "sid": 8943789,
      "msg": "CDB-SNORT: CVE-2026-4999 - z-9527 admin isImg Check upload.js"
    },
    {
      "sid": 4881126,
      "msg": "CDB-SNORT: CVE-2026-5000 - PromtEngineer localGPT API Endpoin"
    },
    {
      "sid": 8318251,
      "msg": "CDB-SNORT: CISA Warns of F5 BIG-IP Vulnerability Actively Exp"
    },
    {
      "sid": 1108205,
      "msg": "CDB-SNORT: CVE-2018-25224 - PMS 0.42 Stack-Based Buffer Overf"
    },
    {
      "sid": 7133884,
      "msg": "CDB-SNORT: CVE-2018-25225 - SIPP 3.3 Stack-Based Buffer Overf"
    },
    {
      "sid": 3104197,
      "msg": "CDB-SNORT: CVE-2026-4996 - Sinaptik AI PandasAI pandasai-lanc"
    },
    {
      "sid": 6550493,
      "msg": "CDB-SNORT: Attackers are exploiting RCE vulnerability in BIG-"
    },
    {
      "sid": 8681753,
      "msg": "CDB-SNORT: U.S. CISA adds a flaw in F5 BIG-IP AMP to its Know"
    },
    {
      "sid": 2849003,
      "msg": "CDB-SNORT: Iran-linked group Handala hacked FBI Director Kash"
    },
    {
      "sid": 7055659,
      "msg": "CDB-SNORT: CISA Adds CVE-2025-53521 to KEV After Active F5 BI"
    },
    {
      "sid": 3694602,
      "msg": "CDB-SNORT: Metasploit Wrap-Up 03/27/2026"
    },
    {
      "sid": 8861383,
      "msg": "CDB-SNORT: Ransomware Under Pressure: Tactics, Techniques, an"
    },
    {
      "sid": 4737929,
      "msg": "CDB-SNORT: Free real estate: GoPix, the banking Trojan living"
    },
    {
      "sid": 6208659,
      "msg": "CDB-SNORT: CVE-2026-1679 - net: eswifi socket send payload le"
    },
    {
      "sid": 7945849,
      "msg": "CDB-SNORT: CVE-2026-4987 - SureForms <= 2.5.2 - Unauthenticat"
    },
    {
      "sid": 2133488,
      "msg": "CDB-SNORT: CVE-2025-12886 - Oxygen <= 6.0.8 - Unauthenticated"
    },
    {
      "sid": 8853583,
      "msg": "CDB-SNORT: CISA and BSI warn orgs of critical PTC Windchill a"
    },
    {
      "sid": 9088783,
      "msg": "CDB-SNORT: Security leaders say the next two years are going "
    },
    {
      "sid": 4251663,
      "msg": "CDB-SNORT: CISA Adds Aquasecurity Trivy Scanner Vulnerability"
    },
    {
      "sid": 4147055,
      "msg": "CDB-SNORT: CYBERDUDEBIVASH Sentinel APEX\u2122 \u2014 Building a Real-T"
    }
  ],
  "edr_queries": [
    {
      "query_name": "Hunt: CVE-2026-5002 - PromtEngineer localGPT L",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5004 - Wavlink WL-WN579X3-C UPN",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5001 - PromtEngineer localGPT s",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: TeamPCP Supply Chain Campaign: Update 00",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4998 - Sinaptik AI PandasAI Cha",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4999 - z-9527 admin isImg Check",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-5000 - PromtEngineer localGPT A",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA Warns of F5 BIG-IP Vulnerability Ac",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2018-25224 - PMS 0.42 Stack-Based Bu",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2018-25225 - SIPP 3.3 Stack-Based Bu",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4996 - Sinaptik AI PandasAI pan",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Attackers are exploiting RCE vulnerabili",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: U.S. CISA adds a flaw in F5 BIG-IP AMP t",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Iran-linked group Handala hacked FBI Dir",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1583.001\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA Adds CVE-2025-53521 to KEV After Ac",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Metasploit Wrap-Up 03/27/2026",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Ransomware Under Pressure: Tactics, Tech",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Free real estate: GoPix, the banking Tro",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-1679 - net: eswifi socket send ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2026-4987 - SureForms <= 2.5.2 - Una",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CVE-2025-12886 - Oxygen <= 6.0.8 - Unaut",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1059\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA and BSI warn orgs of critical PTC W",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1566\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: Security leaders say the next two years ",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1203\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CISA Adds Aquasecurity Trivy Scanner Vul",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1595\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    },
    {
      "query_name": "Hunt: CYBERDUDEBIVASH Sentinel APEX\u2122 \u2014 Buildin",
      "kql": "DeviceProcessEvents | where ProcessCommandLine contains \"T1190\" | project Timestamp, DeviceName, ProcessCommandLine",
      "platform": "Microsoft Defender / Sentinel"
    }
  ],
  "stats": {
    "total_rules": 114,
    "sigma": 25,
    "yara": 14,
    "suricata": 25,
    "snort": 25,
    "edr": 25
  },
  "generated_at": "2026-03-29T19:23:14.676167+00:00"
}