# ================================================================
# CyberDudeBivash SENTINEL APEX v20.0 — Sigma Detection Rules
# Threat  : From Access to Execution Securing Identity in the Age of Autonomous Agents
# Scenario: GENERIC
# Generated: 2026-02-25T14:43:06.730850 UTC
# Authority: CyberDudeBivash Pvt. Ltd. | intel.cyberdudebivash.com
# ================================================================

title: 'CDB: From Access to Execution Securing Identity in the Age of Autonomous Agents - Suspicious Script Execution'
id: cdb-133509
status: experimental
description: 'Detects obfuscated PowerShell and script-based execution'
author: 'CyberDudeBivash GOC (Automated)'
date: 2026/02/25
tags: ['attack.execution', 'attack.defense_evasion']
logsource:
  category: process_creation
  product: windows
detection:
  selection_ps:
    CommandLine|contains: ['-EncodedCommand', '-enc ', 'IEX(', 'Invoke-Expression', 'DownloadFile']
  condition: selection_ps
falsepositives: ['Legitimate admin scripts']
level: medium
---
