// CDB APEX v33.0 — Who is the Kimwolf Botmaster “Dort”?
DeviceNetworkEvents
| where RemoteIP in ("99.241.112.24")

// OR

DeviceNetworkEvents
| where RemoteUrl has_any ("gmail.com", "ocdsb.ca", "osint.industries")