# ================================================================
# CyberDudeBivash SENTINEL APEX v20.0 — Sigma Detection Rules
# Threat  : 2nd March  Threat Intelligence Report
# Scenario: GENERIC
# Generated: 2026-03-09T01:23:34.079931 UTC
# Authority: CyberDudeBivash Pvt. Ltd. | intel.cyberdudebivash.com
# ================================================================

title: 'CDB: 2nd March  Threat Intelligence Report - Suspicious Script Execution'
id: cdb-235882
status: experimental
description: 'Detects obfuscated PowerShell and script-based execution'
author: 'CyberDudeBivash GOC (Automated)'
date: 2026/03/09
tags: ['attack.execution', 'attack.defense_evasion']
logsource:
  category: process_creation
  product: windows
detection:
  selection_ps:
    CommandLine|contains: ['-EncodedCommand', '-enc ', 'IEX(', 'Invoke-Expression', 'DownloadFile']
  condition: selection_ps
falsepositives: ['Legitimate admin scripts']
level: medium
---
