title: CDB - CVE-2021-44228 Exploit Attempt Detection
id: 49220419-e5f9-455c-8e27-d449a020f4e1
status: stable
description: |
    Detects exploitation attempts of CVE-2021-44228 (CVE-2021-44228) [CISA KEV - ACTIVELY EXPLOITED]. EPSS: 94.4% CVSS: 10.0/10. Affected: siemens:solid_edge_harness_design, cisco:evolved_programmable_network_manager, cisco:firepower_1150.
author: CYBERDUDEBIVASH(R) SENTINEL APEX v82.0
date: 2026/04/04
modified: 2026/04/04
references:
    - 'https://nvd.nist.gov/vuln/detail/CVE-2021-44228'
    - 'https://intel.cyberdudebivash.com'
tags:
    - 'attack.t1190'
    - 'attack.t1059'
    - 'attack.execution'
    - 'attack.initial_access'
    - 'detection.cdb.lockbit'
    - 'cve.cve.2021.44228'
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'solid_edge_harness_design'
            - 'evolved_programmable_network_manager'
            - 'firepower_1150'
            - 'optical_network_controller'
            - 'capital'
    condition: selection
falsepositives:
    - Legitimate use of affected products
    - Security scanners performing vulnerability assessment
level: critical
