# ================================================================
# CyberDudeBivash SENTINEL APEX v20.0 — Sigma Detection Rules
# Threat  : CVE-2026-3281 - libvips bandrankc vips_bandrank_build heap-based overflow
# Scenario: VULNERABILITY
# Generated: 2026-02-27T02:38:40.386342 UTC
# Authority: CyberDudeBivash Pvt. Ltd. | intel.cyberdudebivash.com
# ================================================================

title: 'CDB: CVE-2026-3281 - libvips bandrankc vips_bandrank_build heap-based overflow - Web Exploit Detection'
id: cdb-255335
status: experimental
description: 'Detects web application exploitation / injection patterns'
author: 'CyberDudeBivash GOC (Automated)'
date: 2026/02/27
tags: ['attack.initial_access.t1190', 'attack.execution.t1059']
logsource:
  category: webserver
  product: any
detection:
  selection_xss:
    c-uri|contains: ['<script>', 'javascript:', 'onerror=', '%3Cscript%3E']
  selection_sqli:
    c-uri|contains: ["' OR '1'='1", 'UNION SELECT', '../../../']
  condition: selection_xss or selection_sqli
falsepositives: ['Security testing / pen testing']
level: high
---
