# ================================================================
# CyberDudeBivash SENTINEL APEX v20.0 — Sigma Detection Rules
# Threat  : Inside AWS Security Agent A multi-agent architecture for automated penetration t
# Scenario: MALWARE
# Generated: 2026-03-03T08:35:02.175009 UTC
# Authority: CyberDudeBivash Pvt. Ltd. | intel.cyberdudebivash.com
# ================================================================

title: 'CDB: Inside AWS Security Agent A multi-agent architecture for automated penetration t - Suspicious Script Execution'
id: cdb-329641
status: experimental
description: 'Detects obfuscated PowerShell and script-based execution'
author: 'CyberDudeBivash GOC (Automated)'
date: 2026/03/03
tags: ['attack.execution', 'attack.defense_evasion']
logsource:
  category: process_creation
  product: windows
detection:
  selection_ps:
    CommandLine|contains: ['-EncodedCommand', '-enc ', 'IEX(', 'Invoke-Expression', 'DownloadFile']
  condition: selection_ps
falsepositives: ['Legitimate admin scripts']
level: medium
---
