# ================================================================
# CyberDudeBivash SENTINEL APEX v20.0 — Sigma Detection Rules
# Threat  : Silver Dragon Targets Organizations in Southeast Asia and Europe
# Scenario: GENERIC
# Generated: 2026-03-03T16:41:20.710599 UTC
# Authority: CyberDudeBivash Pvt. Ltd. | intel.cyberdudebivash.com
# ================================================================

title: 'CDB: Silver Dragon Targets Organizations in Southeast Asia and Europe - Suspicious Script Execution'
id: cdb-518750
status: experimental
description: 'Detects obfuscated PowerShell and script-based execution'
author: 'CyberDudeBivash GOC (Automated)'
date: 2026/03/03
tags: ['attack.execution', 'attack.defense_evasion']
logsource:
  category: process_creation
  product: windows
detection:
  selection_ps:
    CommandLine|contains: ['-EncodedCommand', '-enc ', 'IEX(', 'Invoke-Expression', 'DownloadFile']
  condition: selection_ps
falsepositives: ['Legitimate admin scripts']
level: medium
---
