// ================================================================
// CyberDudeBivash SENTINEL APEX v20.0 — Microsoft Sentinel KQL
// Threat  : The game is over when free comes at too high a price What we know about RenEngin
// Scenario: GENERIC | CVEs: N/A
// Generated: 2026-03-06 01:26:11 UTC
// Import into: Sentinel → Analytics → + Create → Scheduled Query
// ================================================================

// Query 3: Suspicious PowerShell
SecurityEvent | where TimeGenerated > ago(24h)
| where EventID == 4688
| where CommandLine has_any ('-EncodedCommand', '-enc', 'IEX(', 'Invoke-Expression', 'DownloadFile')
| extend ThreatName="The game is over when free comes at too high a price What we know about RenEngin", Severity="CRITICAL"
