title: CDB SENTINEL APEX - Malicious File Hash Detection [bbfdf91c9e87]
id: cdb-hash-bbfdf91c9e87
status: production
description: >
    Auto-generated detection rule for 56 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-21
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '90de84bb542adb54766fec66ee554475b7e1a56a9d8b30e3598230f9ef6d6ac7'
            - '025fc0976c548fb5a880c83ea3eb21a5f23c5d53c4e51e862bb893c11adf712a'
            - '078163d5c16f64caa5a14784323fd51451b8c831c73396b967b4e35e6879937b'
            - '1eece1e1ba4b96e6c784729f0608ad2939cfb67bc4236dfababbe1d09268960c'
            - '22b38dad7da097ea03aa28d0614164cd25fafeb1383dbc15047e34c8050f6f67'
            - '2ed9494e9b7b68415b4eb151c922c82c0191294d0aa443dd2cb5133e6bfe3d5d'
            - '3ab9575225e00a83a4ac2b534da5a710bdcf6eb72884944c437b5fbe5c5c9235'
            - '48d9b2ce4fcd6854a3164ce395d7140014e0b58b77680623f3e4ca22d3a6e7fd'
            - '5dc607c8990841139768884b1b43e1403496d5a458788a1937be139594f01dca'
            - '62c2c24937d67fdeb43f2c9690ab10e8bb90713af46945048db9a94a465ffcb8'
            - '788ba200f776a188c248d6c2029f00b5d34be45d4444f7cb89ffe838c39b8b19'
            - '4f2b7d46148b786fae75ab511dc27b6a530f63669d4fe9908e5f22801dea9202'
            - '0f41fd82cac71e27c36eb90c0bf305d6006b4f3d59e8ba55faeacbe62aadef90'
            - '24af069b8899893cfc7347a4e5b46d717d77994a4b140d58de0be029dba686c9'
            - '4b08a9e221a20b8024cf778d113732b3e12d363250231e78bae13b1f1dc1495b'
            - '85bed283ba95d40d99e79437e6a3161336c94ec0acbc0cd38599d0fc9b2e393c'
            - '871d8f92b008a75607c9f1feb4922b9a02ac7bd2ed61b71ca752a5bed5448bf3'
            - '89616a503ffee8fc70f13c82c4a5e4fa4efafa61410971f4327ed38328af2938'
            - 'a73ce18952b40fd621789e43c56b2af08d1497ce3560b2481fa973d8265ce491'
            - 'a9562ab6bce06e92d4e428088eacc1e990e67ceae6f6940047360261b5599614'
            - 'cc31b3dc8aeed0af9dd24b7e739f183527d55d5b5ecd3d93ba45dd4aaa8ba260'
            - 'dfee6ea9cafc674b93a8460b9e6beea7f0eb0c28e28d1190309347fd1514dbb6'
            - '2b99ade9224add2ce86eb836dcf70040315f6dc95e772ea98f24a30cdf4fdb97'
            - '33dacf9f854f636216e5062ca252df8e5bed652efd78b86512f5b868b11ee70f'
            - '6a85736b64761a8b2aaeadc1c0087e1897d16cc5a9d49c6a6ea1164233bad206'
            - '70bbb38b70fd836d66e8166ec27be9aa8535b3876596fc80c45e3de4ce327980'
            - '9e3890d43366faec26523edaf91712640056ea2481cdefe2f5dfa6b2b642085d'
            - '353ddce78d58aef2083ca0ac271af93659cf0039b0b29d0d169fc015bd3610bc'
            - '4849f76dafbef516df91fecfc23a72afffaf77ade51f805eae5ad552bed88923'
            - 'c7489e3bf546c5f2d958ac833cc7dbca4368dfba03a792849bc99c48a6b2a14f'
            - 'd9b576eb6827f38e33eda037d2cda4261307511303254a8509eeb28048433b2f'
            - 'd85cef60cdb9e8d0f3cb3546de6ab657f9498ac7'
            - '6c0a1da746438d68f6c4ffbf9a10e873f3cf0499'
            - 'c7c37f314ae926822d38ce089fab13e0'
            - 'db78ca341aeff5b26f2d062cc1f7c16a'
            - '808c87015194c51d74356854dfb10d9e'
            - 'd7a68749635604d6d7297e4fa2530eb6'
            - '0565364633b5acdd24a498a6a9ab4eca'
            - '114721fbc23ff9d188535bd736a0d30e'
            - '19733e0dfa804e3676f97eff90f2e467'
            - '31d25ddf2697b9e13ee883fff328b22f'
            - '4126348d783393dd85ede3468e48405d'
            - '417ae7f384c49de8c672aec86d5a2860'
            - '5bdae6cb778d002c806bb7ed130985f3'
            - '686989d97cf0d70346cbde2031207cbf'
            - '79fe383f0963ae741193989c12aefacc'
            - '7b4c61ff418f6fe80cf8adb474278311'
            - '107484d66423cb601f418344cd648f12'
            - '34a0f70ab100c47caaba7a5c85448e3d'
            - '7528bf597fd7764fcb7ec06512e073e0'
            - '8354223cd6198b05904337b5dff7772b'
            - '346272f0582541ae5dd08429bb4dc4ff'
            - 'A6FA4ADFC20E8E6B77E2DD631DC8FF18'
            - 'dcf5a9b27cbeedb769ccc8635d204af9'
            - 'f77c8e40dfc17be5e74d8679d5b35341'
            - '66B553A8B94CE37C16F4EBC863D51FCC'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com