title: CDB SENTINEL APEX - Network Threat Intel [2247c8775ae2]
id: cdb-net-2247c8775ae2
status: production
description: >
    Auto-generated detection rule for 53 malicious IPs and 123 malicious domains
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-03-18
modified: 2026-03-18
tags:
    - attack.command_and_control
    - attack.t1071
    - attack.t1090
logsource:
    category: firewall
    product: any
detection:
    selection:
        DestinationIp:
            - '185.15.10.22'
            - '2.3.4.1'
            - '4.0.2.3'
            - '8.8.8.8'
            - '99.241.112.24'
            - '1.0.0.3'
            - '7.2.0.0'
            - '138.0.0.0'
            - '140.0.0.0'
            - '185.220.101.45'
            - '45.33.32.156'
            - '20.12.5.3'
            - '20.12.6.1'
            - '20.15.4.2'
            - '20.18.2.1'
            - '20.9.8.2'
            - '15.13.07.13'
            - '106.0.0.0'
            - '5.126.48.39'
            - '15.0.2.1'
            - '1.0.7.81'
            - '1.0.7.79'
            - '1.3.6.1'
            - '2.5.29.37'
            - '5.2.3.4'
            - '5.5.7.3'
            - '2.1.0.39'
            - '2.6.0.9'
            - '2.8.0.137'
            - '2.8.0.138'
            - '11.5.14.1'
            - '16.03.50.11'
            - '149.248.11.71'
            - '1.0.0.6'
            - '8.2.6.3'
            - '104.21.51.8'
            - '1.0.2.5'
            - '17.0.2.36'
            - '45.234.176.202'
            - '3.4.8.0'
            - '6.6.10.15'
            - '6.7.8.1'
            - '1.2.0.3'
            - '25.3.2.20'
            - '26.2.5.11'
            - '218.53.203.117'
            - '6.0.3.1'
            - '1.0.0.0'
            - '1.4.5.4'
            - '1.6.4.0'
            - '1.2.0.14'
            - '3.1.1.0'
            - '3.2.0.1'
        DestinationHostname|contains:
            - 'webapps.copeland.com'
            - 'cert-portal.siemens.com'
            - 'www.siemens.com'
            - 'cyberdudebivash.com'
            - 'www.cyberdudebivash.com'
            - '2s3b3rknfqtwwpo.xyz'
            - '6zvjeulzaw5c0mv.xyz'
            - '8fn4957c5g986jp.xyz'
            - 'b38w09ecdejfqsf.xyz'
            - 'polyfill.io'
            - 'malicious-polyfill-update.net'
            - 'cyberdudebivash.gumroad.com'
            - 'contact.yokogawa.com'
            - 'web-material3.yokogawa.com'
            - 'eurail.com'
            - 'www.gevernova.com'
            - 'mail.io'
            - 'www.mcafee.com'
            - 'KrebsOnSecurity.com'
            - 'www.etsi.org'
            - 'cas.docs.cisecurity.org'
            - 'www.idfa.org'
            - 'www.tripwire.com'
            - 'www.cisco.com'
            - 'www.isa.org'
            - 'www.cve.org'
            - 'blog.sekoia.io'
            - 'blog.talosintelligence.com'
            - 'www.ofcom.org'
            - 'attack.mitre.org'
            - 'd3fend.mitre.org'
            - 'cwe.mitre.org'
            - 'www.bleepingcomputer.com'
            - 'ofcom.org'
            - 'doi.org'
            - 'sec.cloudapps.cisco.com'
            - 'www.cisecurity.org'
            - 'www.naruc.org'
            - 'www.darkreading.com'
            - 'cisecurity.org'
            - 'www.securityweek.com'
            - 'download.schneider-electric.com'
            - 'www.se.com'
            - 'aws.amazon.com'
            - 'gmail.com'
            - 'app-download.cn'
            - 'qianxin.com'
            - 'downloadcenter.deltaww.com'
            - 'www.deltaww.com'
            - 'api.wiresguard.com'
            - 'cdncheck.it.com'
            - 'darknet.org'
            - 'evil-login.example-malware.com'
            - 'malware-cdn.evil.net'
            - 'docs.metasploit.com'
            - 'gnome.com'
            - 'askwoody.com'
            - 'intel.cyberdudebivash.com'
            - 'cyberbivash.blogspot.com'
            - 'grok.com'
            - 'accessor.fud2026.com'
            - 'fud2026.com'
            - 'www.sentinelone.com'
            - 'chargemap.com'
            - 'breakdream.com'
            - 'cmailer.pro'
            - 'dreamdie.com'
            - 'group.com'
            - 'mylingocoin.com'
            - 'supportzm.com'
            - 'www.salesforce.com'
            - 'archive.org'
            - 'jd.com'
            - 'osintindustries.com'
            - 'qq.com'
            - 'ecostruxure-building-help.se.com'
            - 'filecenter.deltaww.com'
            - 'notepad-plus-plus.org'
            - 'httpwg.org'
            - 'www.valmet.com'
            - 'certvde.com'
            - 'festo.csaf-tp.certvde.com'
            - 'java.io'
            - 'api.everon.io'
            - 'ns1.exchange4study.com'
            - 'ns2.onedriveconsole.com'
            - 'wise-baton-452610-i5.iam.gserviceaccount.com'
            - 'example-com.site'
            - 'support.sw.siemens.com'
            - 'ltrxdev.atlassian.net'
            - 'upworksell.com'
            - 'krebsonsecurity.com'
            - 'docs.python.org'
            - 'vulnerable-grafana.com'
            - 'vulnerable-ngfw.com'
            - 'www.hitachienergy.com'
            - 'lastpass.com'
            - 'enoceanwiki.atlassian.net'
            - 'simonwillison.net'
            - 'cardforum.cc'
    condition: selection
level: medium
falsepositives:
    - Shared hosting infrastructure
    - CDN/cloud provider IP overlap
references:
    - https://intel.cyberdudebivash.com
    - https://cyberdudebivash.com/threat-intel