title: CDB SENTINEL APEX - Phishing Sender Detection [09067f7a7a4f]
id: cdb-phish-09067f7a7a4f
status: production
description: Detects emails from known malicious senders
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-25
tags:
    - attack.initial_access
    - attack.t1566
logsource:
    category: email
    product: any
detection:
    selection:
        SenderAddress:
            - 'CybersecurityReports@nsa.gov'
            - 'EnergySRMA@hq.doe.gov'
            - 'PSIRT@rockwellautomation.com'
            - 'contact@cisa.dhs.gov'
            - 'bivash@cyberdudebivash.com'
            - 'ncscinfoleg@ncsc.gov.uk'
            - 'chocapikk@leakix.net'
            - 'bcoles@gmail.com'
            - 'theLightCosine@metasploit.com'
    condition: selection
level: high
falsepositives:
    - Spoofed sender addresses
references:
    - https://intel.cyberdudebivash.com