title: CDB SENTINEL APEX - Malicious File Hash Detection [a7ac2fe1d2cc]
id: cdb-hash-a7ac2fe1d2cc
status: production
description: >
    Auto-generated detection rule for 109 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-03-19
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '023e5fb71923cfa2088b9a48ad8566ff7ac92a99630add0629a5edf4679888de'
            - '05b5e4070b3b8a130b12ea96c5526b4615fcae121bb802b1a10c3a7a70f39901'
            - '0dff17e3aa12c4928273c70a2e0a6fff25d3e43c0d1b71056abad34a22b03495'
            - '10bd8f2f8bb9595664bb9160fbc4136f1d796cb5705c551f7ab8b9b1e658085c'
            - '18394fcc096344e0730e49a0098970b1c53c137f679cff5c7ff8902e651cd8a3'
            - '1fb9dedf1de81d387eff4bd5e747f730dd03c440157a66f20fdb5e95f64318c0'
            - '25a9b004cf61fb251c8d4024a8c7383a86cb30f60aa7d59ca53ce9460fcfb7de'
            - '2a9d21ca07244932939c6c58699448f2147992c1f49cd3bc7d067bd92cb54f3a'
            - '3c297829353778857edfeaed3ceeeca1bf8b60534f1979f7d442a0b03c56e541'
            - '42cc02cecd65f22a3658354c5a5efa6a6ec3d716c7fbbcd12df1d1b077d2591b'
            - '4b036cc9930bb42454172f888b8fde1087797fc0c9d31ab546748bd2496bd3e5'
            - 'fba4883bf4f73aa48a957d894051d78e0085ecc3170b1ff50e61ccec6aeee2cd'
            - 'C20BABA26EBB596DE14B403B9F78DDC3C13CE9870EEA332476AC2C1DD582AA07'
            - 'd0c1662ce239e4d288048c0e3324ec52962f6ddda77da0cb7af9c1d9c2f1e2eb'
            - '18a507bf1c533aad8e6f2a2b023fbbcac02a477e8f05b095ee29b52b90d47421'
            - '1845a910dcde8c6e45ad2e0c48439e5ab8bbbeb731f2af11a1b7bbab3bfe0127'
            - '7a43789216ce242524e321d2222fa50820a532e29175e0a2e685459a19e09069'
            - '1a70f4eef11fbecb721b9bab1c9ff43a8c4cd7b2cafef08c033c77070c6fe069'
            - '96babe53d6569ee3b4d8fc09c2a6557e49ebc2ed1b965abda0f7f51378557eb1'
            - '1d04e33009bcd017898b9e1387e40b5c04279c02ebc110f12e4a724ccdb9e4fb'
            - 'f2bbba1ea0f34b262f158ff31e00d39d89bbc471d04e8fca60a034cabe18e4f4'
            - 'a4069aa29628e64ea63b4fb3e29d16dcc368c5add304358a47097eedafbbb565'
            - 'f51b3d054995803d04a754ea3ff7d31823fab654393e8054b227092580be43db'
            - '28c3c50d115d2b8ffc7ba0a8de9572fbe307907aaae3a486aabd8c0266e9426f'
            - '2814b33ce81d2d2e528bb1ed4290d665569f112c9be54e65abca50c41314d462'
            - 'e86bb8361c436be94b0901e5b39db9b6666134f23cce1e5581421c2981405cb1'
            - '70EE22D394E107FBB807D86D187C216AD66B8537EDC67931559A8AEF18F6B5B3'
            - 'a1abc3d11c16ae83b9a7cf62ebe6d144dfc5e19b579a99bad062a9d31cf30bfe'
            - 'da692ea0b7f24e31696f8b4fe8a130dbbe3c7c15cea6bde24cccc1fb0a73ae9e'
            - 'A4F0B68052E8DA9A80B70407A92400C6A5DEF19717E0240AC608612476E1137E'
            - '94bf0aba5f9f32b9c35e8dfc70afd8a35621ed6ef084453dc1b10719ae72f8e2'
            - 'c733d85f445004c9d6918f7c09a1e0d38a8f3b37ad825cd544b865dba36a1ba6'
            - '8eb7e3e8f3ee31d382359a8a232c984bdaa130584cad11683749026e5df1fdc3'
            - '7b9e12e3561285181634ab32015eb653ab5e5cfa157dd16cdd327104b258c332'
            - '078163d5c16f64caa5a14784323fd51451b8c831c73396b967b4e35e6879937b'
            - '64a0ab00d90682b1807c5d7da1a4ae67cde4c5757fc7d995d8f126f0ec8ae983'
            - '8b448f47e36909f3a921b4ff803cf3a61985d8a10f0fe594b405b92ed0fc21f1'
            - 'FAFCD5404A992850FFCFFEE46221F9B2FF716006AECB637B80E5CD5AA112D79C'
            - '44887125aa2df864226421ee694d51e5535d8c6f70e327e9bcb366e43fd892c1'
            - 'a70af759e38219ca3a7f7645f3e103b13c9fb1db6d13b68f3d468b7987540ddf'
            - 'd535bdc9970a3c6f7ebf0b229c695082a73eaeaf35a63cd8a0e7e6e3ceb22795'
            - '88f26f3721076f74996f8518469d98bf9be0eaee5b9eccc72867ebfc25ea4e83'
            - 'e4d6fe517cdf3790dfa51c62457f5acd8cb961ab1f083de37b15fd2fddeb9b8f'
            - 'ff7ad2376ae01e4b3f1e1d7ae630f87b8262b5c11bc5d953e1ac34ffe81401b5'
            - 'dfb5ba578b81f05593c047f2c822eeb03785aecffb1504dcb7f8357e898b5024'
            - '68A49D5A097E3850F3BB572BAF2B75A8E158DADB70BADDC205C2628A9B660E7A'
            - '70bb799557da5ac4f18093decc60c96c13359e30f246683815a512d7f9824c8f'
            - '97931d2e2e449ac3691eb526f6f60e2f828de89074bdac07bd7dbdfd51af9fa0'
            - '73a9a1e38ff40908bcc15df2954246883dadfb991f3c74f6c514b4cffdabde66'
            - '6c8efbcef3af80a574cb2aa2224c145bb2e37c2f3d3f091571708288ceb22d5f'
            - 'd1caa376cb45b6a1eb3a45c5633c5ef75f7466b8601ed72c8022a8b3f6c1f3be'
            - 'a7ffc6f8bf1ed76651c14756a061d662f580ff4de43b49fa82d80a4b80f8434a'
            - '2e5a56beb63f21d9347310412ae6efb29fd3db2d3a3fc0798865a29a3c578d35'
            - '03f00a143b8929585c122d490b6a3895d639c17d92C2223917e3a9ca1b8d30f9'
            - '1a30d6cdb0b98feed62563be8050db55ae0156ed437701d36a7b46aabf086ede'
            - '603848f37ab932dccef98ee27e3c5af9221d3b6ccfe457ccf93cb572495ac325'
            - 'b452C2da7c012eda25a1403b3313444b5eb7C2c3e25eee489f1bd256f8434735'
            - 'b525837273dde06b86b5f93f9aeC2C29665324105b0b66f6df81884754f8080d'
            - 'c3e5d878a30a6c46e22d1dd2089b32086c91f13f8b9c413aa84e1dbaa03b9375'
            - 'c8f7608d4e19f6cb03680941bbd09fe969668bcb09c7ca985048a22e014dffcd'
            - '01fc3bd5a78cd59255a867ffb3dfdd6e0b7713ee90098ea96cc01c640c6495eb'
            - '4eb994b816a1a24cf97bfd7551d00fe14b810859170dbf15180d39e05cd7c0f9'
            - '669917bad46a57e5f2de037f8ec200a44fb579d723af3e2f1be1e8479a267966'
            - 'ce36a5fc44cbd7de947130b67be9e732a7b4086fb1df98a5afd724087c973b47'
            - 'd25024ccea8eac85a9522289cfb709f2ed4e20176dd37855bacc2cd75c995606'
            - 'eb08c840f4c95e2fa5eff05e5f922f86c766f5368a63476f046b2b9dbffc2033'
            - '2388ed7aee0b6b392778e8f9e98871c06499f476c9e7eae6ca0916f827fe65df'
            - '24a11a26a2586f4fba7bfe89df2e21a0809ad85069e442da98c37c4add369a0c'
            - '320a0b5d4900697e125cebb5ff03dee7368f8f087db1c1570b0b62f5a986d759'
            - '45313a6745803a7f57ff35f5397fdf117eaec008a76417e6e2ac8a6280f7d830'
            - '90b760ed1d0dcb3ef0f2b6d6195c9d852bcb65eca293578982a8c4b64f51b035'
            - '92fb4ad6dee9362d0596fda7bbcfe1ba353f812ea801d1870e37bfc6376e624a'
            - 'aa688682d44f0c6b0ed7f30b981a609100107f2d414a3a6e5808671b112d1878'
            - 'dfb37247d12351ef9708cb6631ce2d7017897503657c6b882a711c0da8a9a591'
            - '166e777cb72a7c4e126f8ed97e0a82e7ca9e87df7793fea811daf34e1e7e47a6'
            - '16b9a7358be88632378ba20ba1430786f3b844694b1f876211ecdbecf5cccbc2'
            - '19139a525ee9c22efd6a4842c4cd50ab2c5f9ee391e5531071df0bb4e685f55d'
            - '2f787c1454891b242ab221b8b8b420373c3eb1a0c1fdcb624dd800c50758bbb0'
            - '3128bdb8efaaa04c0ba96337252f4cc2dc795021cbc410f74ace9dde958bac1d'
            - '37b485ed8d150d022c41e5e307b8c54c34ef806625b44d0c940b18be7d5b29ce'
            - '3a2df7a2cfeca5ba315a29cf313268a53a22316c925e6b9760ead8f4df0d1f75'
            - '3e2a0bafbd44e24b17fd7b17c9f2b2a3727349971d42612d55bbc1732082619a'
            - '43f8f94ca5aa0af7bfb0cc1d2f664a46500a161b2d082b48b516d084ef485348'
            - '44e769efed3e4f9f04c52dcd13f15cead251a1a08827a2cb6ea68427522c7fbb'
            - '1acd4592a4eb0c66642cc7b07213e9c9584c6140210779fbc9ebb76a90738d5e'
            - '5d840b741d1061d51d9786f8009c37038c395c129bee608616740141f3b202bb'
            - '077ab28d66abdafad9f5411e18d26e87fe43da1410ee8fe846bd721ab0cb52de'
            - '24857fe82f454719cd18bcbe19b0cfa5387bee1022008b7f5f3a8be9f05e4d14'
            - '2a09bbb3d1ddb729ea7591f197b5955453aa3769c6fb98a5ef60c6e4b7df23a5'
            - '2b7d8a519f44d3105e9fde2770c75efb933994c658855dca7d48c8b4897f81e6'
            - '4aef998e3b3f6ca21c78ed71732c9d2bdcc8a4e0284f51d7462c79d446fbc7be'
            - '64263640a6fdeb2388bca2e9094a17065308cf8dcb0032454c0a71d9b78327eb'
            - '64cf334716f15da1db7981fad6c81a640d94aa1d65391ef879f4b7b6edf6e7f1'
            - '74db1f653da6de134bdc526412a517a30b6856de9c3e5d0c742cb5fe9959ad0d'
            - '94f05495eb1b2ebe592481e01d3900615040aa02bd1807b705a50e45d7c53444'
            - 'a4bd1371fe644d7e6898045cc8e7b5e1562bdfd0e4871d46034e29a22dec6377'
            - '1f3bd755de24e00af2dba61f938637d1cc0fbfd6166dba014e665033ad4445c0'
            - '262a1003a2cd04993b29e687686eba573d6202fea8611c437ecbd6312802677a'
            - '549df969dc5b340b4fc850584a01c767ca8a1bd712f16210f164f85e26c3e58b'
            - '6eb7dbf27a25639c7f11c05fd88ea2a301e0ca93d3c3bdee1eb5917fc60a56ff'
            - 'C9F4C41C195B25675BFA860EB9B45945'
            - 'de778443619f37e2224898a9a800fa78'
            - 'eba9ae70d1b22de67b0eba160a6762d8'
            - 'B7B3647E06F23B9E83D0B1CCE3E71642'
            - 'feda15d3509b210cb05eacc22485a78c'
            - '33e692f435d6cf3c637ba54836c63373'
            - '20b70dac937377b6d0699a44721acd80'
            - '0777EA1D01DAD6DC261A6B602205E2C8'
            - '64e3a3458b3286caaac821c343d4b208'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com