title: CDB SENTINEL APEX - Malicious File Hash Detection [cca5cebd4156]
id: cdb-hash-cca5cebd4156
status: production
description: >
    Auto-generated detection rule for 51 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-01
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - 'cd531ebe1014bfd18185bf21585ca5cdb16fbcb07703ebc47949a1b4e4e36bc3'
            - '421a4ad2615941b177b6ec4ab5e239c14e62af2ab07c6df1741e2a62223223c4'
            - '61aca585687ec21a182342a40de3eaa12d3fc0d92577456cae0df37c3ed28e99'
            - '2b99ade9224add2ce86eb836dcf70040315f6dc95e772ea98f24a30cdf4fdb97'
            - '5afc7476582b29a2b3f967a1999cf14d60a93943'
            - '3a63f5b0cc6275e3ae0edb47726b13a43cdd90ef'
            - 'bf25b8695edbdd5476eeffc102b633d1d3e45f52'
            - '171c6b81f88831641b56b470e6f92862e605013d'
            - '80cd21554124da07d17a4f962c7d770a4f70d0f2'
            - '638b162b26532e32fa8d8047f638537dbdfe197a'
            - '357ca19c7a49a9b9cb2ef639b366f03aba8bea39'
            - 'c630b8ab0f970614d42da8e566e9c0d15a16414c'
            - '667b914301aada695aab0e46d1fb3a7d5e32c8af'
            - 'd24e4ccd6073cc75305e1d3b9c29bc8db7437e7a'
            - 'a9c8e8eb1185751c4c3c68d2a53f3dadee9edc6b'
            - 'ab88f6b9bf5f36f725e8628029f7f6dd0d9913ca'
            - '751b9e5146604dc65049bd0f62dcbdad6212f8a3'
            - '3d255865a957f3740b8724dd914502c0f44d4970'
            - 'c4d23592ae5fb59cfeefc4641e6826f8ac89b9c6'
            - 'b185aa7ff0d864581257008077b4010fca1747bf'
            - '3f678a1e7bd400cd76469d61024097d4920dc6b5'
            - '6f3d0b0e654fc51076badc7fa16c03c461f95620'
            - 'e017b20a4b592a45531a6392f494007f04e661bd'
            - 'a5580cb992f4f6c308c9ffe6442b2e76709db548'
            - '9ceb3812a6458ba7922ca24a7406f8807bc55598'
            - 'ca1a66fffe282767bb08618af9f848e3b68ea47b'
            - '4b8cf2de55f6e8864a77d108e8a94a5b8e4394c6'
            - 'b2516fa466d0d851932da92ee6d0e66946db9efc'
            - 'f189116a9259950c2393f114dbcb94dde0ad864b'
            - '406127ffcb2b91b8c10e20e6c2ca787fbc1dc92d'
            - 'de5a51525a69822290eaee569a1ab447b490746d'
            - 'f7846fc0c323da8325422cab32623491757f1b88'
            - '1ad67864c0c20f167929e64c875f5c28e1aad9fd'
            - 'cf6ac48c972eaaee2af270adc3f36615325deb3e'
            - '2f06696579a1ab0cb5bbbbb6a900414a6b2e3cd1'
            - '5a12f30441d5b0b151f550daa2c5c9e8db61e2e6'
            - '49db424c8001f2f419aad85f434894d8d85c1a09'
            - 'f61896b03cc7031f51106a04566831f4ac2a0bd7'
            - '018494fa3ebb9145112e68b56fe1cb2e9f9a9ed6'
            - '90979d7c3ef7ec30b9f8aa6963a5e38d2f17d166'
            - '99ef3a63c58440d53f8e45ad861b846032fcb036'
            - '5275d008ed33203dba3f98e969ad683a65c416c3'
            - '5937d14a2c5e532fcb3ece0f45bf75e5bf18539e'
            - 'c2c60da05d5c73621d0ce7ea02770bacd79ec8b1'
            - '39ef1decde7e9766207794d396018776b33c6e45'
            - 'fc1a2864d1665bda857089e11fe9247e3c75637a'
            - 'e10a0450c7afcd9462c0b76bcbff0e7428b92bdd'
            - '397abec0d57972881a2e8dc10902d0dce9c27f42'
            - '141335da044e53c3f5b315e0386e01238405b771'
            - 'eb6120a379185d37eb1af17b69bb5614a830ab1f'
            - 'ee07a74d12c0bb3594965b51d0e45b6f'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com