title: CDB SENTINEL APEX - Network Threat Intel [f7f88ca56e3b]
id: cdb-net-f7f88ca56e3b
status: production
description: >
    Auto-generated detection rule for 79 malicious IPs and 169 malicious domains
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-03-31
modified: 2026-03-31
tags:
    - attack.command_and_control
    - attack.t1071
    - attack.t1090
logsource:
    category: firewall
    product: any
detection:
    selection:
        DestinationIp:
            - '185.15.10.22'
            - '1.0.0.3'
            - '2.6.3.009'
            - '16.03.50.11'
            - '28.1.2.1'
            - '4.3.2.8'
            - '6.0.7.1'
            - '7.1.0.30'
            - '8.2.6.3'
            - '99.241.112.24'
            - '1.0.0.0'
            - '1.0.2.5'
            - '5.4.13.12'
            - '12.01.01.37'
            - '2.1.0.39'
            - '185.220.101.45'
            - '45.33.32.156'
            - '20.12.5.3'
            - '20.12.6.1'
            - '20.15.4.2'
            - '20.18.2.1'
            - '20.9.8.2'
            - '2.3.4.1'
            - '104.21.14.89'
            - '142.11.206.73'
            - '2.8.0.137'
            - '2.8.0.138'
            - '1.3.6.1'
            - '2.5.29.37'
            - '5.2.3.4'
            - '5.5.7.3'
            - '11.7.1.6'
            - '16.03.08.16'
            - '15.13.07.13'
            - '8.8.8.8'
            - '8.0.0.2'
            - '7.0.0.63'
            - '6.0.3.1'
            - '3.1.1.0'
            - '7.2.0.0'
            - '149.248.11.71'
            - '45.32.150.251'
            - '1.0.0.6'
            - '104.21.51.8'
            - '188.214.30.5'
            - '64.89.161.198'
            - '17.0.2.36'
            - '45.234.176.202'
            - '7.2.3.1'
            - '8.0.4.1'
            - '8.1.2.1'
            - '1.0.7.81'
            - '138.0.0.0'
            - '140.0.0.0'
            - '207.148.66.14'
            - '1.4.5.4'
            - '2.6.0.9'
            - '1.2.0.3'
            - '25.3.2.20'
            - '26.2.5.11'
            - '106.0.0.0'
            - '5.126.48.39'
            - '218.53.203.117'
            - '3.2.0.1'
            - '1.2.0.14'
            - '15.03.06.47'
            - '6.6.10.15'
            - '6.7.8.1'
            - '1.0.7.79'
            - '15.0.2.1'
            - '12.2.1.4'
            - '14.1.2.1'
            - '83.142.209.203'
            - '5.4.10.12'
            - '193.23.199.88'
            - '1.6.4.0'
            - '11.5.14.1'
            - '3.4.8.0'
            - '4.0.2.3'
        DestinationHostname|contains:
            - 'docs.metasploit.com'
            - 'www.siemens.com'
            - 'www.se.com'
            - 'polyfill.io'
            - 'malicious-polyfill-update.net'
            - 'cyberdudebivash.gumroad.com'
            - '2s3b3rknfqtwwpo.xyz'
            - '6zvjeulzaw5c0mv.xyz'
            - '8fn4957c5g986jp.xyz'
            - 'b38w09ecdejfqsf.xyz'
            - 'www.sentinelone.com'
            - 'cyberdudebivash.com'
            - 'intel.cyberdudebivash.com'
            - 'cyberbivash.blogspot.com'
            - 'krebsonsecurity.com'
            - 'www.valmet.com'
            - 'www.cyberdudebivash.com'
            - 'example-com.site'
            - 'mygardyn.com'
            - 'askwoody.com'
            - 'portal.intruder.io'
            - 'eurail.com'
            - 'gmail.com'
            - 'chargemap.com'
            - 'mail.io'
            - 'static.cdncounter.net'
            - 'aws.amazon.com'
            - 'cve.org'
            - 'download.schneider-electric.com'
            - '4sync.com'
            - 'web.core.windows.net'
            - 'cvefeed.io'
            - 'sentinelone.com'
            - 'downloadcenter.deltaww.com'
            - 'filecenter.deltaww.com'
            - 'darknet.org'
            - 'evil-login.example-malware.com'
            - 'malware-cdn.evil.net'
            - 'www.bluetooth.com'
            - 'www.gevernova.com'
            - 'www.mitsubishielectric.com'
            - 'accessor.fud2026.com'
            - 'fud2026.com'
            - 'avast.com'
            - 'sfrclak.com'
            - 'blog.sekoia.io'
            - 'blog.talosintelligence.com'
            - 'cisecurity.org'
            - 'www.darkreading.com'
            - 'www.mcafee.com'
            - 'www.tripwire.com'
            - 'www.bleepingcomputer.com'
            - 'app-download.cn'
            - 'trueconf.com'
            - 'certvde.com'
            - 'festo.csaf-tp.certvde.com'
            - 'ltrxdev.atlassian.net'
            - 'hackerone.com'
            - 'ecostruxure-building-help.se.com'
            - 'insat.ru'
            - 'qianxin.com'
            - 'bifa668.com'
            - 'www.honeywell.com'
            - 'www.proleit.com'
            - 'KrebsOnSecurity.com'
            - 'www.etsi.org'
            - 'cas.docs.cisecurity.org'
            - 'www.idfa.org'
            - 'www.cisco.com'
            - 'www.isa.org'
            - 'www.cve.org'
            - 'www.ofcom.org'
            - 'attack.mitre.org'
            - 'd3fend.mitre.org'
            - 'cwe.mitre.org'
            - 'ofcom.org'
            - 'doi.org'
            - 'sec.cloudapps.cisco.com'
            - 'www.cisecurity.org'
            - 'www.naruc.org'
            - 'www.securityweek.com'
            - 'simonwillison.net'
            - 'webapps.copeland.com'
            - 'birdeye.com'
            - 'vulnerable-grafana.com'
            - 'vulnerable-ngfw.com'
            - 'api.telegram.org'
            - 'www.deltaww.com'
            - 'seclists.org'
            - 'java.io'
            - 'wago.csaf-tp.certvde.com'
            - 'www.wago.com'
            - 'app.gainsight.com'
            - 'www.rapid7.com'
            - 'sourceforge.net'
            - 'www.automatedlogic.com'
            - 'cardforum.cc'
            - 'ns1.exchange4study.com'
            - 'ns2.onedriveconsole.com'
            - 'wise-baton-452610-i5.iam.gserviceaccount.com'
    condition: selection
level: medium
falsepositives:
    - Shared hosting infrastructure
    - CDN/cloud provider IP overlap
references:
    - https://intel.cyberdudebivash.com
    - https://cyberdudebivash.com/threat-intel