title: CDB SENTINEL APEX - Malicious File Hash Detection [59a620d1eeaa]
id: cdb-hash-59a620d1eeaa
status: production
description: >
    Auto-generated detection rule for 141 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-15
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '025fc0976c548fb5a880c83ea3eb21a5f23c5d53c4e51e862bb893c11adf712a'
            - '078163d5c16f64caa5a14784323fd51451b8c831c73396b967b4e35e6879937b'
            - '1eece1e1ba4b96e6c784729f0608ad2939cfb67bc4236dfababbe1d09268960c'
            - '22b38dad7da097ea03aa28d0614164cd25fafeb1383dbc15047e34c8050f6f67'
            - '2ed9494e9b7b68415b4eb151c922c82c0191294d0aa443dd2cb5133e6bfe3d5d'
            - '3ab9575225e00a83a4ac2b534da5a710bdcf6eb72884944c437b5fbe5c5c9235'
            - '48d9b2ce4fcd6854a3164ce395d7140014e0b58b77680623f3e4ca22d3a6e7fd'
            - '5dc607c8990841139768884b1b43e1403496d5a458788a1937be139594f01dca'
            - '62c2c24937d67fdeb43f2c9690ab10e8bb90713af46945048db9a94a465ffcb8'
            - '788ba200f776a188c248d6c2029f00b5d34be45d4444f7cb89ffe838c39b8b19'
            - '436cfce71290c2fc2f2c362541db68ced6847c66a73b55487e5e5c73b0636c85'
            - '69908f05b436bd97baae56296bf9b9e734486516f9bb9938c2b8752e152315d4'
            - '6eb31006ca318a21eb619d008226f08e287f753aec9042269203290462eaa00d'
            - 'c1f278f88275e07cc03bd390fe1cbeedd55933110c6fd16de4187f4c4aaf42b9'
            - '03f00a143b8929585c122d490b6a3895d639c17d92C2223917e3a9ca1b8d30f9'
            - '1a30d6cdb0b98feed62563be8050db55ae0156ed437701d36a7b46aabf086ede'
            - '603848f37ab932dccef98ee27e3c5af9221d3b6ccfe457ccf93cb572495ac325'
            - 'b452C2da7c012eda25a1403b3313444b5eb7C2c3e25eee489f1bd256f8434735'
            - 'b525837273dde06b86b5f93f9aeC2C29665324105b0b66f6df81884754f8080d'
            - 'c3e5d878a30a6c46e22d1dd2089b32086c91f13f8b9c413aa84e1dbaa03b9375'
            - 'c8f7608d4e19f6cb03680941bbd09fe969668bcb09c7ca985048a22e014dffcd'
            - '1334f0189a8e6dbc48456fa4b482c5726ab7609f7fa652fcc4c1a96f2334436f'
            - '1af419b36a5edefef387409e2b3248c9223f7dc49a4f7b15ea095d371c3a70b2'
            - '24ac3588fb8cfbff63b7fdfcbc7dec1f3c60e54e6f949dd69d68e89e0c89d966'
            - '3c2182cb0bc7528829ef03f1b1745a92bcc47d917eb8870862488f21fdf1a6d6'
            - '04c06be0f65d3ead95f3d3dd26fe150270ac8b58890e35515f9317fc7c7723c9'
            - '090b15fd8912cab340b22e715d44db079ec641db5e2f92916aa1f2bc9236e03e'
            - '26082cd36fdaf76ec0d74b7fbf455418c49fbab64b20892a873c415c3bb60675'
            - '296d28eb7b66aa2cbea7d9c2e7dc1ad6ce6f97d44d34139760c38817aec083e7'
            - '2b2eeb2271c19e2097a0ef0d90b2b615c20f726590bbfee139403db1dced5b0a'
            - '3ba6c174a72e4bf5a10c8aaadab2c4b98702ee2308438e94a5512b69df998d5a'
            - '40b5127c8cf9d6bec4dbeb61ba766a95c7b2d0cafafcb82ede5a3a679a3e3020'
            - '4203271c1a0c24443b7e85cbf066c9928fcc69934772a431d779017fb85c9d73'
            - '48a68d0555f850c36f7d338b1a42ed1a661043cacf2ba2a4b0a347fac3cb3ee6'
            - '64a3ebd3ad3927fc783f6ac020d5a6192e9778fb16b51cceba06e4ee5416adff'
            - '2fa987b9ed6ec6d09c7451abd994249dfaba1c5a7da1c22b8407c461e62f7e49'
            - '691f7258f212fa8908a8bf06bcf9e027d2177276e13e10ff56bd434ff3755cc4'
            - '6e6dab993f99505646051d2772701e3c4740096ff9be63c92713bcb7fcddf9f7'
            - '7f1d71e1e079f3244a69205588d504ed830d4c473747bb1b5c520634cc5a2477'
            - 'c8940de8cb917abe158a826a1d08f1083af517351d01642e6c7f324d0bba1eb8'
            - 'ca390b86793922555c84abc3b34406da2899382c617f9dcf83a74ac09dd18190'
            - 'de200b79ad2bd9db37baeba5e4d183498d450494c71c8929433681e848c3807f'
            - '58e17dd61d4d55fa77c7f2dd28dd51875b0ce900c1e43b368b349e65f27d6fdd'
            - '8ee4ec425bc0d8db050d13bbff98f483fff020050d49f40c5055ca2b9f6b1c4d'
            - '9c745f95a09b37bc0486bf0f92aad4a3d5548a939c086b93d6235d34648e683f'
            - 'a7eadcf81dd6fda0dd6affefaffcb33b1d8f64ddec6e5a1772d028ef2a7da0f2'
            - 'e1fc59c7ece6e9a7fb262fc8529e3c4905503a1ca44630f9724b2ccc518d0c06'
            - 'e512d22d2bd989f35ebaccb63615434870dc0642b0f60e6d4bda0bb89adee27a'
            - '01ac6012d4316b68bb3165ee451f2fcc494e4e37011a73b8cf2680de3364fcf4'
            - '2d1891b6d0c158ad7280f0f30f3c9d913960a793c6abcda249f9c76e13014e45'
            - '59cbdecfc01eba859d12fbeb48f96fe3fe841ac1aafa6bd38eff92f0dcfd4554'
            - 'aef34f14456358db91840c416e55acc7d10185ff2beb362ea24697d7cdad321f'
            - 'b0726bdd53083968870d0b147b72dad422d6d04f27cd52a7891d038ee83aef5b'
            - 'ba9b1f4cc2c7f4aeda7a1280bbc901671f4ec3edaa17f1db676e17651e9bff5f'
            - '19CC41A0A056E503CC2137E19E952814FBDF14F8D83F799AEA9B96ABFF11EFBB'
            - '2F31D00FEEFE181F2D8B69033B382462FF19C35367753E6906ED80F815A7924F'
            - '325daeb781f3416a383343820064c8e98f2e31753cd71d76a886fe0dbb4fe59a'
            - '4D74F8E12FF69318BE5EB383B4E56178817E84E83D3607213160276A7328AB5D'
            - '76e4962b8ccd2e6fd6972d9c3264ccb6738ddb16066588dfcb223222aaa88f3c'
            - '7a35008a1a1ae3d093703c3a34a21993409af42eb61161aad1b6ae4afa8bbb70'
            - 'a9e9d7770ff948bb65c0db24431f75dd934a803181afa22b6b014fac9a162dab'
            - 'b287c0bc239b434b90eef01bcbd00ff48192b7cbeb540e568b8cdcdc26f90959'
            - 'ca47c8710c4ffb4908a42bd986b14cddcca39e30bb0b11ed5ca16fe8922a468b'
            - 'e08c7f4a6882f260011909a868311c6e9b54f3e4'
            - '0333052d90683d88531558dcfdbf2525cc37c233'
            - '1e5e8d672fec9f2ab352be121be971877bff2af9'
            - '5e43eb3cd731649c4f8b9134f857be62a416c893'
            - '938b255f6cb8817c95b0dd5c8c2944acfce94b07'
            - '1e3c50d64110be466c0b4a45222e81d2c9352888'
            - 'bf9252a2fb45be6893dd8870c0bf37e2e1766d61'
            - '27FA11F6A1D653779974B6FB54DE4AF47F211232'
            - '3FA7D1B13542F1A9EB054111F9B69C250AF68643'
            - '43E30BE82D82B24A6496F6943ECB6877E83F88AB'
            - '4E52C92709A918383E90534052AAA257ACE2780C'
            - '4F2C1856325372B9B7769D00141DBC1A23BDDD14'
            - '6FDED427A16D5314BA3E1EB9AFD120DC84449769'
            - '776A43E46C36A539C916ED426745EE96E2392B39'
            - '7E537D8E91668580A482BD77A5A4CABA26D6BDAC'
            - '8D1F2A6DF51C7783F2EAF1A0FC0FF8D032E5B57F'
            - 'B65551D339AECE718EA1465BF3542C794C445EFC'
            - '1239288A5876C09D9F0A67BCFD645735168A7C80'
            - '3B267FA5E1D1B18411C22E97B367258986E871E5'
            - 'B66DA4280C6D72ADCC68330F6BD793DF56A853CB'
            - '3712793d3847dd0962361aa528fa124c'
            - '4e4f2dfe143ba261fd8a18d1c4b58f2e'
            - 'c91725905b273e81e9cc6983a11c8d60'
            - 'eb7635f4836c9e0aa4c315b18b051cb5'
            - '03860d116701cdc9d9bf9c45099bb3d3'
            - '11e7baca7e652995b2364fdab0d362b7'
            - '2cd4eb358c45ca783a20ec854a5a860c'
            - '2e5d1a352885a6efd84dbc0387cbc79e'
            - '3b7b4f2d33bdfb8a31b480d0eb2815cd'
            - '4a94d2b730a5a63e6cd54a9b0bb4ea71'
            - '4e0c37cbf4dde9683943c8a738e5b00a'
            - '51dec3e170f8a181cc9aea8dcc90c7ab'
            - '583fe1c1a39f6b873a5c0997bea1f657'
            - '697f182826495662427ca49edbb345fc'
            - '02f4701559fc40067e69bb426776a54f'
            - '0a5a06fa2e74a57fd5ed8e85f04a483a'
            - '1995682d600e329b7833003a01609252'
            - '22538214a3c917ff3b13a9e2035ca521'
            - '38b75af6cbdb60127decd59140d10640'
            - '454b85dc32dc8023cd2be04e4501f16a'
            - '48be833b0b0ca1ad3cf99c66dc89c3f4'
            - '5152410aeef667ffaf42d40746af4d84'
            - '5598baa59c716590d8841c6312d8349e'
            - '652f4da6c467838957de19eed40d39da'
            - '0565364633b5acdd24a498a6a9ab4eca'
            - '114721fbc23ff9d188535bd736a0d30e'
            - '19733e0dfa804e3676f97eff90f2e467'
            - '31d25ddf2697b9e13ee883fff328b22f'
            - '4126348d783393dd85ede3468e48405d'
            - '417ae7f384c49de8c672aec86d5a2860'
            - '5bdae6cb778d002c806bb7ed130985f3'
            - '686989d97cf0d70346cbde2031207cbf'
            - '79fe383f0963ae741193989c12aefacc'
            - '7b4c61ff418f6fe80cf8adb474278311'
            - '00857cca77b615c369f48ead5f8eb7f3'
            - '31d58c226fc5a0aa976e13ca9ecebcc8'
            - '8b21a945159f23b740c836eb50953818'
            - 'a8d3b9e1f5c7024d6e0b7a2c9f1d83e5'
            - 'af4760df2c08896a9638e26e7dd20aae'
            - 'cfe47df26c8eaf0a7c136b50c703e173'
            - '0c855f87a7574b28df383eca5084fcdc'
            - '8a9bd7e7a806b2cc606b7a1d8f495662'
            - '993AE4FE78B879239BDC14DFBC0963CD'
            - 'c8eb024c053f82831f2738bd48afc256'
            - 'c6eed09fc8b174b0f3eebedcceb1e792'
            - '08160acf08fccecde7b34090db18b321'
            - '52f1ff082e981cbdfd1f045c6021c63f'
            - '58ac2f65e335922be3f60e57099dc8a3'
            - '5c373c2116ab4a615e622f577e22e9be'
            - '65fc9f06de5603e2c1af9b4f288bb22c'
            - '678fb1a87af525c33ba2492552d5c0e2'
            - '7e0825019d0de0c1c4a1673f94043ddb'
            - '8983ffa6da23e0b99ccc58c17b9788c7'
            - '8e15c4d4f71bdd9dbc48cd2cabc87806'
            - '94faed9af49c98a89c8acc55e97276c9'
            - '4AFDC05708B8B39C82E60ABE3ACE55DB'
            - 'C7610AE28655D6C1BCE88B5D09624FEF'
            - 'E05DF8EE759E2C955ACC8D8A47A08F42'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com