title: CDB SENTINEL APEX - Network Threat Intel [59a620d1eeaa]
id: cdb-net-59a620d1eeaa
status: production
description: >
    Auto-generated detection rule for 12 malicious IPs and 67 malicious domains
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-15
modified: 2026-05-15
tags:
    - attack.command_and_control
    - attack.t1071
    - attack.t1090
logsource:
    category: firewall
    product: any
detection:
    selection:
        DestinationIp:
            - '47.252.11.99'
            - '47.90.180.205'
            - '149.50.97.144'
            - '45.78.214.188'
            - '49.51.68.143'
            - '147.45.178.61'
            - '11.136.0.8'
            - '4.3.04.7'
            - '4.9.04.16'
            - '5.0.05.4'
            - '5.1.05.8'
            - '5.9.05.12'
        DestinationHostname|contains:
            - 'amazonses.com'
            - 'cve.org'
            - 'getsession.org'
            - 'www.torproject.org'
            - 'x.com'
            - 'support.industry.siemens.com'
            - 'www.siemens.com'
            - 'breakdream.com'
            - 'cmailer.pro'
            - 'dreamdie.com'
            - 'group.com'
            - 'mylingocoin.com'
            - 'supportzm.com'
            - 'zmsupport.com'
            - 'www.trendmicro.com'
            - 'support.sw.siemens.com'
            - 'go.recordedfuture.com'
            - 'chamd5.org'
            - 'www.brighttalk.com'
            - 'artemis.apache.org'
            - 'helper.zulipchat.com'
            - 'tutamail.com'
            - 'kaspersky.com'
            - 'apps.googleusercontent.com'
            - 'internal.com'
            - 'my.salesforce.com'
            - 'www.googleapis.com'
            - 'rockwellautomation.com'
            - 'news.sophos.com'
            - 'simple-help.com'
            - 'www.universal-robots.com'
            - 'issue.net'
            - 'gmail.com'
            - 'linuxtesting.org'
            - 'lore.kernel.org'
            - 'redhat.com'
            - 'rel-1.16.0-0-gd239552ce722-prebuilt.qemu.org'
            - 'rel-1.16.3-0-ga6ed6b701f0a-prebuilt.qemu.org'
            - 'abb.com'
            - '00857cca77b615c369f48ead5f8eb7f3.com'
            - '0aa0cf0637d66c0d.com'
            - '31d58c226fc5a0aa976e13ca9ecebcc8.com'
            - '3k7m1n9p4q2r6s8t0v5w2x4y6z8u9.com'
            - '442fe7151fb1e9b5.com'
            - '6b86b273ff34fce1.online'
            - '7x2k9n4p1q0r5s8t3v6w0y2z4u7b9.com'
            - '8b21a945159f23b740c836eb50953818.com'
            - '8f00b204e9800998.com'
            - 'a7b37115ce3cc2eb.com'
            - 'a8d3b9e1f5c7024d6e0b7a2c9f1d83e5.com'
            - 'aa86a52a98162b7d.com'
            - 'af4760df2c08896a9638e26e7dd20aae.com'
            - 'asdk2.com'
            - 'b5e9a2d7f4c8e3b1a0d6f2e9c5b8a7d.com'
            - 'cfe47df26c8eaf0a7c136b50c703e173.com'
            - 'e4f8c1b9a2d7e3f6c0b5a8d9e2f1c4d.com'
            - 'api.cyberdudebivash.com'
            - 'blog.cyberdudebivash.com'
            - 'cyberdudebivash.com'
            - 'intel.cyberdudebivash.com'
            - 'tools.cyberdudebivash.com'
            - 'www.cyberdudebivash.com'
            - 'cpuid.com'
            - 'welcome.supp0v3.com'
            - 'calif.io'
            - 'tp-link.com'
            - 'veracara.digicert.com'
    condition: selection
level: medium
falsepositives:
    - Shared hosting infrastructure
    - CDN/cloud provider IP overlap
references:
    - https://intel.cyberdudebivash.com
    - https://cyberdudebivash.com/threat-intel