title: CDB SENTINEL APEX - Malicious File Hash Detection [c93d37696f1a]
id: cdb-hash-c93d37696f1a
status: production
description: >
    Auto-generated detection rule for 24 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-28
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '2b99ade9224add2ce86eb836dcf70040315f6dc95e772ea98f24a30cdf4fdb97'
            - 'b2d9a99de44a7cd8faf396d0482268369d14a315edaf18a36fa273ffd5500108'
            - '61aca585687ec21a182342a40de3eaa12d3fc0d92577456cae0df37c3ed28e99'
            - 'd4c184f4389d710c8aefe296486d4d3e430da609d86fa6289a8cea9fde4a1166'
            - '19CC41A0A056E503CC2137E19E952814FBDF14F8D83F799AEA9B96ABFF11EFBB'
            - '2F31D00FEEFE181F2D8B69033B382462FF19C35367753E6906ED80F815A7924F'
            - '325daeb781f3416a383343820064c8e98f2e31753cd71d76a886fe0dbb4fe59a'
            - '4D74F8E12FF69318BE5EB383B4E56178817E84E83D3607213160276A7328AB5D'
            - '76e4962b8ccd2e6fd6972d9c3264ccb6738ddb16066588dfcb223222aaa88f3c'
            - '7a35008a1a1ae3d093703c3a34a21993409af42eb61161aad1b6ae4afa8bbb70'
            - 'a9e9d7770ff948bb65c0db24431f75dd934a803181afa22b6b014fac9a162dab'
            - 'b287c0bc239b434b90eef01bcbd00ff48192b7cbeb540e568b8cdcdc26f90959'
            - 'ca47c8710c4ffb4908a42bd986b14cddcca39e30bb0b11ed5ca16fe8922a468b'
            - '406127ffcb2b91b8c10e20e6c2ca787fbc1dc92d'
            - 'f189116a9259950c2393f114dbcb94dde0ad864b'
            - 'e9c16aa2e322a65fc2621679ca8e7414ebcf89c0'
            - 'cf6ac48c972eaaee2af270adc3f36615325deb3e'
            - '1239288A5876C09D9F0A67BCFD645735168A7C80'
            - '3B267FA5E1D1B18411C22E97B367258986E871E5'
            - 'B66DA4280C6D72ADCC68330F6BD793DF56A853CB'
            - '5c3bf036ab8aadddb2428d27f3917b86'
            - '4AFDC05708B8B39C82E60ABE3ACE55DB'
            - 'C7610AE28655D6C1BCE88B5D09624FEF'
            - 'E05DF8EE759E2C955ACC8D8A47A08F42'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com