title: CDB SENTINEL APEX - Malicious File Hash Detection [1fd03693f73b]
id: cdb-hash-1fd03693f73b
status: production
description: >
    Auto-generated detection rule for 129 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-15
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '2a314ea8be337e1ca9ec833ed13ed854d9fd38bce0a519cf288f3bec8d9e6f30'
            - '5245eb032e336b85cff0dbb3450d591826bf2ef214fd30d7eba1a763664e151b'
            - 'D4a2086ea18f5e39cd867b8b06918a524eabb21d45ea98aad07357b98173458a'
            - '2fa987b9ed6ec6d09c7451abd994249dfaba1c5a7da1c22b8407c461e62f7e49'
            - '691f7258f212fa8908a8bf06bcf9e027d2177276e13e10ff56bd434ff3755cc4'
            - '6e6dab993f99505646051d2772701e3c4740096ff9be63c92713bcb7fcddf9f7'
            - '7f1d71e1e079f3244a69205588d504ed830d4c473747bb1b5c520634cc5a2477'
            - 'c8940de8cb917abe158a826a1d08f1083af517351d01642e6c7f324d0bba1eb8'
            - 'ca390b86793922555c84abc3b34406da2899382c617f9dcf83a74ac09dd18190'
            - 'de200b79ad2bd9db37baeba5e4d183498d450494c71c8929433681e848c3807f'
            - '14ae8de40153c66455d972e6e98fe06fb68db7301ba126557e96599527bc5509'
            - '30fe91200a2bb4aed13b1a1ba4ec8fd4454566f5929ffed4f537d9a87c1bf118'
            - '6ed6058f0b0735ba56b781dea39353625fcb56bc3e77bf2d26a648511d754d21'
            - '77f6bec5dd217151fcd03087a6e7ba1070f0fa603801fb128a4097076c9976d3'
            - 'c1ba73df60e12b3feb8b5574e65cfceb6910460ab7fae2cf5554769fafdad049'
            - 'e5eff99959683480d2280c931e433af836adf6a8b7a8489b1af17cddcf480cf6'
            - '03f00a143b8929585c122d490b6a3895d639c17d92C2223917e3a9ca1b8d30f9'
            - '1a30d6cdb0b98feed62563be8050db55ae0156ed437701d36a7b46aabf086ede'
            - '603848f37ab932dccef98ee27e3c5af9221d3b6ccfe457ccf93cb572495ac325'
            - 'b452C2da7c012eda25a1403b3313444b5eb7C2c3e25eee489f1bd256f8434735'
            - 'b525837273dde06b86b5f93f9aeC2C29665324105b0b66f6df81884754f8080d'
            - 'c3e5d878a30a6c46e22d1dd2089b32086c91f13f8b9c413aa84e1dbaa03b9375'
            - 'c8f7608d4e19f6cb03680941bbd09fe969668bcb09c7ca985048a22e014dffcd'
            - '449e4265979b5fdb2d3446c021af437e815debd66de7da2fe54f1ad93cbcc75e'
            - '78a82d93b4f580835f5823b85a3d9ee1f03a15ee6f0e01b4eac86252a7002981'
            - '96097e0612d9575cb133021017fb1a5c68a03b60f9f3d24ebdc0e628d9034144'
            - 'c2f4dc64aec4631540a568e88932b61daebbfb7e8281b812fa01b7215f9be9ea'
            - '01ac6012d4316b68bb3165ee451f2fcc494e4e37011a73b8cf2680de3364fcf4'
            - '2d1891b6d0c158ad7280f0f30f3c9d913960a793c6abcda249f9c76e13014e45'
            - '59cbdecfc01eba859d12fbeb48f96fe3fe841ac1aafa6bd38eff92f0dcfd4554'
            - 'aef34f14456358db91840c416e55acc7d10185ff2beb362ea24697d7cdad321f'
            - 'b0726bdd53083968870d0b147b72dad422d6d04f27cd52a7891d038ee83aef5b'
            - 'ba9b1f4cc2c7f4aeda7a1280bbc901671f4ec3edaa17f1db676e17651e9bff5f'
            - '025fc0976c548fb5a880c83ea3eb21a5f23c5d53c4e51e862bb893c11adf712a'
            - '078163d5c16f64caa5a14784323fd51451b8c831c73396b967b4e35e6879937b'
            - '1eece1e1ba4b96e6c784729f0608ad2939cfb67bc4236dfababbe1d09268960c'
            - '22b38dad7da097ea03aa28d0614164cd25fafeb1383dbc15047e34c8050f6f67'
            - '2ed9494e9b7b68415b4eb151c922c82c0191294d0aa443dd2cb5133e6bfe3d5d'
            - '3ab9575225e00a83a4ac2b534da5a710bdcf6eb72884944c437b5fbe5c5c9235'
            - '48d9b2ce4fcd6854a3164ce395d7140014e0b58b77680623f3e4ca22d3a6e7fd'
            - '5dc607c8990841139768884b1b43e1403496d5a458788a1937be139594f01dca'
            - '62c2c24937d67fdeb43f2c9690ab10e8bb90713af46945048db9a94a465ffcb8'
            - '788ba200f776a188c248d6c2029f00b5d34be45d4444f7cb89ffe838c39b8b19'
            - '58e17dd61d4d55fa77c7f2dd28dd51875b0ce900c1e43b368b349e65f27d6fdd'
            - '8ee4ec425bc0d8db050d13bbff98f483fff020050d49f40c5055ca2b9f6b1c4d'
            - '9c745f95a09b37bc0486bf0f92aad4a3d5548a939c086b93d6235d34648e683f'
            - 'a7eadcf81dd6fda0dd6affefaffcb33b1d8f64ddec6e5a1772d028ef2a7da0f2'
            - 'e1fc59c7ece6e9a7fb262fc8529e3c4905503a1ca44630f9724b2ccc518d0c06'
            - 'e512d22d2bd989f35ebaccb63615434870dc0642b0f60e6d4bda0bb89adee27a'
            - '1334f0189a8e6dbc48456fa4b482c5726ab7609f7fa652fcc4c1a96f2334436f'
            - '1af419b36a5edefef387409e2b3248c9223f7dc49a4f7b15ea095d371c3a70b2'
            - '24ac3588fb8cfbff63b7fdfcbc7dec1f3c60e54e6f949dd69d68e89e0c89d966'
            - '3c2182cb0bc7528829ef03f1b1745a92bcc47d917eb8870862488f21fdf1a6d6'
            - '29c729852fce5a53e30a1541d9fec79c915b2e13'
            - '8927cc503d48e4b5eb56b31abc2870c2ed2e98d6'
            - 'be27fc96ab4fcadaec49c03278063dd269ea5eef'
            - 'f1eda94a5978cf0aae0d88d92ec78d556d696e20'
            - '18f22d3337facbbd0047c19f4efdea75ccb9e3ec'
            - '33f6d4f4269cec740a5eb05e41a4c7926742606b'
            - '673b4f2682f29b19ecabf9a6ec9c3042c9b1cfb3'
            - '793cb9b1d7846afa4fb8e900d6e9ed9501dc3e7e'
            - '92b2413578c8ba9708df6091660af53acdc505f3'
            - '957b8eaa7e25b4d9ca1050cd7ab19e4a2add707d'
            - '9dbdddf1dda680ab750a707084839fe970266964'
            - 'c3ecb90c9915daa23aec51f93ff8665778866f05'
            - '1e3c50d64110be466c0b4a45222e81d2c9352888'
            - 'bf9252a2fb45be6893dd8870c0bf37e2e1766d61'
            - 'e08c7f4a6882f260011909a868311c6e9b54f3e4'
            - '0333052d90683d88531558dcfdbf2525cc37c233'
            - '1e5e8d672fec9f2ab352be121be971877bff2af9'
            - '5e43eb3cd731649c4f8b9134f857be62a416c893'
            - '938b255f6cb8817c95b0dd5c8c2944acfce94b07'
            - '82d24f2124a8e15d7b90f2fa8601266c'
            - '02f4701559fc40067e69bb426776a54f'
            - '0a5a06fa2e74a57fd5ed8e85f04a483a'
            - '1995682d600e329b7833003a01609252'
            - '22538214a3c917ff3b13a9e2035ca521'
            - '38b75af6cbdb60127decd59140d10640'
            - '454b85dc32dc8023cd2be04e4501f16a'
            - '48be833b0b0ca1ad3cf99c66dc89c3f4'
            - '5152410aeef667ffaf42d40746af4d84'
            - '5598baa59c716590d8841c6312d8349e'
            - '652f4da6c467838957de19eed40d39da'
            - '3712793d3847dd0962361aa528fa124c'
            - '4e4f2dfe143ba261fd8a18d1c4b58f2e'
            - 'c91725905b273e81e9cc6983a11c8d60'
            - 'eb7635f4836c9e0aa4c315b18b051cb5'
            - '00857cca77b615c369f48ead5f8eb7f3'
            - '31d58c226fc5a0aa976e13ca9ecebcc8'
            - '8b21a945159f23b740c836eb50953818'
            - 'a8d3b9e1f5c7024d6e0b7a2c9f1d83e5'
            - 'af4760df2c08896a9638e26e7dd20aae'
            - 'cfe47df26c8eaf0a7c136b50c703e173'
            - '0c855f87a7574b28df383eca5084fcdc'
            - '8a9bd7e7a806b2cc606b7a1d8f495662'
            - '993AE4FE78B879239BDC14DFBC0963CD'
            - 'c8eb024c053f82831f2738bd48afc256'
            - '08160acf08fccecde7b34090db18b321'
            - '52f1ff082e981cbdfd1f045c6021c63f'
            - '58ac2f65e335922be3f60e57099dc8a3'
            - '5c373c2116ab4a615e622f577e22e9be'
            - '65fc9f06de5603e2c1af9b4f288bb22c'
            - '678fb1a87af525c33ba2492552d5c0e2'
            - '7e0825019d0de0c1c4a1673f94043ddb'
            - '8983ffa6da23e0b99ccc58c17b9788c7'
            - '8e15c4d4f71bdd9dbc48cd2cabc87806'
            - '94faed9af49c98a89c8acc55e97276c9'
            - '0554f3b69d39d175dd110d765c11347a'
            - '762f787534a891eca8aa9b41330b4108'
            - '0565364633b5acdd24a498a6a9ab4eca'
            - '114721fbc23ff9d188535bd736a0d30e'
            - '19733e0dfa804e3676f97eff90f2e467'
            - '31d25ddf2697b9e13ee883fff328b22f'
            - '4126348d783393dd85ede3468e48405d'
            - '417ae7f384c49de8c672aec86d5a2860'
            - '5bdae6cb778d002c806bb7ed130985f3'
            - '686989d97cf0d70346cbde2031207cbf'
            - '79fe383f0963ae741193989c12aefacc'
            - '7b4c61ff418f6fe80cf8adb474278311'
            - '03860d116701cdc9d9bf9c45099bb3d3'
            - '11e7baca7e652995b2364fdab0d362b7'
            - '2cd4eb358c45ca783a20ec854a5a860c'
            - '2e5d1a352885a6efd84dbc0387cbc79e'
            - '3b7b4f2d33bdfb8a31b480d0eb2815cd'
            - '4a94d2b730a5a63e6cd54a9b0bb4ea71'
            - '4e0c37cbf4dde9683943c8a738e5b00a'
            - '51dec3e170f8a181cc9aea8dcc90c7ab'
            - '583fe1c1a39f6b873a5c0997bea1f657'
            - '697f182826495662427ca49edbb345fc'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com