title: CDB SENTINEL APEX - Malicious File Hash Detection [ee67be40157f]
id: cdb-hash-ee67be40157f
status: production
description: >
    Auto-generated detection rule for 138 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-07
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '19CC41A0A056E503CC2137E19E952814FBDF14F8D83F799AEA9B96ABFF11EFBB'
            - '2F31D00FEEFE181F2D8B69033B382462FF19C35367753E6906ED80F815A7924F'
            - '325daeb781f3416a383343820064c8e98f2e31753cd71d76a886fe0dbb4fe59a'
            - '4D74F8E12FF69318BE5EB383B4E56178817E84E83D3607213160276A7328AB5D'
            - '76e4962b8ccd2e6fd6972d9c3264ccb6738ddb16066588dfcb223222aaa88f3c'
            - '7a35008a1a1ae3d093703c3a34a21993409af42eb61161aad1b6ae4afa8bbb70'
            - 'a9e9d7770ff948bb65c0db24431f75dd934a803181afa22b6b014fac9a162dab'
            - 'b287c0bc239b434b90eef01bcbd00ff48192b7cbeb540e568b8cdcdc26f90959'
            - 'ca47c8710c4ffb4908a42bd986b14cddcca39e30bb0b11ed5ca16fe8922a468b'
            - '025fc0976c548fb5a880c83ea3eb21a5f23c5d53c4e51e862bb893c11adf712a'
            - '078163d5c16f64caa5a14784323fd51451b8c831c73396b967b4e35e6879937b'
            - '1eece1e1ba4b96e6c784729f0608ad2939cfb67bc4236dfababbe1d09268960c'
            - '22b38dad7da097ea03aa28d0614164cd25fafeb1383dbc15047e34c8050f6f67'
            - '2ed9494e9b7b68415b4eb151c922c82c0191294d0aa443dd2cb5133e6bfe3d5d'
            - '3ab9575225e00a83a4ac2b534da5a710bdcf6eb72884944c437b5fbe5c5c9235'
            - '48d9b2ce4fcd6854a3164ce395d7140014e0b58b77680623f3e4ca22d3a6e7fd'
            - '5dc607c8990841139768884b1b43e1403496d5a458788a1937be139594f01dca'
            - '62c2c24937d67fdeb43f2c9690ab10e8bb90713af46945048db9a94a465ffcb8'
            - '788ba200f776a188c248d6c2029f00b5d34be45d4444f7cb89ffe838c39b8b19'
            - '1319d474d19eb386841732c728acf0c5fe64aa135101c6ceee1bd0369ecf97b6'
            - '24857fe82f454719cd18bcbe19b0cfa5387bee1022008b7f5f3a8be9f05e4d14'
            - '3df9dcc45d2a3b1f639e40d47eceeafb229f6d9e7f0adcd8f1731af1563ffb90'
            - 'a3bac548b5bc91c526b4d6707623ddbd1a675aa952f0d1f9a0aa6f7230f09f23'
            - 'a47cd0dc12f0152d8f05b79e5c86bac9231f621db7b0e90a32f87b98b4e82f3a'
            - 'a92d28f1d32e3a9ab7c3691f8bfca8f7586bb0666adbba47eab3e1a8faf7ecc0'
            - 'bfc1675ee1e358db8356f515aaded7962923e426aa0a0a1c0eddfc4dab053f89'
            - 'c86ab27100f2a2939ac0d4a8af511f0a1a8116ba856100aae03bc2ad6cb0f1e0'
            - 'cd098eddb23f2d2f6c42271ca82803b0d5ac950cb82a9b8ae0928e83945a53df'
            - 'cf3dfd1d6626fd2129abb7a5983c11827f4b0d497e2dba146a1889bd71f23cd5'
            - '2fa987b9ed6ec6d09c7451abd994249dfaba1c5a7da1c22b8407c461e62f7e49'
            - '691f7258f212fa8908a8bf06bcf9e027d2177276e13e10ff56bd434ff3755cc4'
            - '6e6dab993f99505646051d2772701e3c4740096ff9be63c92713bcb7fcddf9f7'
            - '7f1d71e1e079f3244a69205588d504ed830d4c473747bb1b5c520634cc5a2477'
            - 'c8940de8cb917abe158a826a1d08f1083af517351d01642e6c7f324d0bba1eb8'
            - 'ca390b86793922555c84abc3b34406da2899382c617f9dcf83a74ac09dd18190'
            - 'de200b79ad2bd9db37baeba5e4d183498d450494c71c8929433681e848c3807f'
            - '071e662fc5bc0e54bcfd49493467062570d0307dc46f0fb51a68239d281427c6'
            - '2b627f6afe1364a7d0d832ccba87ef33a8a39f30a70a5f395e2a3cb0e2161cb3'
            - '35b2a5260b21ddb145486771ec2b1e4dc1f5b7f2275309e139e4abc1da0c614b'
            - '7c593ca40725765a0747cc3100b43a29b88ad1708ef77e915ab02686c0153001'
            - '7d9c70fc36143eb33583c30430dcb40cf9d306067594cc30ffd113063acd6292'
            - '843f8aea7842126e906cadbad8d81fa456c184fb5372c6946978a4fe115edb1c'
            - '9f115e9b32111e4dc29343a2671ab10a2b38448657b24107766dc14ce528fceb'
            - 'f859a67ceebc52f0770a222b85a5002195089ee442eac4bea761c29be994e2ea'
            - 'fb6cebadd49d202c8c7b5cdd641bd16aac8258429e8face365a94bd32e253b00'
            - '42D0C420EB5FE181388F2E4F0B7D7C0D302971E7A06FDC1BEC481B68C8CCAE1F'
            - '82DAA93219BA40A6E41CDF3174BA57EB5D3383D1CD805584E9954EB0200182A1'
            - 'C99CF0DC1EF1057D713CB082ACAF42E4DF4656809C91741752BDDCAB39BBFACA'
            - 'd55549d5655e2f202e215676f4bdb0994ea08a93d15ec4ded413f64cfa7facc8'
            - 'ea1d34b21b739a6bbf89b3f7e67978005cf7f3eda612cefc7eac1c8ead7c5545'
            - '58e17dd61d4d55fa77c7f2dd28dd51875b0ce900c1e43b368b349e65f27d6fdd'
            - '8ee4ec425bc0d8db050d13bbff98f483fff020050d49f40c5055ca2b9f6b1c4d'
            - '9c745f95a09b37bc0486bf0f92aad4a3d5548a939c086b93d6235d34648e683f'
            - 'a7eadcf81dd6fda0dd6affefaffcb33b1d8f64ddec6e5a1772d028ef2a7da0f2'
            - 'e1fc59c7ece6e9a7fb262fc8529e3c4905503a1ca44630f9724b2ccc518d0c06'
            - 'e512d22d2bd989f35ebaccb63615434870dc0642b0f60e6d4bda0bb89adee27a'
            - '01ac6012d4316b68bb3165ee451f2fcc494e4e37011a73b8cf2680de3364fcf4'
            - '2d1891b6d0c158ad7280f0f30f3c9d913960a793c6abcda249f9c76e13014e45'
            - '59cbdecfc01eba859d12fbeb48f96fe3fe841ac1aafa6bd38eff92f0dcfd4554'
            - 'aef34f14456358db91840c416e55acc7d10185ff2beb362ea24697d7cdad321f'
            - 'b0726bdd53083968870d0b147b72dad422d6d04f27cd52a7891d038ee83aef5b'
            - 'ba9b1f4cc2c7f4aeda7a1280bbc901671f4ec3edaa17f1db676e17651e9bff5f'
            - '272c86c6db95f1ef8b83f672b65e64df16494cae261e1aba1aeb1e59dcb68524'
            - '29f89486bb820d40c9bee8bf70ee8664ea270b16e486af4a53ab703996943256'
            - '2c40e7cf613bf2806ff6e9bc396058fe4f85926493979189dbdbc7d615b7cb14'
            - '33580073680016f23bf474e6e62c61bf6a776e561385bfb06788a4713114ba9d'
            - '3b47df790abb4eb3ac570b50bf96bb1943d4b46851430ebf3fc36f645061491b'
            - '3b85d0261ab2531aba9e2992eb85273be0e26fe61e4592862d8f45d6807ceee4'
            - '498961237cf1c48f1e7764829818c5ba0af24a234c2f29c4420fb80276aec676'
            - '4f4567abe9ff520797b04b04255bbbe07ecdddb594559d436ac53314ec62c1b3'
            - '53f1b841d323c211c715b8f80d0efb9529440caae921a60340de027052946dd9'
            - '54305c7b95d8105601461bb18de87f1f679d833f15e38a9ee7895a0c8605c0d0'
            - '90de84bb542adb54766fec66ee554475b7e1a56a9d8b30e3598230f9ef6d6ac7'
            - '03f00a143b8929585c122d490b6a3895d639c17d92C2223917e3a9ca1b8d30f9'
            - '1a30d6cdb0b98feed62563be8050db55ae0156ed437701d36a7b46aabf086ede'
            - '603848f37ab932dccef98ee27e3c5af9221d3b6ccfe457ccf93cb572495ac325'
            - 'b452C2da7c012eda25a1403b3313444b5eb7C2c3e25eee489f1bd256f8434735'
            - 'b525837273dde06b86b5f93f9aeC2C29665324105b0b66f6df81884754f8080d'
            - 'c3e5d878a30a6c46e22d1dd2089b32086c91f13f8b9c413aa84e1dbaa03b9375'
            - 'c8f7608d4e19f6cb03680941bbd09fe969668bcb09c7ca985048a22e014dffcd'
            - '2b99ade9224add2ce86eb836dcf70040315f6dc95e772ea98f24a30cdf4fdb97'
            - '45bff0df2c408b3f589aed984cc331b617021ecbea57171dac719b5f545f5e8d'
            - '4ed176edb75ae2114cda8cfb3f83ac2ecdc4476fa1ef30ad8c81a54c0a223a29'
            - '6ccacb7567b6c0bd2ca8e68ff59d5ef21e8f47fc1af70d4d88a421f1fc5280fc'
            - '2f04ba77bb841111036b979fc0dab7fcbae99749718ae1dd6fd348d4495b5f74'
            - 'e11f69b49b6f2e829454371c31ebf86893f82a042dae3f2faf63dcd84f97a584'
            - '1239288A5876C09D9F0A67BCFD645735168A7C80'
            - '3B267FA5E1D1B18411C22E97B367258986E871E5'
            - 'B66DA4280C6D72ADCC68330F6BD793DF56A853CB'
            - 'B674578D4BDB24CD58BF2DC884EAA658B7AA250C'
            - 'd85cef60cdb9e8d0f3cb3546de6ab657f9498ac7'
            - '811fbf0ff6b6acabe4b545e493ec0dd0178a0302'
            - '4AFDC05708B8B39C82E60ABE3ACE55DB'
            - 'C7610AE28655D6C1BCE88B5D09624FEF'
            - 'E05DF8EE759E2C955ACC8D8A47A08F42'
            - '439C0A0A46627BD166E08436F383AD56'
            - 'F8560B9A893EEB2130FC7159E9C1B851'
            - '0565364633b5acdd24a498a6a9ab4eca'
            - '114721fbc23ff9d188535bd736a0d30e'
            - '19733e0dfa804e3676f97eff90f2e467'
            - '31d25ddf2697b9e13ee883fff328b22f'
            - '4126348d783393dd85ede3468e48405d'
            - '417ae7f384c49de8c672aec86d5a2860'
            - '5bdae6cb778d002c806bb7ed130985f3'
            - '686989d97cf0d70346cbde2031207cbf'
            - '79fe383f0963ae741193989c12aefacc'
            - '7b4c61ff418f6fe80cf8adb474278311'
            - '02f4701559fc40067e69bb426776a54f'
            - '0a5a06fa2e74a57fd5ed8e85f04a483a'
            - '1995682d600e329b7833003a01609252'
            - '22538214a3c917ff3b13a9e2035ca521'
            - '38b75af6cbdb60127decd59140d10640'
            - '454b85dc32dc8023cd2be04e4501f16a'
            - '48be833b0b0ca1ad3cf99c66dc89c3f4'
            - '5152410aeef667ffaf42d40746af4d84'
            - '5598baa59c716590d8841c6312d8349e'
            - '652f4da6c467838957de19eed40d39da'
            - '808c87015194c51d74356854dfb10d9e'
            - 'd7a68749635604d6d7297e4fa2530eb6'
            - '107484d66423cb601f418344cd648f12'
            - '34a0f70ab100c47caaba7a5c85448e3d'
            - '7528bf597fd7764fcb7ec06512e073e0'
            - '8354223cd6198b05904337b5dff7772b'
            - '00857cca77b615c369f48ead5f8eb7f3'
            - '31d58c226fc5a0aa976e13ca9ecebcc8'
            - '8b21a945159f23b740c836eb50953818'
            - 'a8d3b9e1f5c7024d6e0b7a2c9f1d83e5'
            - 'af4760df2c08896a9638e26e7dd20aae'
            - 'cfe47df26c8eaf0a7c136b50c703e173'
            - '0c855f87a7574b28df383eca5084fcdc'
            - '8a9bd7e7a806b2cc606b7a1d8f495662'
            - '993AE4FE78B879239BDC14DFBC0963CD'
            - 'c8eb024c053f82831f2738bd48afc256'
            - 'ec33308ad2c34f92bab09df09c66954d'
            - '3712793d3847dd0962361aa528fa124c'
            - '4e4f2dfe143ba261fd8a18d1c4b58f2e'
            - 'c91725905b273e81e9cc6983a11c8d60'
            - 'eb7635f4836c9e0aa4c315b18b051cb5'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com