title: CDB SENTINEL APEX - Malicious File Hash Detection [00791719cef0]
id: cdb-hash-00791719cef0
status: production
description: >
    Auto-generated detection rule for 124 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-12
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '025fc0976c548fb5a880c83ea3eb21a5f23c5d53c4e51e862bb893c11adf712a'
            - '078163d5c16f64caa5a14784323fd51451b8c831c73396b967b4e35e6879937b'
            - '1eece1e1ba4b96e6c784729f0608ad2939cfb67bc4236dfababbe1d09268960c'
            - '22b38dad7da097ea03aa28d0614164cd25fafeb1383dbc15047e34c8050f6f67'
            - '2ed9494e9b7b68415b4eb151c922c82c0191294d0aa443dd2cb5133e6bfe3d5d'
            - '3ab9575225e00a83a4ac2b534da5a710bdcf6eb72884944c437b5fbe5c5c9235'
            - '48d9b2ce4fcd6854a3164ce395d7140014e0b58b77680623f3e4ca22d3a6e7fd'
            - '5dc607c8990841139768884b1b43e1403496d5a458788a1937be139594f01dca'
            - '62c2c24937d67fdeb43f2c9690ab10e8bb90713af46945048db9a94a465ffcb8'
            - '788ba200f776a188c248d6c2029f00b5d34be45d4444f7cb89ffe838c39b8b19'
            - '01889a9ec2abecb73e5e8792be68a4e3bc7dcbe1c3f19ac06763682d63aa8c21'
            - '143c0e12d2aa1bdecde59f273139dd5605d00f61cda7f626224e07390119c026'
            - '177ef86c57c31b29850227dbc8288b735bea977587f2f0a49cfc4089a644a2c4'
            - '4cd8635062ff6b0885216a0b1658ebcb2938b670f7ac08ecb0b5fb85d8973ea0'
            - '749bbcbc3e5d2d524344d52b6471dfa7b8d3ecdeb0b11ab82c843d497a056c8f'
            - 'e2e218ddf698b4c0099fd2a9619d6912a71f75beb51669a4e3ae4fc71f745d03'
            - '2fa987b9ed6ec6d09c7451abd994249dfaba1c5a7da1c22b8407c461e62f7e49'
            - '691f7258f212fa8908a8bf06bcf9e027d2177276e13e10ff56bd434ff3755cc4'
            - '6e6dab993f99505646051d2772701e3c4740096ff9be63c92713bcb7fcddf9f7'
            - '7f1d71e1e079f3244a69205588d504ed830d4c473747bb1b5c520634cc5a2477'
            - 'c8940de8cb917abe158a826a1d08f1083af517351d01642e6c7f324d0bba1eb8'
            - 'ca390b86793922555c84abc3b34406da2899382c617f9dcf83a74ac09dd18190'
            - 'de200b79ad2bd9db37baeba5e4d183498d450494c71c8929433681e848c3807f'
            - '90de84bb542adb54766fec66ee554475b7e1a56a9d8b30e3598230f9ef6d6ac7'
            - '5a6636ce490789d7f26aaa86e50bd65c7330f8e6a7c32418740c1d009fb12ef3'
            - '5fdbee7aa7ba6a5026855a35a9fe075967341017d3cb932e736a12dd00ed590a'
            - '77a60b5c443f011dc67ace877f5b2ad7773501f3d82481db7f4a5238cf895f80'
            - '01ff1e56fd59a8fa525d97e670f7f297a1a204331b89b2cd4e36a9abc6419203'
            - '3ddb8967919a801b3c383e58cddceab21138134c6a26560d99e2672e86f36f2a'
            - 'f50a96d26a5b0beb29de4127e82b2bf350c21511e5a43d286e43f798dc6cd53f'
            - '45bff0df2c408b3f589aed984cc331b617021ecbea57171dac719b5f545f5e8d'
            - '4ed176edb75ae2114cda8cfb3f83ac2ecdc4476fa1ef30ad8c81a54c0a223a29'
            - '6ccacb7567b6c0bd2ca8e68ff59d5ef21e8f47fc1af70d4d88a421f1fc5280fc'
            - '01ac6012d4316b68bb3165ee451f2fcc494e4e37011a73b8cf2680de3364fcf4'
            - '2d1891b6d0c158ad7280f0f30f3c9d913960a793c6abcda249f9c76e13014e45'
            - '59cbdecfc01eba859d12fbeb48f96fe3fe841ac1aafa6bd38eff92f0dcfd4554'
            - 'aef34f14456358db91840c416e55acc7d10185ff2beb362ea24697d7cdad321f'
            - 'b0726bdd53083968870d0b147b72dad422d6d04f27cd52a7891d038ee83aef5b'
            - 'ba9b1f4cc2c7f4aeda7a1280bbc901671f4ec3edaa17f1db676e17651e9bff5f'
            - '03f00a143b8929585c122d490b6a3895d639c17d92C2223917e3a9ca1b8d30f9'
            - '1a30d6cdb0b98feed62563be8050db55ae0156ed437701d36a7b46aabf086ede'
            - '603848f37ab932dccef98ee27e3c5af9221d3b6ccfe457ccf93cb572495ac325'
            - 'b452C2da7c012eda25a1403b3313444b5eb7C2c3e25eee489f1bd256f8434735'
            - 'b525837273dde06b86b5f93f9aeC2C29665324105b0b66f6df81884754f8080d'
            - 'c3e5d878a30a6c46e22d1dd2089b32086c91f13f8b9c413aa84e1dbaa03b9375'
            - 'c8f7608d4e19f6cb03680941bbd09fe969668bcb09c7ca985048a22e014dffcd'
            - '1319d474d19eb386841732c728acf0c5fe64aa135101c6ceee1bd0369ecf97b6'
            - '24857fe82f454719cd18bcbe19b0cfa5387bee1022008b7f5f3a8be9f05e4d14'
            - '3df9dcc45d2a3b1f639e40d47eceeafb229f6d9e7f0adcd8f1731af1563ffb90'
            - '86e0197389f0573eb83ff53991f337d416124c7c8bd727721ef3d396cd5f65dc'
            - 'a3bac548b5bc91c526b4d6707623ddbd1a675aa952f0d1f9a0aa6f7230f09f23'
            - 'a47cd0dc12f0152d8f05b79e5c86bac9231f621db7b0e90a32f87b98b4e82f3a'
            - 'a92d28f1d32e3a9ab7c3691f8bfca8f7586bb0666adbba47eab3e1a8faf7ecc0'
            - 'bfc1675ee1e358db8356f515aaded7962923e426aa0a0a1c0eddfc4dab053f89'
            - 'c86ab27100f2a2939ac0d4a8af511f0a1a8116ba856100aae03bc2ad6cb0f1e0'
            - 'cd098eddb23f2d2f6c42271ca82803b0d5ac950cb82a9b8ae0928e83945a53df'
            - '19CC41A0A056E503CC2137E19E952814FBDF14F8D83F799AEA9B96ABFF11EFBB'
            - '2F31D00FEEFE181F2D8B69033B382462FF19C35367753E6906ED80F815A7924F'
            - '325daeb781f3416a383343820064c8e98f2e31753cd71d76a886fe0dbb4fe59a'
            - '4D74F8E12FF69318BE5EB383B4E56178817E84E83D3607213160276A7328AB5D'
            - '76e4962b8ccd2e6fd6972d9c3264ccb6738ddb16066588dfcb223222aaa88f3c'
            - '7a35008a1a1ae3d093703c3a34a21993409af42eb61161aad1b6ae4afa8bbb70'
            - 'a9e9d7770ff948bb65c0db24431f75dd934a803181afa22b6b014fac9a162dab'
            - 'b287c0bc239b434b90eef01bcbd00ff48192b7cbeb540e568b8cdcdc26f90959'
            - 'ca47c8710c4ffb4908a42bd986b14cddcca39e30bb0b11ed5ca16fe8922a468b'
            - '0cbf4f21cf157227d2c3fba80b64e1f4c3f9d2cc0bf926e024252c35e93edd5a'
            - '6b4a4b64e6f969017cb3a9a71dd3038ddf32b989e5342dbbe36650d5802f2ee4'
            - 'b84b89f0a1b7f00431274ac676104acaaa73d440e5731161d1077e733014cc29'
            - '58e17dd61d4d55fa77c7f2dd28dd51875b0ce900c1e43b368b349e65f27d6fdd'
            - '8ee4ec425bc0d8db050d13bbff98f483fff020050d49f40c5055ca2b9f6b1c4d'
            - '9c745f95a09b37bc0486bf0f92aad4a3d5548a939c086b93d6235d34648e683f'
            - 'a7eadcf81dd6fda0dd6affefaffcb33b1d8f64ddec6e5a1772d028ef2a7da0f2'
            - 'e1fc59c7ece6e9a7fb262fc8529e3c4905503a1ca44630f9724b2ccc518d0c06'
            - 'e512d22d2bd989f35ebaccb63615434870dc0642b0f60e6d4bda0bb89adee27a'
            - 'B674578D4BDB24CD58BF2DC884EAA658B7AA250C'
            - '1239288A5876C09D9F0A67BCFD645735168A7C80'
            - '3B267FA5E1D1B18411C22E97B367258986E871E5'
            - 'B66DA4280C6D72ADCC68330F6BD793DF56A853CB'
            - '94d651b42355f2b0765a7435e5a5927623807225'
            - '79ac49eedf774dd4b0cfa308722bc463cfe5885c'
            - '02f4701559fc40067e69bb426776a54f'
            - '0a5a06fa2e74a57fd5ed8e85f04a483a'
            - '1995682d600e329b7833003a01609252'
            - '22538214a3c917ff3b13a9e2035ca521'
            - '38b75af6cbdb60127decd59140d10640'
            - '454b85dc32dc8023cd2be04e4501f16a'
            - '48be833b0b0ca1ad3cf99c66dc89c3f4'
            - '5152410aeef667ffaf42d40746af4d84'
            - '5598baa59c716590d8841c6312d8349e'
            - '652f4da6c467838957de19eed40d39da'
            - '00857cca77b615c369f48ead5f8eb7f3'
            - '31d58c226fc5a0aa976e13ca9ecebcc8'
            - '8b21a945159f23b740c836eb50953818'
            - 'a8d3b9e1f5c7024d6e0b7a2c9f1d83e5'
            - 'af4760df2c08896a9638e26e7dd20aae'
            - 'cfe47df26c8eaf0a7c136b50c703e173'
            - '0c855f87a7574b28df383eca5084fcdc'
            - '8a9bd7e7a806b2cc606b7a1d8f495662'
            - '993AE4FE78B879239BDC14DFBC0963CD'
            - 'c8eb024c053f82831f2738bd48afc256'
            - '3712793d3847dd0962361aa528fa124c'
            - '4e4f2dfe143ba261fd8a18d1c4b58f2e'
            - 'c91725905b273e81e9cc6983a11c8d60'
            - 'eb7635f4836c9e0aa4c315b18b051cb5'
            - '439C0A0A46627BD166E08436F383AD56'
            - 'F8560B9A893EEB2130FC7159E9C1B851'
            - 'ec33308ad2c34f92bab09df09c66954d'
            - '4AFDC05708B8B39C82E60ABE3ACE55DB'
            - 'C7610AE28655D6C1BCE88B5D09624FEF'
            - 'E05DF8EE759E2C955ACC8D8A47A08F42'
            - 'ce612d027e631d6633582227eb29002f'
            - '0565364633b5acdd24a498a6a9ab4eca'
            - '114721fbc23ff9d188535bd736a0d30e'
            - '19733e0dfa804e3676f97eff90f2e467'
            - '31d25ddf2697b9e13ee883fff328b22f'
            - '4126348d783393dd85ede3468e48405d'
            - '417ae7f384c49de8c672aec86d5a2860'
            - '5bdae6cb778d002c806bb7ed130985f3'
            - '686989d97cf0d70346cbde2031207cbf'
            - '79fe383f0963ae741193989c12aefacc'
            - '7b4c61ff418f6fe80cf8adb474278311'
            - '2286f126ab4740ccf2595ad1fa0c615c'
            - '9305b4ebbb4d39907cf36b62989a6af3'
            - 'fb1bc3f935fdeb3555465070ba2db33c'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com