title: CDB SENTINEL APEX - Phishing Sender Detection [f0e468738ef1]
id: cdb-phish-f0e468738ef1
status: production
description: Detects emails from known malicious senders
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-22
tags:
    - attack.initial_access
    - attack.t1566
logsource:
    category: email
    product: any
detection:
    selection:
        SenderAddress:
            - 'bivash@cyberdudebivash.com'
            - 'CybersecurityReports@nsa.gov'
            - 'EnergySRMA@hq.doe.gov'
            - 'PSIRT@rockwellautomation.com'
            - 'contact@cisa.dhs.gov'
            - 'chocapikk@leakix.net'
            - 'soc_team@company.com'
            - 'kingsleyobiora@gmail.com'
    condition: selection
level: high
falsepositives:
    - Spoofed sender addresses
references:
    - https://intel.cyberdudebivash.com