title: CDB SENTINEL APEX - Malicious File Hash Detection [0274d3d7d571]
id: cdb-hash-0274d3d7d571
status: production
description: >
    Auto-generated detection rule for 50 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-29
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - 'cd531ebe1014bfd18185bf21585ca5cdb16fbcb07703ebc47949a1b4e4e36bc3'
            - '421a4ad2615941b177b6ec4ab5e239c14e62af2ab07c6df1741e2a62223223c4'
            - '58e17dd61d4d55fa77c7f2dd28dd51875b0ce900c1e43b368b349e65f27d6fdd'
            - '8ee4ec425bc0d8db050d13bbff98f483fff020050d49f40c5055ca2b9f6b1c4d'
            - '9c745f95a09b37bc0486bf0f92aad4a3d5548a939c086b93d6235d34648e683f'
            - 'a7eadcf81dd6fda0dd6affefaffcb33b1d8f64ddec6e5a1772d028ef2a7da0f2'
            - 'e1fc59c7ece6e9a7fb262fc8529e3c4905503a1ca44630f9724b2ccc518d0c06'
            - 'e512d22d2bd989f35ebaccb63615434870dc0642b0f60e6d4bda0bb89adee27a'
            - '19CC41A0A056E503CC2137E19E952814FBDF14F8D83F799AEA9B96ABFF11EFBB'
            - '2F31D00FEEFE181F2D8B69033B382462FF19C35367753E6906ED80F815A7924F'
            - '325daeb781f3416a383343820064c8e98f2e31753cd71d76a886fe0dbb4fe59a'
            - '4D74F8E12FF69318BE5EB383B4E56178817E84E83D3607213160276A7328AB5D'
            - '76e4962b8ccd2e6fd6972d9c3264ccb6738ddb16066588dfcb223222aaa88f3c'
            - '7a35008a1a1ae3d093703c3a34a21993409af42eb61161aad1b6ae4afa8bbb70'
            - 'a9e9d7770ff948bb65c0db24431f75dd934a803181afa22b6b014fac9a162dab'
            - 'b287c0bc239b434b90eef01bcbd00ff48192b7cbeb540e568b8cdcdc26f90959'
            - 'ca47c8710c4ffb4908a42bd986b14cddcca39e30bb0b11ed5ca16fe8922a468b'
            - '2b99ade9224add2ce86eb836dcf70040315f6dc95e772ea98f24a30cdf4fdb97'
            - '61aca585687ec21a182342a40de3eaa12d3fc0d92577456cae0df37c3ed28e99'
            - '4b8cf2de55f6e8864a77d108e8a94a5b8e4394c6'
            - 'b2516fa466d0d851932da92ee6d0e66946db9efc'
            - 'f189116a9259950c2393f114dbcb94dde0ad864b'
            - '406127ffcb2b91b8c10e20e6c2ca787fbc1dc92d'
            - 'de5a51525a69822290eaee569a1ab447b490746d'
            - 'f7846fc0c323da8325422cab32623491757f1b88'
            - '1ad67864c0c20f167929e64c875f5c28e1aad9fd'
            - 'cf6ac48c972eaaee2af270adc3f36615325deb3e'
            - '2f06696579a1ab0cb5bbbbb6a900414a6b2e3cd1'
            - '5a12f30441d5b0b151f550daa2c5c9e8db61e2e6'
            - '49db424c8001f2f419aad85f434894d8d85c1a09'
            - 'f61896b03cc7031f51106a04566831f4ac2a0bd7'
            - '018494fa3ebb9145112e68b56fe1cb2e9f9a9ed6'
            - '90979d7c3ef7ec30b9f8aa6963a5e38d2f17d166'
            - '99ef3a63c58440d53f8e45ad861b846032fcb036'
            - '5275d008ed33203dba3f98e969ad683a65c416c3'
            - '5937d14a2c5e532fcb3ece0f45bf75e5bf18539e'
            - 'c2c60da05d5c73621d0ce7ea02770bacd79ec8b1'
            - '39ef1decde7e9766207794d396018776b33c6e45'
            - 'fc1a2864d1665bda857089e11fe9247e3c75637a'
            - 'e10a0450c7afcd9462c0b76bcbff0e7428b92bdd'
            - '397abec0d57972881a2e8dc10902d0dce9c27f42'
            - '1239288A5876C09D9F0A67BCFD645735168A7C80'
            - '3B267FA5E1D1B18411C22E97B367258986E871E5'
            - 'B66DA4280C6D72ADCC68330F6BD793DF56A853CB'
            - 'd24e4ccd6073cc75305e1d3b9c29bc8db7437e7a'
            - '667b914301aada695aab0e46d1fb3a7d5e32c8af'
            - 'ee07a74d12c0bb3594965b51d0e45b6f'
            - '4AFDC05708B8B39C82E60ABE3ACE55DB'
            - 'C7610AE28655D6C1BCE88B5D09624FEF'
            - 'E05DF8EE759E2C955ACC8D8A47A08F42'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com