title: CDB SENTINEL APEX - Network Threat Intel [03042388e06b]
id: cdb-net-03042388e06b
status: production
description: >
    Auto-generated detection rule for 56 malicious IPs and 63 malicious domains
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-17
modified: 2026-05-17
tags:
    - attack.command_and_control
    - attack.t1071
    - attack.t1090
logsource:
    category: firewall
    product: any
detection:
    selection:
        DestinationIp:
            - '5.5.0.85'
            - '20.12.5.4'
            - '20.12.6.1'
            - '20.12.6.2'
            - '20.12.7.1'
            - '20.15.4.4'
            - '20.15.5.2'
            - '20.18.2.2'
            - '20.9.9.1'
            - '26.1.1.1'
            - '104.194.152.246'
            - '140.82.6.45'
            - '144.172.111.49'
            - '144.172.88.18'
            - '144.172.99.68'
            - '149.248.78.202'
            - '149.28.96.170'
            - '207.246.114.50'
            - '45.59.122.231'
            - '45.76.241.51'
            - '46.225.231.170'
            - '64.190.113.187'
            - '64.94.85.158'
            - '87.120.186.229'
            - '96.9.125.29'
            - '11.110.0.97'
            - '11.118.0.63'
            - '11.126.0.54'
            - '11.130.0.19'
            - '11.132.0.29'
            - '11.134.0.20'
            - '11.136.0.5'
            - '11.86.0.41'
            - '147.45.178.61'
            - '149.50.97.144'
            - '179.43.185.226'
            - '146.59.32.130'
            - '147.45.50.81'
            - '148.113.222.4'
            - '157.173.126.206'
            - '173.249.41.171'
            - '173.249.50.59'
            - '176.147.144.172'
            - '191.101.59.252'
            - '194.104.94.20'
            - '2.59.183.94'
            - '213.225.14.165'
            - '35.210.61.208'
            - '4.210.91.174'
            - '41.128.181.199'
            - '46.253.45.10'
            - '5.99.196.202'
            - '62.193.106.227'
            - '77.105.132.10'
            - '77.237.238.1'
            - '80.102.218.187'
        DestinationHostname|contains:
            - 'support.industry.siemens.com'
            - 'www.siemens.com'
            - 'git-tanstack.com'
            - 'tanstack.com'
            - 'rockwellautomation.com'
            - 'artemis.apache.org'
            - 'www.universal-robots.com'
            - 'docs.metasploit.com'
            - 'cve.org'
            - 'go.recordedfuture.com'
            - 'support.sw.siemens.com'
            - 'amazonses.com'
            - 'onmicrosoft.com'
            - 'UCICasociacion.onmicrosoft.com'
            - 'getsession.org'
            - 'www.torproject.org'
            - 'x.com'
            - 'issue.net'
            - 'helper.zulipchat.com'
            - 'tutamail.com'
            - 'kaspersky.com'
            - 'gmail.com'
            - 'linuxtesting.org'
            - 'lore.kernel.org'
            - 'redhat.com'
            - 'rel-1.16.0-0-gd239552ce722-prebuilt.qemu.org'
            - 'rel-1.16.3-0-ga6ed6b701f0a-prebuilt.qemu.org'
            - 'news.sophos.com'
            - 'simple-help.com'
            - 'cpuid.com'
            - 'welcome.supp0v3.com'
            - 'apps.googleusercontent.com'
            - 'internal.com'
            - 'my.salesforce.com'
            - 'www.googleapis.com'
            - 'breakdream.com'
            - 'cmailer.pro'
            - 'dreamdie.com'
            - 'group.com'
            - 'mylingocoin.com'
            - 'supportzm.com'
            - 'zmsupport.com'
            - 'golang.org'
            - 'www.brighttalk.com'
            - 'api.cyberdudebivash.com'
            - 'blog.cyberdudebivash.com'
            - 'cyberdudebivash.com'
            - 'intel.cyberdudebivash.com'
            - 'tools.cyberdudebivash.com'
            - 'www.cyberdudebivash.com'
            - 'rapid7.com'
            - 'tp-link.com'
            - 'veracara.digicert.com'
            - 'chamd5.org'
            - 'company.com'
            - 'company.sharepoint.com'
            - 'organization.com'
            - 'organization.sharepoint.com'
            - 'blogs.juniper.net'
            - 'www.anthropic.com'
            - 'www.countercraftsec.com'
            - 'www.trendmicro.com'
            - 'nothink.org'
    condition: selection
level: medium
falsepositives:
    - Shared hosting infrastructure
    - CDN/cloud provider IP overlap
references:
    - https://intel.cyberdudebivash.com
    - https://cyberdudebivash.com/threat-intel