title: CDB SENTINEL APEX - Network Threat Intel [c52c0f8d60d7]
id: cdb-net-c52c0f8d60d7
status: production
description: >
    Auto-generated detection rule for 17 malicious IPs and 21 malicious domains
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-18
modified: 2026-04-18
tags:
    - attack.command_and_control
    - attack.t1071
    - attack.t1090
logsource:
    category: firewall
    product: any
detection:
    selection:
        DestinationIp:
            - '124.108.54.86'
            - '124.248.183.139'
            - '143.198.143.185'
            - '152.42.221.239'
            - '160.202.35.137'
            - '168.144.32.17'
            - '182.9.35.168'
            - '185.213.83.150'
            - '37.19.205.247'
            - '82.29.88.44'
            - '94.232.46.16'
            - '13.5.2.1'
            - '7.8.10.2'
            - '46.6.14.135'
            - '2.55.255.255'
            - '212.150.255.255'
            - '79.191.255.255'
        DestinationHostname|contains:
            - 'malware-traffic-analysis.net'
            - 'gmail.com'
            - 'www.brighttalk.com'
            - 'ecp.yusercontent.com'
            - 'softwaresupportsp.aveva.com'
            - 'www.aveva.com'
            - 'docs.metasploit.com'
            - 'leakix.net'
            - 'module.info'
            - 'ledger.com'
            - 'orbitalstress.net'
            - 'starkstresser.net'
            - 'zdstresser.net'
            - 'www.anviz.com'
            - 'slack.com'
            - 'vsccode-modetx.hf.space'
            - 'pdfl.io'
            - 'hornerautomation.com'
            - 'dahuawiki.com'
            - 'www.abuseipdb.com'
            - 'www.shodan.io'
    condition: selection
level: medium
falsepositives:
    - Shared hosting infrastructure
    - CDN/cloud provider IP overlap
references:
    - https://intel.cyberdudebivash.com
    - https://cyberdudebivash.com/threat-intel