title: CDB SENTINEL APEX - Phishing Sender Detection [2be00118693a]
id: cdb-phish-2be00118693a
status: production
description: Detects emails from known malicious senders
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-26
tags:
    - attack.initial_access
    - attack.t1566
logsource:
    category: email
    product: any
detection:
    selection:
        SenderAddress:
            - 'bcoles@gmail.com'
            - 'theLightCosine@metasploit.com'
            - 'bivash@cyberdudebivash.com'
            - 'ncscinfoleg@ncsc.gov.uk'
            - 'contact@cisa.dhs.gov'
            - 'CybersecurityReports@nsa.gov'
            - 'EnergySRMA@hq.doe.gov'
            - 'PSIRT@rockwellautomation.com'
    condition: selection
level: high
falsepositives:
    - Spoofed sender addresses
references:
    - https://intel.cyberdudebivash.com