title: CDB SENTINEL APEX - Malicious File Hash Detection [2128a8906d9c]
id: cdb-hash-2128a8906d9c
status: production
description: >
    Auto-generated detection rule for 12 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-27
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '1b62b7c2ed7cc296ce821f977ef7b22bae59ef1dcdb9a34ae19467ee39bcf168'
            - '97c275e3406ad6576529f41604ad138c5bdc4297d195bf61b049e14f6b30adfd'
            - '8a3946bd0a54bfb72a4d57179fcd253f2c550cd7'
            - '273fcedaee984c08197c0890f14190b86ab7e0b8'
            - '004f783b1db5ecdfad81c8fdc3b34171211112de'
            - 'a053632c41340152bf75b66b3c543d129123d8ec'
            - '9ed9f153ba4158a2ad230ee4871b25130da29ffd'
            - '13607645e14a4982468cfdbcf75c85cde63bae71'
            - 'e540d6dc04e2e6ad11907fb655f3728a13e7b939'
            - '0284a5bcf92b5a7ee015300ce3051baf7ae4718d'
            - 'e2de73280b01e5d943593dd1aa2c01c5b9112f78'
            - 'f8f4f1e02fdc64ecd4acf2d903208dd7285ad3a4'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com