title: CDB SENTINEL APEX - Network Threat Intel [567432bb2bbf]
id: cdb-net-567432bb2bbf
status: production
description: >
    Auto-generated detection rule for 29 malicious IPs and 40 malicious domains
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-25
modified: 2026-04-25
tags:
    - attack.command_and_control
    - attack.t1071
    - attack.t1090
logsource:
    category: firewall
    product: any
detection:
    selection:
        DestinationIp:
            - '1.53.114.181'
            - '104.28.160.197'
            - '114.10.99.126'
            - '124.248.183.139'
            - '130.12.182.154'
            - '157.15.40.74'
            - '202.56.2.126'
            - '209.146.60.26'
            - '49.156.40.126'
            - '83.147.12.83'
            - '4.3.2.8'
            - '9.1.08.001'
            - '172.66.171.73'
            - '38.242.246.176'
            - '69.49.241.120'
            - '124.108.54.86'
            - '143.198.143.185'
            - '152.42.221.239'
            - '160.202.35.137'
            - '168.144.32.17'
            - '182.9.35.168'
            - '185.213.83.150'
            - '37.19.205.247'
            - '82.29.88.44'
            - '147.45.178.61'
            - '1.26.0.138'
            - '198.37.119.56'
            - '198.187.29.19'
            - '1.26.0.134'
        DestinationHostname|contains:
            - 'docs.metasploit.com'
            - 'gmail.com'
            - 'metasploit.com'
            - 'api.cyberdudebivash.com'
            - 'blog.cyberdudebivash.com'
            - 'cyberdudebivash.com'
            - 'intel.cyberdudebivash.com'
            - 'tools.cyberdudebivash.com'
            - 'www.cyberdudebivash.com'
            - 'rockwellautomation.com'
            - 'www.xiongmaitech.com'
            - 'yadea.com'
            - 'getsession.org'
            - 'www.torproject.org'
            - 'x.com'
            - '0x666.info'
            - 'boomplay.com'
            - 'index.crates.io'
            - 'nuevaprodeciencia.club'
            - 'odaracani.online'
            - 'pastebin.com'
            - 'vmi3003111.contaboserver.net'
            - 'www.brighttalk.com'
            - 'beeble.com'
            - 'www.imperva.com'
            - 'www.silobreaker.com'
            - 'www.sonicwall.com'
            - 'www.kaspersky.com'
            - 'leakix.net'
            - 'module.info'
            - 'open.substack.com'
            - 'otx.alienvault.com'
            - 'cpuid.com'
            - 'welcome.supp0v3.com'
            - 'api.qpft5.com'
            - 'security.snyk.io'
            - 'www.carlsonsw.com'
            - 'api.telegram.org'
            - 'web.telegram.org'
            - 'api.trongrid.io'
    condition: selection
level: medium
falsepositives:
    - Shared hosting infrastructure
    - CDN/cloud provider IP overlap
references:
    - https://intel.cyberdudebivash.com
    - https://cyberdudebivash.com/threat-intel