title: CDB SENTINEL APEX - Phishing Sender Detection [1fd03693f73b]
id: cdb-phish-1fd03693f73b
status: production
description: Detects emails from known malicious senders
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-15
tags:
    - attack.initial_access
    - attack.t1566
logsource:
    category: email
    product: any
detection:
    selection:
        SenderAddress:
            - 'claude@users.noreply.github.com'
            - 'Morian-bot@helper.zulipchat.com'
            - 'intelreports@kaspersky.com'
            - 'ch.ups.digital@abb.com'
            - 'bivash@cyberdudebivash.com'
            - 'd912cbd7-193b-4269-9857-525bee8bbb6a@gmail.com'
            - 'e08c7f4a6882f260011909a868311c6e9b54f3e4.1639153474.git.dcaratti@redhat.com'
    condition: selection
level: high
falsepositives:
    - Spoofed sender addresses
references:
    - https://intel.cyberdudebivash.com