title: CDB SENTINEL APEX - Phishing Sender Detection [2128a8906d9c]
id: cdb-phish-2128a8906d9c
status: production
description: Detects emails from known malicious senders
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-27
tags:
    - attack.initial_access
    - attack.t1566
logsource:
    category: email
    product: any
detection:
    selection:
        SenderAddress:
            - 'bcoles@gmail.com'
            - 'theLightCosine@metasploit.com'
            - 'bivash@cyberdudebivash.com'
    condition: selection
level: high
falsepositives:
    - Spoofed sender addresses
references:
    - https://intel.cyberdudebivash.com