title: CDB SENTINEL APEX - Malicious File Hash Detection [6dacf0fc2e91]
id: cdb-hash-6dacf0fc2e91
status: production
description: >
    Auto-generated detection rule for 31 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-19
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '353ddce78d58aef2083ca0ac271af93659cf0039b0b29d0d169fc015bd3610bc'
            - '4849f76dafbef516df91fecfc23a72afffaf77ade51f805eae5ad552bed88923'
            - 'c7489e3bf546c5f2d958ac833cc7dbca4368dfba03a792849bc99c48a6b2a14f'
            - 'd9b576eb6827f38e33eda037d2cda4261307511303254a8509eeb28048433b2f'
            - '2b99ade9224add2ce86eb836dcf70040315f6dc95e772ea98f24a30cdf4fdb97'
            - '4f2b7d46148b786fae75ab511dc27b6a530f63669d4fe9908e5f22801dea9202'
            - '33dacf9f854f636216e5062ca252df8e5bed652efd78b86512f5b868b11ee70f'
            - '6a85736b64761a8b2aaeadc1c0087e1897d16cc5a9d49c6a6ea1164233bad206'
            - '70bbb38b70fd836d66e8166ec27be9aa8535b3876596fc80c45e3de4ce327980'
            - '9e3890d43366faec26523edaf91712640056ea2481cdefe2f5dfa6b2b642085d'
            - '08fd0a82cdeb0a963b7416cf57446564dfed5de5c6f66dee94b36d28bfefec9d'
            - 'cfd2e466ea5ac50f9d9267f3535a68a23e4ff62e3fe3e20a30ec52024553c564'
            - '90de84bb542adb54766fec66ee554475b7e1a56a9d8b30e3598230f9ef6d6ac7'
            - 'd85cef60cdb9e8d0f3cb3546de6ab657f9498ac7'
            - '6c0a1da746438d68f6c4ffbf9a10e873f3cf0499'
            - '404ff02c75f3cb280196fc260a63c4d26cf1a8f6'
            - '45d48d1f2e8e0d73e80bc1fd5310cb57f4547302'
            - 'c930284445ea3ff94451ccd7a57c999eca3bc979'
            - '808c87015194c51d74356854dfb10d9e'
            - 'd7a68749635604d6d7297e4fa2530eb6'
            - '66B553A8B94CE37C16F4EBC863D51FCC'
            - '107484d66423cb601f418344cd648f12'
            - '34a0f70ab100c47caaba7a5c85448e3d'
            - '7528bf597fd7764fcb7ec06512e073e0'
            - '8354223cd6198b05904337b5dff7772b'
            - '346272f0582541ae5dd08429bb4dc4ff'
            - 'A6FA4ADFC20E8E6B77E2DD631DC8FF18'
            - 'dcf5a9b27cbeedb769ccc8635d204af9'
            - 'f77c8e40dfc17be5e74d8679d5b35341'
            - 'c7c37f314ae926822d38ce089fab13e0'
            - 'db78ca341aeff5b26f2d062cc1f7c16a'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com