title: CDB SENTINEL APEX - Malicious File Hash Detection [25a3f6600d81]
id: cdb-hash-25a3f6600d81
status: production
description: >
    Auto-generated detection rule for 2 malicious file hashes
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-06-09
tags:
    - attack.execution
    - attack.t1204
    - attack.defense_evasion
logsource:
    category: file_event
    product: any
detection:
    selection:
        Hashes|contains:
            - '68e6ab3fdfc71a328b1966bad5c6aba0f7d0c2e1'
            - '40f2cc32279f0f8a51016c3c6870a2c0c808e6c0'
    condition: selection
level: critical
falsepositives:
    - Hash collision (negligible probability)
references:
    - https://intel.cyberdudebivash.com