title: CDB SENTINEL APEX - Network Threat Intel [ac4a2c87467f]
id: cdb-net-ac4a2c87467f
status: production
description: >
    Auto-generated detection rule for 34 malicious IPs and 61 malicious domains
    from CYBERDUDEBIVASH SENTINEL APEX threat intelligence feeds.
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-05-20
modified: 2026-05-20
tags:
    - attack.command_and_control
    - attack.t1071
    - attack.t1090
logsource:
    category: firewall
    product: any
detection:
    selection:
        DestinationIp:
            - '147.45.178.61'
            - '103.67.196.25'
            - '149.50.97.144'
            - '5.5.0.85'
            - '20.12.5.4'
            - '20.12.6.1'
            - '20.12.6.2'
            - '20.12.7.1'
            - '20.15.4.4'
            - '20.15.5.2'
            - '20.18.2.2'
            - '20.9.9.1'
            - '26.1.1.1'
            - '179.43.185.226'
            - '45.86.230.112'
            - '91.107.247.163'
            - '181.134.198.53'
            - '104.194.152.246'
            - '140.82.6.45'
            - '144.172.111.49'
            - '144.172.88.18'
            - '144.172.99.68'
            - '149.248.78.202'
            - '149.28.96.170'
            - '207.246.114.50'
            - '45.59.122.231'
            - '45.76.241.51'
            - '46.225.231.170'
            - '64.190.113.187'
            - '64.94.85.158'
            - '87.120.186.229'
            - '96.9.125.29'
            - '169.40.135.35'
            - '224.0.0.255'
        DestinationHostname|contains:
            - 'support.sw.siemens.com'
            - 'www.siemens.com'
            - 'issue.net'
            - 'golang.org'
            - 'cpuid.com'
            - 'welcome.supp0v3.com'
            - 'chamd5.org'
            - 'amazonses.com'
            - 'raw.githubusercontent.com'
            - 'go.recordedfuture.com'
            - 'investors.SentinelOne.com'
            - 'www.universal-robots.com'
            - 'www.brighttalk.com'
            - 'news.sophos.com'
            - 'simple-help.com'
            - 'artemis.apache.org'
            - 'helper.zulipchat.com'
            - 'tutamail.com'
            - 'kaspersky.com'
            - 'apps.googleusercontent.com'
            - 'internal.com'
            - 'my.salesforce.com'
            - 'www.googleapis.com'
            - 'gmail.com'
            - 'linuxtesting.org'
            - 'lore.kernel.org'
            - 'redhat.com'
            - 'rel-1.16.0-0-gd239552ce722-prebuilt.qemu.org'
            - 'rel-1.16.3-0-ga6ed6b701f0a-prebuilt.qemu.org'
            - 'support.industry.siemens.com'
            - 'docs.metasploit.com'
            - 'rockwellautomation.com'
            - 'breakdream.com'
            - 'cmailer.pro'
            - 'dreamdie.com'
            - 'group.com'
            - 'mylingocoin.com'
            - 'supportzm.com'
            - 'zmsupport.com'
            - 'getsession.org'
            - 'www.torproject.org'
            - 'x.com'
            - 'company.com'
            - 'company.sharepoint.com'
            - 'organization.com'
            - 'organization.sharepoint.com'
            - 'malicious-site.com'
            - 'cve.org'
            - 'tp-link.com'
            - 'veracara.digicert.com'
            - 'www.zkteco.com'
            - 'rapid7.com'
            - 'api.cyberdudebivash.com'
            - 'blog.cyberdudebivash.com'
            - 'cyberdudebivash.com'
            - 'intel.cyberdudebivash.com'
            - 'tools.cyberdudebivash.com'
            - 'www.cyberdudebivash.com'
            - 'onmicrosoft.com'
            - 'UCICasociacion.onmicrosoft.com'
            - 'nothink.org'
    condition: selection
level: medium
falsepositives:
    - Shared hosting infrastructure
    - CDN/cloud provider IP overlap
references:
    - https://intel.cyberdudebivash.com
    - https://cyberdudebivash.com/threat-intel