title: CDB SENTINEL APEX - Phishing Sender Detection [a19c18e640ad]
id: cdb-phish-a19c18e640ad
status: production
description: Detects emails from known malicious senders
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-24
tags:
    - attack.initial_access
    - attack.t1566
logsource:
    category: email
    product: any
detection:
    selection:
        SenderAddress:
            - 'CybersecurityReports@nsa.gov'
            - 'EnergySRMA@hq.doe.gov'
            - 'PSIRT@rockwellautomation.com'
            - 'contact@cisa.dhs.gov'
            - 'soc_team@company.com'
            - 'chocapikk@leakix.net'
            - 'bivash@cyberdudebivash.com'
            - 'ncscinfoleg@ncsc.gov.uk'
            - 'abuse@digitalocean.com'
    condition: selection
level: high
falsepositives:
    - Spoofed sender addresses
references:
    - https://intel.cyberdudebivash.com