title: CDB SENTINEL APEX - Phishing Sender Detection [bbfdf91c9e87]
id: cdb-phish-bbfdf91c9e87
status: production
description: Detects emails from known malicious senders
author: CyberDudeBivash SENTINEL APEX v51
date: 2026-04-21
tags:
    - attack.initial_access
    - attack.t1566
logsource:
    category: email
    product: any
detection:
    selection:
        SenderAddress:
            - 'bivash@cyberdudebivash.com'
            - 'kingsleyobiora@gmail.com'
            - 'CybersecurityReports@nsa.gov'
            - 'EnergySRMA@hq.doe.gov'
            - 'PSIRT@rockwellautomation.com'
            - 'contact@cisa.dhs.gov'
            - 'soc_team@company.com'
            - 'chocapikk@leakix.net'
            - 'cert@cirt.gov.bd'
    condition: selection
level: high
falsepositives:
    - Spoofed sender addresses
references:
    - https://intel.cyberdudebivash.com