title: CDB APEX — Network IOC Detection — CVE-2018-25198 - eToolz 3.4.8.0 Denial of Service via Buffer Overflow
id: bfb3c874-76b6-a6f4-a1fc-76b6a6f4a1fc
status: experimental
description: Detects network connections to IOCs from CVE-2018-25198 - eToolz 3.4.8.0 Denial of Service via Buffer Overflow
references:
    - https://intel.cyberdudebivash.com/
author: CyberDudeBivash SENTINEL APEX v33.0
date: 2026/03/06
tags:
    - attack.command_and_control
    - attack.unc-cdb-99
logsource:
    category: firewall
detection:
    selection_ip:
        dst_ip:
            - '3.4.8.0'
    condition: selection_ip
falsepositives:
    - Legitimate traffic to shared infrastructure
level: high