// ================================================================
// CyberDudeBivash SENTINEL APEX v20.0 — Microsoft Sentinel KQL
// Threat  : Stan Ghouls targeting Russia and Uzbekistan with NetSupport RAT
// Scenario: MALWARE | CVEs: N/A
// Generated: 2026-02-27 13:15:09 UTC
// Import into: Sentinel → Analytics → + Create → Scheduled Query
// ================================================================

// Query 3: Suspicious PowerShell
SecurityEvent | where TimeGenerated > ago(24h)
| where EventID == 4688
| where CommandLine has_any ('-EncodedCommand', '-enc', 'IEX(', 'Invoke-Expression', 'DownloadFile')
| extend ThreatName="Stan Ghouls targeting Russia and Uzbekistan with NetSupport RAT", Severity="CRITICAL"
