{
  "stix_id": "intel--9300ba9c9f88e87bce0411cc",
  "cve_id": "",
  "title": "How Infostealer Logs Became the Fuel Behind Massive Cloud Data Breaches",
  "vuln_class": "phishing",
  "sigma_rule": "title: SENTINEL APEX \u2014 How Infostealer Logs Became the Fuel Behind Massive Cloud Data Breaches\nid: 60aa127f-c74d-5962-b66a-02260818696d\nstatus: experimental\ndescription: |\n    Detects exploitation attempts related to How Infostealer Logs Became the Fuel Behind Massive Cloud Data Breaches (Web Application).\n    Generated by CYBERDUDEBIVASH SENTINEL APEX v166.2.\n    Severity: LOW | Class: PHISHING\nreferences:\n    - https://intel.cyberdudebivash.com\n    - https://nvd.nist.gov/vuln/detail/How Infostealer Logs Became the Fuel Behind Massive Cloud Data Breaches\nauthor: CYBERDUDEBIVASH SENTINEL APEX Detection Engineering\ndate: 2026/07/24\nmodified: 2026/07/24\ntags:\n    - attack.initial_access\nlogsource:\n    category: network_connection\n    product: generic\ndetection:\n    selection_email:\n        EventID: 28\n        TargetFilename|contains:\n            - '.hta'\n            - '.lnk'\n            - '.iso'\n            - '.vhd'\n            - '.docm'\n    selection_network:\n        DestinationHostname|endswith:\n            - '.xyz'\n            - '.top'\n            - '.pw'\n            - '.cc'\n        DestinationPort: 443\n    condition: selection_email or selection_network\nfalsepositives:\n    - Legitimate file downloads from CDNs\n    - Business email with ISO attachments\nlevel: low\n",
  "kql_query": "// SENTINEL APEX \u2014 Phishing Campaign Detection\n// CVE/Threat: How Infostealer Logs Became the Fuel Behind Massive Cloud Data Breaches | Generated: 2026-07-24T10:31:26Z\nlet lookback = 7d;\nlet suspicious_exts = dynamic([\".hta\", \".lnk\", \".iso\", \".vhd\", \".docm\", \".xlsm\", \".pptm\"]);\nEmailAttachmentInfo\n| where Timestamp > ago(lookback)\n| where FileName has_any (suspicious_exts)\n| join kind=leftouter (\n    EmailEvents | where Timestamp > ago(lookback)\n        | where DeliveryAction !in (\"Blocked\", \"Junked\")\n) on NetworkMessageId\n| project Timestamp, RecipientEmailAddress, SenderFromAddress, FileName,\n          Subject, DeliveryAction\n| extend Severity = \"HIGH\", ThreatType = \"Phishing\", RuleSource = \"SENTINEL-APEX\"\n| order by Timestamp desc",
  "suricata_rule": "alert http $EXTERNAL_NET any -> $HTTP_SERVERS $HTTP_PORTS (msg:\"SENTINEL-APEX How Infostealer Logs Became the Fuel Behind Massive Cloud Data Breaches Exploitation Attempt - PHISHING\"; flow:established,to_server; content:\".hta\"; nocase; http.uri; threshold:type threshold, track by_src, count 3, seconds 60; classtype:web-application-attack; sid:8129208; rev:1; metadata:created_at 2026-07-24, source SENTINEL-APEX-v166.2;)",
  "generated_at": "2026-07-24T10:31:26Z",
  "_tier": "PRO",
  "_notice": "Detection rules require PRO subscription. Subscribe at intel.cyberdudebivash.com/upgrade.html"
}