{
  "threat_id": "thr-3554b14a88e5",
  "title": "North Korean hackers linked to Axios npm supply chain compromise",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - North Korean hackers linked to Axios npm supply chain compro\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '142.11.206.73'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 142.11.206.73 any (msg:\"CDB APEX - North_Korean_hackers_linked_to\"; sid:9470784; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 142.11.206.73 any (msg:\"CDB APEX North_Korean_hackers_linked_to\"; sid:3756568; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"142.11.206.73\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"142.11.206.73\")"
  },
  "rule_count": 5
}