{
  "threat_id": "thr-8c9647a2af1c",
  "title": "Major Cyber Attacks in March 2026: OAuth Phishing,\u00a0SVG Smuggling,\u00a0Magecart, and ",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - Major Cyber Attacks in March 2026: OAuth Phishing,\u00a0SVG Smugg\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/02\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*radicado.hta*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_Major_Cyber_Attacks_in_March_2026__OAuth {\n    meta:\n        description = \"Major Cyber Attacks in March 2026: OAuth Phishing,\u00a0SVG Smugg\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"07f56ac8b5bd7cdb4c33ea5e9cd42bc7f9d3cd5504aabbb476ef010a142d7e29\" ascii nocase\n        $h1 = \"57ce6187be65c1c692a309c08457290ae74a0047304de6805dbb4feb89c0d7e5\" ascii nocase\n        $h2 = \"6a581c3b6fe7847bb327f5d76e05653a1504e51023454c41835e5dc48bc13ba4\" ascii nocase\n        $h3 = \"7d157366d74312965912a35cbba4187532cfeb3b803119a3a04c9ba0ba7d4ab0\" ascii nocase\n        $h4 = \"a6f72590792b3f26271736e5a7ba80102292546bb118cf84ff29df99341abfbe\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"radicado.hta\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"07f56ac8b5bd7cdb4c33ea5e9cd42bc7f9d3cd5504aabbb476ef010a142d7e29\",\n              \"57ce6187be65c1c692a309c08457290ae74a0047304de6805dbb4feb89c0d7e5\",\n              \"6a581c3b6fe7847bb327f5d76e05653a1504e51023454c41835e5dc48bc13ba4\",\n              \"7d157366d74312965912a35cbba4187532cfeb3b803119a3a04c9ba0ba7d4ab0\",\n              \"a6f72590792b3f26271736e5a7ba80102292546bb118cf84ff29df99341abfbe\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"radicado.hta\")"
  },
  "rule_count": 4
}