{
  "threat_id": "thr-2a348d1c907a",
  "title": "Apple urges iPhone users to update as Coruna and DarkSword exploit kits emerge",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Apple urges iPhone users to update as Coruna and DarkSword e\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/21\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*min.js*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"min.js\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"min.js\")"
  },
  "rule_count": 3
}