{
  "threat_id": "thr-704ccd292e58",
  "title": "Amazon threat intelligence teams identify Interlock ransomware campaign targetin",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Amazon threat intelligence teams identify Interlock ransomwa\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/22\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*ms-global.first*'\n            - '*sclair.it*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_Amazon_threat_intelligence_teams_identif {\n    meta:\n        description = \"Amazon threat intelligence teams identify Interlock ransomwa\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"6c8efbcef3af80a574cb2aa2224c145bb2e37c2f3d3f091571708288ceb22d5f\" ascii nocase\n        $h1 = \"d1caa376cb45b6a1eb3a45c5633c5ef75f7466b8601ed72c8022a8b3f6c1f3be\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"ms-global.first\",\n              \"sclair.it\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"6c8efbcef3af80a574cb2aa2224c145bb2e37c2f3d3f091571708288ceb22d5f\",\n              \"d1caa376cb45b6a1eb3a45c5633c5ef75f7466b8601ed72c8022a8b3f6c1f3be\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"ms-global.first\", \"sclair.it\")"
  },
  "rule_count": 4
}