{
  "threat_id": "thr-6e8c751ffa2a",
  "title": "Hackers Backdoor Telnyx Python SDK on PyPI to Steal Cloud and Dev Credentials",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - Hackers Backdoor Telnyx Python SDK on PyPI to Steal Cloud an\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '83.142.209.203'\n    selection_dns:\n        query:\n            - '*checkmarx.zone*'\n            - '*hangup.wav*'\n            - '*ringtone.wav*'\n            - '*sysmon.service*'\n            - '*tpcp.tar.gz*'\n    condition: selection_ip or selection_dns\nlevel: high",
    "suricata": [
      "alert ip any any -> 83.142.209.203 any (msg:\"CDB APEX - Hackers_Backdoor_Telnyx_Python\"; sid:2200114; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 83.142.209.203 any (msg:\"CDB APEX Hackers_Backdoor_Telnyx_Python\"; sid:5420068; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"83.142.209.203\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"checkmarx.zone\",\n              \"hangup.wav\",\n              \"ringtone.wav\",\n              \"sysmon.service\",\n              \"tpcp.tar.gz\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"83.142.209.203\")\n// OR\nDeviceNetworkEvents | where RemoteUrl has_any (\"checkmarx.zone\", \"hangup.wav\", \"ringtone.wav\", \"sysmon.service\", \"tpcp.tar.gz\")"
  },
  "rule_count": 5
}