{
  "threat_id": "thr-ac7b891a90c0",
  "title": "CVE-2026-3992 - CodeGenieApp serverless-express Users Endpoint dynamodb.ts injec",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3992 - CodeGenieApp serverless-express Users Endpoi\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/19\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*dynamodb.ts*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"dynamodb.ts\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"dynamodb.ts\")"
  },
  "rule_count": 3
}