{
  "threat_id": "thr-1546a1c05305",
  "title": "SmartApeSG campaign pushes Remcos RAT, NetSupport RAT, StealC, and Sectop RAT (A",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - SmartApeSG campaign pushes Remcos RAT, NetSupport RAT, Steal\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/27\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*361118191.pdf*'\n            - '*drag2pdf.zip*'\n            - '*finalmesh.zip*'\n            - '*isc.sans.edu*'\n            - '*malware-traffic-analysis.net*'\n            - '*post.hta*'\n    condition: selection_ip\nlevel: high",
    "yara": "rule CDB_APEX_SmartApeSG_campaign_pushes_Remcos_RAT__N {\n    meta:\n        description = \"SmartApeSG campaign pushes Remcos RAT, NetSupport RAT, Steal\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"212d8007a7ce374d38949cf54d80133bd69338131670282008940f1995d7a720\" ascii nocase\n        $h1 = \"6e26ff49387088178319e116700b123d27216d98ba3ae1ce492544cb9acd38f0\" ascii nocase\n        $h2 = \"a6a748c0606fb9600fdf04763523b7da20b382b054b875fdd1ef1c36fc16079a\" ascii nocase\n        $h3 = \"a7b9be1211c6de76bab31dbcd3a1c99861cf18e3230ea9f634e07d22c179d1ca\" ascii nocase\n        $h4 = \"c90435370728d48cba1c00d92cc3bf99e85f01aa52ecd6c6df2e8137db964796\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"361118191.pdf\",\n              \"drag2pdf.zip\",\n              \"finalmesh.zip\",\n              \"isc.sans.edu\",\n              \"malware-traffic-analysis.net\",\n              \"post.hta\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"212d8007a7ce374d38949cf54d80133bd69338131670282008940f1995d7a720\",\n              \"6e26ff49387088178319e116700b123d27216d98ba3ae1ce492544cb9acd38f0\",\n              \"a6a748c0606fb9600fdf04763523b7da20b382b054b875fdd1ef1c36fc16079a\",\n              \"a7b9be1211c6de76bab31dbcd3a1c99861cf18e3230ea9f634e07d22c179d1ca\",\n              \"c90435370728d48cba1c00d92cc3bf99e85f01aa52ecd6c6df2e8137db964796\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"361118191.pdf\", \"drag2pdf.zip\", \"finalmesh.zip\", \"isc.sans.edu\", \"malware-traffic-analysis.net\", \"post.hta\")"
  },
  "rule_count": 4
}