{
  "threat_id": "thr-93f1aef271c6",
  "title": "CVE-2026-33167 - Rails has a possible XSS vulnerability in its Action Pack debug",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-33167 - Rails has a possible XSS vulnerability in i\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/24\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '8.1.2.1'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 8.1.2.1 any (msg:\"CDB APEX \u2014 CVE_2026_33167___Rails_has_a_p\"; sid:8835245; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 8.1.2.1 any (msg:\"CDB APEX CVE_2026_33167___Rails_has_a_p\"; sid:2562590; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"8.1.2.1\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"8.1.2.1\")"
  },
  "rule_count": 5
}