{
  "threat_id": "thr-db2a89c1b394",
  "title": "CVE-2026-30839 - Wallos: SSRF via webhook test endpoint",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-30839 - Wallos: SSRF via webhook test endpoint\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/07\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*testwebhooknotifications.php*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"testwebhooknotifications.php\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"testwebhooknotifications.php\")"
  },
  "rule_count": 3
}