{
  "threat_id": "thr-5394eb634239",
  "title": "A Deep Dive into the GetProcessHandleFromHwnd API",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 A Deep Dive into the GetProcessHandleFromHwnd API\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/23\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*win32kfull.sys*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"win32kfull.sys\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"win32kfull.sys\")"
  },
  "rule_count": 3
}