{
  "threat_id": "thr-6b965932f8ad",
  "title": "CVE-2026-3644 - Incomplete control character validation in http.cookies",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3644 - Incomplete control character validation in h\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/17\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*http.cookies*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"http.cookies\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"http.cookies\")"
  },
  "rule_count": 3
}