{
  "threat_id": "thr-b3f84bbac12c",
  "title": "GhostSocks Turns Victim Systems Into Residential Proxies for Evasive Cyberattack",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - GhostSocks Turns Victim Systems Into Residential Proxies for\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/03\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*www.lbfs*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"www.lbfs\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"www.lbfs\")"
  },
  "rule_count": 3
}