{
  "threat_id": "thr-6b177b6dedc8",
  "title": "CVE-2026-4254 - Tenda AC8 HTTP Endpoint SysToolChangePwd doSystemCmd stack-based",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-4254 - Tenda AC8 HTTP Endpoint SysToolChangePwd doS\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/17\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '16.03.50.11'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 16.03.50.11 any (msg:\"CDB APEX \u2014 CVE_2026_4254___Tenda_AC8_HTTP\"; sid:1331959; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 16.03.50.11 any (msg:\"CDB APEX CVE_2026_4254___Tenda_AC8_HTTP\"; sid:4538439; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"16.03.50.11\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"16.03.50.11\")"
  },
  "rule_count": 5
}