{
  "threat_id": "thr-440cf4207093",
  "title": "CVE-2026-3994 - rui314 mold Object File input-files.cc initialize_sections heap-",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3994 - rui314 mold Object File input-files.cc initi\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/12\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*input-files.cc*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"input-files.cc\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"input-files.cc\")"
  },
  "rule_count": 3
}