{
  "threat_id": "thr-5d9ccb5e0fa4",
  "title": "CVE-2026-3964 - OpenAkita Chat API Endpoint shell.py run os command injection",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3964 - OpenAkita Chat API Endpoint shell.py run os \nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/13\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*shell.py*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"shell.py\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"shell.py\")"
  },
  "rule_count": 3
}