{
  "threat_id": "thr-d74782818e28",
  "title": "CVE-2026-4906 - Tenda AC5 POST Request WizardHandle decodePwd stack-based overfl",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - CVE-2026-4906 - Tenda AC5 POST Request WizardHandle decodePw\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/31\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '15.03.06.47'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 15.03.06.47 any (msg:\"CDB APEX - CVE_2026_4906___Tenda_AC5_POST\"; sid:9759109; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 15.03.06.47 any (msg:\"CDB APEX CVE_2026_4906___Tenda_AC5_POST\"; sid:7410895; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"15.03.06.47\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"15.03.06.47\")"
  },
  "rule_count": 5
}