{
  "threat_id": "thr-015b54b1c623",
  "title": "Schneider Electric EcoStruxure Data Center Expert",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Schneider Electric EcoStruxure Data Center Expert\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/20\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*2026-069-05.pdf*'\n            - '*download.schneider-electric.com*'\n            - '*overview.jsp*'\n            - '*www.se.com*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"2026-069-05.pdf\",\n              \"download.schneider-electric.com\",\n              \"overview.jsp\",\n              \"www.se.com\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"2026-069-05.pdf\", \"download.schneider-electric.com\", \"overview.jsp\", \"www.se.com\")"
  },
  "rule_count": 3
}