{
  "threat_id": "thr-dcfa3e81ba3d",
  "title": "Hackers Deploy BRUSHWORM and BRUSHLOGGER Against South Asian Financial Firm",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - Hackers Deploy BRUSHWORM and BRUSHLOGGER Against South Asian\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/02\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*resources.dawnnewsisl*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"resources.dawnnewsisl\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"resources.dawnnewsisl\")"
  },
  "rule_count": 3
}