{
  "threat_id": "thr-9ab7c209cfab",
  "title": "CVE-2026-25928 - OpenEMR Vulnerable to Path Traversal When Zipping DICOM Folders",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-25928 - OpenEMR Vulnerable to Path Traversal When Z\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/22\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '8.0.0.2'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 8.0.0.2 any (msg:\"CDB APEX \u2014 CVE_2026_25928___OpenEMR_Vulne\"; sid:3869534; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 8.0.0.2 any (msg:\"CDB APEX CVE_2026_25928___OpenEMR_Vulne\"; sid:9716456; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"8.0.0.2\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"8.0.0.2\")"
  },
  "rule_count": 5
}