{
  "threat_id": "thr-68fc9edd14ba",
  "title": "How to Reduce MTTR in Your SOC with Better Threat Intelligence",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 How to Reduce MTTR in Your SOC with Better Threat Intelligen\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/22\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '193.23.199.88'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 193.23.199.88 any (msg:\"CDB APEX \u2014 How_to_Reduce_MTTR_in_Your_SOC\"; sid:5790636; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 193.23.199.88 any (msg:\"CDB APEX How_to_Reduce_MTTR_in_Your_SOC\"; sid:9374523; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"193.23.199.88\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"193.23.199.88\")"
  },
  "rule_count": 5
}