{
  "threat_id": "thr-9e0c89e951fe",
  "title": "CVE-2018-25198 - eToolz 3.4.8.0 Denial of Service via Buffer Overflow",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2018-25198 - eToolz 3.4.8.0 Denial of Service via Buffer\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/07\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '3.4.8.0'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 3.4.8.0 any (msg:\"CDB APEX \u2014 CVE_2018_25198___eToolz_3_4_8_\"; sid:9766946; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 3.4.8.0 any (msg:\"CDB APEX CVE_2018_25198___eToolz_3_4_8_\"; sid:2901930; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"3.4.8.0\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"3.4.8.0\")"
  },
  "rule_count": 5
}