{
  "threat_id": "thr-8e8968f40b8e",
  "title": "CVE-2026-3789 - Bytedesk SpringAIGiteeRestController SpringAIGiteeRestService.ja",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3789 - Bytedesk SpringAIGiteeRestController SpringA\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/09\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '1.4.5.4'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 1.4.5.4 any (msg:\"CDB APEX \u2014 CVE_2026_3789___Bytedesk_Sprin\"; sid:3433934; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 1.4.5.4 any (msg:\"CDB APEX CVE_2026_3789___Bytedesk_Sprin\"; sid:1436674; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"1.4.5.4\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"1.4.5.4\")"
  },
  "rule_count": 5
}