{
  "threat_id": "thr-93f6fe3d2324",
  "title": "CVE-2026-3787 - UltraVNC Windows Service cryptbase.dll uncontrolled search path",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3787 - UltraVNC Windows Service cryptbase.dll uncon\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/09\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '1.6.4.0'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 1.6.4.0 any (msg:\"CDB APEX \u2014 CVE_2026_3787___UltraVNC_Windo\"; sid:5474239; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 1.6.4.0 any (msg:\"CDB APEX CVE_2026_3787___UltraVNC_Windo\"; sid:8728240; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"1.6.4.0\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"1.6.4.0\")"
  },
  "rule_count": 5
}