{
  "threat_id": "thr-8144dd2ab694",
  "title": "WAGO GmbH & Co. KG Industrial Managed Switches",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - WAGO GmbH & Co. KG Industrial Managed Switches\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*certvde.com*'\n            - '*wago.csaf-tp.certvde.com*'\n            - '*www.wago.com*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"certvde.com\",\n              \"wago.csaf-tp.certvde.com\",\n              \"www.wago.com\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"certvde.com\", \"wago.csaf-tp.certvde.com\", \"www.wago.com\")"
  },
  "rule_count": 3
}