{
  "threat_id": "thr-426c271ffbb4",
  "title": "CISA Urges Endpoint Management System Hardening After Cyberattack Against US Org",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CISA Urges Endpoint Management System Hardening After Cybera\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/20\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*www.stryker.com*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"www.stryker.com\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"www.stryker.com\")"
  },
  "rule_count": 3
}