{
  "threat_id": "thr-63ea57b6d325",
  "title": "CVE-2026-33155 - DeepDiff has Memory Exhaustion DoS through SAFE_TO_IMPORT",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-33155 - DeepDiff has Memory Exhaustion DoS through \nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/21\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*builtins.bytes*'\n            - '*builtins.list*'\n            - '*builtins.range*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"builtins.bytes\",\n              \"builtins.list\",\n              \"builtins.range\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"builtins.bytes\", \"builtins.list\", \"builtins.range\")"
  },
  "rule_count": 3
}