{
  "threat_id": "thr-a6b4284d0345",
  "title": "CVE-2026-3662 - Wavlink WL-NU516U1 adm.cgi usb_p910 command injection",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3662 - Wavlink WL-NU516U1 adm.cgi usb_p910 command \nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/08\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*adm.cgi*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"adm.cgi\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"adm.cgi\")"
  },
  "rule_count": 3
}