{
  "threat_id": "thr-b3893021e662",
  "title": "CVE-2026-4007 - Tenda W3 POST Parameter wifiSSIDget stack-based overflow",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-4007 - Tenda W3 POST Parameter wifiSSIDget stack-ba\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/16\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '1.0.0.3'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 1.0.0.3 any (msg:\"CDB APEX \u2014 CVE_2026_4007___Tenda_W3_POST_\"; sid:7503945; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 1.0.0.3 any (msg:\"CDB APEX CVE_2026_4007___Tenda_W3_POST_\"; sid:1140485; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"1.0.0.3\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"1.0.0.3\")"
  },
  "rule_count": 5
}