{
  "threat_id": "thr-ca0b4414d492",
  "title": "CVE-2026-33287 - LiquidJS has Exponential Memory Amplification through its repla",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - CVE-2026-33287 - LiquidJS has Exponential Memory Amplificati\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/31\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*prototype.replace*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"prototype.replace\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"prototype.replace\")"
  },
  "rule_count": 3
}