{
  "threat_id": "thr-695cdc042db6",
  "title": "CVE-2026-27811 - Roxy-WI has a Command Injection via diff parameter in config co",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-27811 - Roxy-WI has a Command Injection via diff pa\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/21\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '8.2.6.3'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 8.2.6.3 any (msg:\"CDB APEX \u2014 CVE_2026_27811___Roxy_WI_has_a\"; sid:2955745; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 8.2.6.3 any (msg:\"CDB APEX CVE_2026_27811___Roxy_WI_has_a\"; sid:9076438; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"8.2.6.3\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"8.2.6.3\")"
  },
  "rule_count": 5
}