{
  "threat_id": "thr-b1ef9b12d1a5",
  "title": "Lantronix EDS3000PS and EDS5000",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Lantronix EDS3000PS and EDS5000\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/12\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*ltrxdev.atlassian.net*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"ltrxdev.atlassian.net\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"ltrxdev.atlassian.net\")"
  },
  "rule_count": 3
}