{
  "threat_id": "thr-11c996e62e57",
  "title": "2025: The Untold Stories of Check Point Research",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 2025: The Untold Stories of Check Point Research\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/10\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*100ww.msi*'\n            - '*4sync.com*'\n            - '*join.html*'\n            - '*production.dav.indeedex.workers*'\n            - '*tax.gov.ua*'\n            - '*web.core.windows.net*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_2025__The_Untold_Stories_of_Check_Point_ {\n    meta:\n        description = \"2025: The Untold Stories of Check Point Research\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"1f3bd755de24e00af2dba61f938637d1cc0fbfd6166dba014e665033ad4445c0\" ascii nocase\n        $h1 = \"262a1003a2cd04993b29e687686eba573d6202fea8611c437ecbd6312802677a\" ascii nocase\n        $h2 = \"549df969dc5b340b4fc850584a01c767ca8a1bd712f16210f164f85e26c3e58b\" ascii nocase\n        $h3 = \"6eb7dbf27a25639c7f11c05fd88ea2a301e0ca93d3c3bdee1eb5917fc60a56ff\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"100ww.msi\",\n              \"4sync.com\",\n              \"join.html\",\n              \"production.dav.indeedex.workers\",\n              \"tax.gov.ua\",\n              \"web.core.windows.net\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"1f3bd755de24e00af2dba61f938637d1cc0fbfd6166dba014e665033ad4445c0\",\n              \"262a1003a2cd04993b29e687686eba573d6202fea8611c437ecbd6312802677a\",\n              \"549df969dc5b340b4fc850584a01c767ca8a1bd712f16210f164f85e26c3e58b\",\n              \"6eb7dbf27a25639c7f11c05fd88ea2a301e0ca93d3c3bdee1eb5917fc60a56ff\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"100ww.msi\", \"4sync.com\", \"join.html\", \"production.dav.indeedex.workers\", \"tax.gov.ua\", \"web.core.windows.net\")"
  },
  "rule_count": 4
}