{
  "threat_id": "thr-5af40073e6f2",
  "title": "Google links Axios npm supply chain attack to North Korea-linked APT UNC1069",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - Google links Axios npm supply chain attack to North Korea-li\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/03\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '142.11.206.73'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 142.11.206.73 any (msg:\"CDB APEX - Google_links_Axios_npm_supply_\"; sid:3899980; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 142.11.206.73 any (msg:\"CDB APEX Google_links_Axios_npm_supply_\"; sid:5794177; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"142.11.206.73\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"142.11.206.73\")"
  },
  "rule_count": 5
}