{
  "threat_id": "thr-183a1286ee75",
  "title": "CVE-2026-3888: Ubuntu Desktop 24.04+ vulnerable to Root exploit",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3888: Ubuntu Desktop 24.04+ vulnerable to Root expl\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/19\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*cron.daily*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"cron.daily\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"cron.daily\")"
  },
  "rule_count": 3
}