{
  "threat_id": "thr-2dad9fb1d688",
  "title": "Ceragon Siklu MultiHaul and EtherHaul Series",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Ceragon Siklu MultiHaul and EtherHaul Series\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/15\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*portal.ceragon.com*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"portal.ceragon.com\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"portal.ceragon.com\")"
  },
  "rule_count": 3
}