{
  "threat_id": "thr-9b213418b7df",
  "title": "CVE-2026-5249 - gougucms Record Endpoint record.html cross site scripting",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - CVE-2026-5249 - gougucms Record Endpoint record.html cross s\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/03\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*value.content*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"value.content\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"value.content\")"
  },
  "rule_count": 3
}