{
  "threat_id": "thr-ddef82cf69f2",
  "title": "Telnyx PyPI Package With 742,000 downloads Compromised in TeamPCP Supply Chain A",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - Telnyx PyPI Package With 742,000 downloads Compromised in Te\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*hangup.wav*'\n            - '*ringtone.wav*'\n            - '*sys.executable*'\n            - '*tpcp.tar.gz*'\n            - '*w.getnframes*'\n            - '*w.readframes*'\n            - '*wave.open*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_Telnyx_PyPI_Package_With_742_000_downloa {\n    meta:\n        description = \"Telnyx PyPI Package With 742,000 downloads Compromised in Te\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"7321caa303fe96ded0492c747d2f353c4f7d17185656fe292ab0a59e2bd0b8d9\" ascii nocase\n        $h1 = \"cd08115806662469bbedec4b03f8427b97c8a4b3bc1442dc18b72b4e19395fe3\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"hangup.wav\",\n              \"ringtone.wav\",\n              \"sys.executable\",\n              \"tpcp.tar.gz\",\n              \"w.getnframes\",\n              \"w.readframes\",\n              \"wave.open\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"7321caa303fe96ded0492c747d2f353c4f7d17185656fe292ab0a59e2bd0b8d9\",\n              \"cd08115806662469bbedec4b03f8427b97c8a4b3bc1442dc18b72b4e19395fe3\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"hangup.wav\", \"ringtone.wav\", \"sys.executable\", \"tpcp.tar.gz\", \"w.getnframes\", \"w.readframes\", \"wave.open\")"
  },
  "rule_count": 4
}