{
  "threat_id": "thr-2c128c70a7d1",
  "title": "CVE-2017-20222 - Telesquare SKT LTE Router SDT-CS3B1 Unauthenticated Remote Rebo",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2017-20222 - Telesquare SKT LTE Router SDT-CS3B1 Unauthe\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/16\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*lte.cgi*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"lte.cgi\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"lte.cgi\")"
  },
  "rule_count": 3
}