{
  "threat_id": "thr-26e75d220ff8",
  "title": "snap-confine + systemd-tmpfiles = root (CVE-2026-3888)",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - snap-confine + systemd-tmpfiles = root (CVE-2026-3888)\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/31\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*cron.daily*'\n            - '*ld.so.preload*'\n            - '*lib.exchange*'\n            - '*linux-gnu.exchange*'\n            - '*seclists.org*'\n            - '*session-145.scope*'\n            - '*session-33.scope*'\n            - '*snap.firefox.hook.configure*'\n            - '*snap.snap-store.hook.configure*'\n            - '*snap.snap-store.user*'\n            - '*snap.whatever*'\n            - '*snap.whatever.scope*'\n            - '*user-1001.slice*'\n            - '*user.slice*'\n            - '*x-snapd.origin*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"cron.daily\",\n              \"ld.so.preload\",\n              \"lib.exchange\",\n              \"linux-gnu.exchange\",\n              \"seclists.org\",\n              \"session-145.scope\",\n              \"session-33.scope\",\n              \"snap.firefox.hook.configure\",\n              \"snap.snap-store.hook.configure\",\n              \"snap.snap-store.user\",\n              \"snap.whatever\",\n              \"snap.whatever.scope\",\n              \"user-1001.slice\",\n              \"user.slice\",\n              \"x-snapd.origin\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"cron.daily\", \"ld.so.preload\", \"lib.exchange\", \"linux-gnu.exchange\", \"seclists.org\", \"session-145.scope\", \"session-33.scope\", \"snap.firefox.hook.configure\", \"snap.snap-store.hook.configure\", \"snap.snap-store.user\")"
  },
  "rule_count": 3
}