{
  "threat_id": "thr-985df41213b7",
  "title": "The Proliferation of DarkSword: iOS Exploit Chain Adopted by Multiple Threat Act",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 The Proliferation of DarkSword: iOS Exploit Chain Adopted by\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/21\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*6cde159c.js*'\n            - '*a9bc5c66.js*'\n            - '*document.body*'\n            - '*document.write*'\n            - '*e5.malaymoil*'\n            - '*file.includes*'\n            - '*frame.src*'\n            - '*frame.style.border*'\n            - '*frame.style.height*'\n            - '*frame.style.left*'\n            - '*frame.style.opacity*'\n            - '*frame.style.position*'\n            - '*frame.style.width*'\n            - '*iframe.src*'\n            - '*iframe.style.border*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_The_Proliferation_of_DarkSword__iOS_Expl {\n    meta:\n        description = \"The Proliferation of DarkSword: iOS Exploit Chain Adopted by\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"2e5a56beb63f21d9347310412ae6efb29fd3db2d3a3fc0798865a29a3c578d35\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"6cde159c.js\",\n              \"a9bc5c66.js\",\n              \"document.body\",\n              \"document.write\",\n              \"e5.malaymoil\",\n              \"file.includes\",\n              \"frame.src\",\n              \"frame.style.border\",\n              \"frame.style.height\",\n              \"frame.style.left\",\n              \"frame.style.opacity\",\n              \"frame.style.position\",\n              \"frame.style.width\",\n              \"iframe.src\",\n              \"iframe.style.border\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"2e5a56beb63f21d9347310412ae6efb29fd3db2d3a3fc0798865a29a3c578d35\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"6cde159c.js\", \"a9bc5c66.js\", \"document.body\", \"document.write\", \"e5.malaymoil\", \"file.includes\", \"frame.src\", \"frame.style.border\", \"frame.style.height\", \"frame.style.left\")"
  },
  "rule_count": 4
}