{
  "threat_id": "thr-243d7269b6e9",
  "title": "CVE-2026-5004 - Wavlink WL-WN579X3-C UPNP firewall.cgi sub_4019FC stack-based ov",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - CVE-2026-5004 - Wavlink WL-WN579X3-C UPNP firewall.cgi sub_4\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/30\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*firewall.cgi*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"firewall.cgi\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"firewall.cgi\")"
  },
  "rule_count": 3
}