{
  "threat_id": "thr-d208adfae97c",
  "title": "TeamPCP Supply Chain Campaign: Update 002 - Telnyx PyPI Compromise, Vect Ransomw",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - TeamPCP Supply Chain Campaign: Update 002 - Telnyx PyPI Comp\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*crates.io*'\n            - '*isc.sans.edu*'\n            - '*kubernetes.io*'\n            - '*models.litellm.cloud*'\n            - '*sans.org*'\n            - '*scan.aquasecurtiy*'\n            - '*tpcp.tar.gz*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"crates.io\",\n              \"isc.sans.edu\",\n              \"kubernetes.io\",\n              \"models.litellm.cloud\",\n              \"sans.org\",\n              \"scan.aquasecurtiy\",\n              \"tpcp.tar.gz\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"crates.io\", \"isc.sans.edu\", \"kubernetes.io\", \"models.litellm.cloud\", \"sans.org\", \"scan.aquasecurtiy\", \"tpcp.tar.gz\")"
  },
  "rule_count": 3
}