{
  "threat_id": "thr-0c805cf85495",
  "title": "How to manage the lifecycle of Amazon Machine Images using AMI Lineage for AWS",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 How to manage the lifecycle of Amazon Machine Images using A\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/19\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*amazonaws.com*'\n            - '*cleanup-child-account-resources.sh*'\n            - '*cleanup-organization-resources.sh*'\n            - '*cleanup-shared-resources.sh*'\n            - '*deploy-child-account-resources.sh*'\n            - '*deploy-organization-resources.sh*'\n            - '*deploy-shared-resources.sh*'\n            - '*ec2.amazonaws.com*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"amazonaws.com\",\n              \"cleanup-child-account-resources.sh\",\n              \"cleanup-organization-resources.sh\",\n              \"cleanup-shared-resources.sh\",\n              \"deploy-child-account-resources.sh\",\n              \"deploy-organization-resources.sh\",\n              \"deploy-shared-resources.sh\",\n              \"ec2.amazonaws.com\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"amazonaws.com\", \"cleanup-child-account-resources.sh\", \"cleanup-organization-resources.sh\", \"cleanup-shared-resources.sh\", \"deploy-child-account-resources.sh\", \"deploy-organization-resources.sh\", \"deploy-shared-resources.sh\", \"ec2.amazonaws.com\")"
  },
  "rule_count": 3
}