{
  "threat_id": "thr-c4657f28be43",
  "title": "ClickFix Campaigns Targeting Windows and macOS",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - ClickFix Campaigns Targeting Windows and macOS\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/28\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*birdeye.com*'\n            - '*ned.coveney*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_ClickFix_Campaigns_Targeting_Windows_and {\n    meta:\n        description = \"ClickFix Campaigns Targeting Windows and macOS\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"397dcea810f733494dbe307c91286d08f87f64aebbee787706fe6561ed3e20f8\" ascii nocase\n        $h1 = \"43907e54cf3d1258f695d1112759b5457576481072cc76a679b8477cfeb3db87\" ascii nocase\n        $h2 = \"5d821db386c7c879caeabf3e9f94c94a48eec6ec5a3a0efbae9d69da3f52c1db\" ascii nocase\n        $h3 = \"b17c3e4058aacdcc36b18858d128d6b3058e0ea607a4dc59eb95b18b7c6acc7c\" ascii nocase\n        $h4 = \"c0af6e9d848ada3839811bf33eeb982e6c207e4c40010418e0185283cd5cff50\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"birdeye.com\",\n              \"ned.coveney\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"397dcea810f733494dbe307c91286d08f87f64aebbee787706fe6561ed3e20f8\",\n              \"43907e54cf3d1258f695d1112759b5457576481072cc76a679b8477cfeb3db87\",\n              \"5d821db386c7c879caeabf3e9f94c94a48eec6ec5a3a0efbae9d69da3f52c1db\",\n              \"b17c3e4058aacdcc36b18858d128d6b3058e0ea607a4dc59eb95b18b7c6acc7c\",\n              \"c0af6e9d848ada3839811bf33eeb982e6c207e4c40010418e0185283cd5cff50\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"birdeye.com\", \"ned.coveney\")"
  },
  "rule_count": 4
}