{
  "threat_id": "thr-fc07ba3885d4",
  "title": "CVE-2026-5251 - z-9527 admin User Update Endpoint user.js dynamically-determined",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - CVE-2026-5251 - z-9527 admin User Update Endpoint user.js dy\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*user.js*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"user.js\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"user.js\")"
  },
  "rule_count": 3
}