{
  "threat_id": "thr-d33cab384ec1",
  "title": "Cisco flags ongoing exploitation of two recently patched Catalyst SD-WAN flaws",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Cisco flags ongoing exploitation of two recently patched Cat\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/07\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '20.12.5.3'\n            - '20.12.6.1'\n            - '20.15.4.2'\n            - '20.18.2.1'\n            - '20.9.8.2'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 20.12.5.3 any (msg:\"CDB APEX \u2014 Cisco_flags_ongoing_exploitati\"; sid:7634921; rev:1;)",
      "alert ip any any -> 20.12.6.1 any (msg:\"CDB APEX \u2014 Cisco_flags_ongoing_exploitati\"; sid:1944177; rev:1;)",
      "alert ip any any -> 20.15.4.2 any (msg:\"CDB APEX \u2014 Cisco_flags_ongoing_exploitati\"; sid:8574104; rev:1;)",
      "alert ip any any -> 20.18.2.1 any (msg:\"CDB APEX \u2014 Cisco_flags_ongoing_exploitati\"; sid:3151844; rev:1;)",
      "alert ip any any -> 20.9.8.2 any (msg:\"CDB APEX \u2014 Cisco_flags_ongoing_exploitati\"; sid:1554596; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 20.12.5.3 any (msg:\"CDB APEX Cisco_flags_ongoing_exploitati\"; sid:3106693; rev:1;)",
      "alert ip any any -> 20.12.6.1 any (msg:\"CDB APEX Cisco_flags_ongoing_exploitati\"; sid:8882354; rev:1;)",
      "alert ip any any -> 20.15.4.2 any (msg:\"CDB APEX Cisco_flags_ongoing_exploitati\"; sid:1308656; rev:1;)",
      "alert ip any any -> 20.18.2.1 any (msg:\"CDB APEX Cisco_flags_ongoing_exploitati\"; sid:6759464; rev:1;)",
      "alert ip any any -> 20.9.8.2 any (msg:\"CDB APEX Cisco_flags_ongoing_exploitati\"; sid:7766515; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"20.12.5.3\",\n              \"20.12.6.1\",\n              \"20.15.4.2\",\n              \"20.18.2.1\",\n              \"20.9.8.2\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"20.12.5.3\", \"20.12.6.1\", \"20.15.4.2\", \"20.18.2.1\", \"20.9.8.2\")"
  },
  "rule_count": 13
}