{
  "threat_id": "thr-9b098af95553",
  "title": "BPFdoor in Telecom Networks: Sleeper Cells in the Backbone",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - BPFdoor in Telecom Networks: Sleeper Cells in the Backbone\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*containerd.sock*'\n            - '*hpasmlited.pid*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"containerd.sock\",\n              \"hpasmlited.pid\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"containerd.sock\", \"hpasmlited.pid\")"
  },
  "rule_count": 3
}