{
  "threat_id": "thr-a31aa33df3b5",
  "title": "Coruna: The Mysterious Journey of a Powerful iOS Exploit Kit",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Coruna: The Mysterious Journey of a Powerful iOS Exploit Kit\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/16\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*2s3b3rknfqtwwpo.xyz*'\n            - '*6zvjeulzaw5c0mv.xyz*'\n            - '*8fn4957c5g986jp.xyz*'\n            - '*app.phantom*'\n            - '*b38w09ecdejfqsf.xyz*'\n            - '*cdn.uacounter*'\n            - '*coin98.crypto.finance.insights*'\n            - '*com.bitkeep.os*'\n            - '*com.bitpie.wallet*'\n            - '*com.global.wallet.ios*'\n            - '*com.jbig.tonkeeper*'\n            - '*com.kyrd.krystal.ios*'\n            - '*com.plasma*'\n            - '*com.plasma.appruntime.appdiscovery*'\n            - '*com.plasma.appruntime.downloadmanager*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_Coruna__The_Mysterious_Journey_of_a_Powe {\n    meta:\n        description = \"Coruna: The Mysterious Journey of a Powerful iOS Exploit Kit\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"023e5fb71923cfa2088b9a48ad8566ff7ac92a99630add0629a5edf4679888de\" ascii nocase\n        $h1 = \"05b5e4070b3b8a130b12ea96c5526b4615fcae121bb802b1a10c3a7a70f39901\" ascii nocase\n        $h2 = \"0dff17e3aa12c4928273c70a2e0a6fff25d3e43c0d1b71056abad34a22b03495\" ascii nocase\n        $h3 = \"10bd8f2f8bb9595664bb9160fbc4136f1d796cb5705c551f7ab8b9b1e658085c\" ascii nocase\n        $h4 = \"18394fcc096344e0730e49a0098970b1c53c137f679cff5c7ff8902e651cd8a3\" ascii nocase\n        $h5 = \"1fb9dedf1de81d387eff4bd5e747f730dd03c440157a66f20fdb5e95f64318c0\" ascii nocase\n        $h6 = \"25a9b004cf61fb251c8d4024a8c7383a86cb30f60aa7d59ca53ce9460fcfb7de\" ascii nocase\n        $h7 = \"2a9d21ca07244932939c6c58699448f2147992c1f49cd3bc7d067bd92cb54f3a\" ascii nocase\n        $h8 = \"3c297829353778857edfeaed3ceeeca1bf8b60534f1979f7d442a0b03c56e541\" ascii nocase\n        $h9 = \"42cc02cecd65f22a3658354c5a5efa6a6ec3d716c7fbbcd12df1d1b077d2591b\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"2s3b3rknfqtwwpo.xyz\",\n              \"6zvjeulzaw5c0mv.xyz\",\n              \"8fn4957c5g986jp.xyz\",\n              \"app.phantom\",\n              \"b38w09ecdejfqsf.xyz\",\n              \"cdn.uacounter\",\n              \"coin98.crypto.finance.insights\",\n              \"com.bitkeep.os\",\n              \"com.bitpie.wallet\",\n              \"com.global.wallet.ios\",\n              \"com.jbig.tonkeeper\",\n              \"com.kyrd.krystal.ios\",\n              \"com.plasma\",\n              \"com.plasma.appruntime.appdiscovery\",\n              \"com.plasma.appruntime.downloadmanager\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"023e5fb71923cfa2088b9a48ad8566ff7ac92a99630add0629a5edf4679888de\",\n              \"05b5e4070b3b8a130b12ea96c5526b4615fcae121bb802b1a10c3a7a70f39901\",\n              \"0dff17e3aa12c4928273c70a2e0a6fff25d3e43c0d1b71056abad34a22b03495\",\n              \"10bd8f2f8bb9595664bb9160fbc4136f1d796cb5705c551f7ab8b9b1e658085c\",\n              \"18394fcc096344e0730e49a0098970b1c53c137f679cff5c7ff8902e651cd8a3\",\n              \"1fb9dedf1de81d387eff4bd5e747f730dd03c440157a66f20fdb5e95f64318c0\",\n              \"25a9b004cf61fb251c8d4024a8c7383a86cb30f60aa7d59ca53ce9460fcfb7de\",\n              \"2a9d21ca07244932939c6c58699448f2147992c1f49cd3bc7d067bd92cb54f3a\",\n              \"3c297829353778857edfeaed3ceeeca1bf8b60534f1979f7d442a0b03c56e541\",\n              \"42cc02cecd65f22a3658354c5a5efa6a6ec3d716c7fbbcd12df1d1b077d2591b\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"2s3b3rknfqtwwpo.xyz\", \"6zvjeulzaw5c0mv.xyz\", \"8fn4957c5g986jp.xyz\", \"app.phantom\", \"b38w09ecdejfqsf.xyz\", \"cdn.uacounter\", \"coin98.crypto.finance.insights\", \"com.bitkeep.os\", \"com.bitpie.wallet\", \"com.global.wallet.ios\")"
  },
  "rule_count": 4
}