{
  "threat_id": "thr-47fe770adb11",
  "title": "That \u201cjob brief\u201d on Google Forms could infect your device",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 That \u201cjob brief\u201d on Google Forms could infect your device\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/23\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '207.148.66.14'\n    selection_dns:\n        query:\n            - '*2026.zip*'\n            - '*dl.dropbox*'\n            - '*filedn.com*'\n            - '*final.zip*'\n            - '*fshare.vn*'\n            - '*goo.su*'\n            - '*pdf.rar*'\n            - '*tr.ee*'\n            - '*www.fshare*'\n    condition: selection_ip or selection_ip\nlevel: high",
    "yara": "rule CDB_APEX_That__job_brief__on_Google_Forms_could_i {\n    meta:\n        description = \"That \u201cjob brief\u201d on Google Forms could infect your device\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"1d533963b9148b2671f71d3bee44d8332e429aa9c99eb20063ab9af90901bd4d\" ascii nocase\n        $h1 = \"258adaed24ac6a25000c9c1240bf6834482ef62c22b413614856b8973e11a79f\" ascii nocase\n        $h2 = \"481360f518d076fc0acb671dc10e954e2c3ae7286278dfe0518da39770484e62\" ascii nocase\n        $h3 = \"4957b08665ddbb6a2d7f81bf1d96d252c4d8c1963de228567d6d4c73858803a4\" ascii nocase\n        $h4 = \"59362a21e8266e91f535a2c94f3501c33f97dce0be52c64237eb91150eee33e3\" ascii nocase\n        $h5 = \"7f9225a752da4df4ee4066d7937fe169ca9f28ecddffd76aa5151fb72a57d54b\" ascii nocase\n        $h6 = \"83ce196489a2b2d18a8b17cd36818f7538128ed08ca230a92d6ee688cf143a6c\" ascii nocase\n        $h7 = \"85c07d2935d6626fb96915da177a71d41f3d3a35f7c4b55e5737f64541618d37\" ascii nocase\n        $h8 = \"8d6bc4e1d0c469022947575cbdb2c5dd22d69f092e696f0693a84bc7df5ae5e0\" ascii nocase\n        $h9 = \"a92f553c2d430e2f4114cfadc8e3a468e78bdadc7d8fc5112841c0fdb2009b2a\" ascii nocase\n    condition:\n        any of them\n}",
    "suricata": [
      "alert ip any any -> 207.148.66.14 any (msg:\"CDB APEX \u2014 That__job_brief__on_Google_For\"; sid:6104381; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 207.148.66.14 any (msg:\"CDB APEX That__job_brief__on_Google_For\"; sid:4138591; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"207.148.66.14\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"2026.zip\",\n              \"dl.dropbox\",\n              \"filedn.com\",\n              \"final.zip\",\n              \"fshare.vn\",\n              \"goo.su\",\n              \"pdf.rar\",\n              \"tr.ee\",\n              \"www.fshare\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"1d533963b9148b2671f71d3bee44d8332e429aa9c99eb20063ab9af90901bd4d\",\n              \"258adaed24ac6a25000c9c1240bf6834482ef62c22b413614856b8973e11a79f\",\n              \"481360f518d076fc0acb671dc10e954e2c3ae7286278dfe0518da39770484e62\",\n              \"4957b08665ddbb6a2d7f81bf1d96d252c4d8c1963de228567d6d4c73858803a4\",\n              \"59362a21e8266e91f535a2c94f3501c33f97dce0be52c64237eb91150eee33e3\",\n              \"7f9225a752da4df4ee4066d7937fe169ca9f28ecddffd76aa5151fb72a57d54b\",\n              \"83ce196489a2b2d18a8b17cd36818f7538128ed08ca230a92d6ee688cf143a6c\",\n              \"85c07d2935d6626fb96915da177a71d41f3d3a35f7c4b55e5737f64541618d37\",\n              \"8d6bc4e1d0c469022947575cbdb2c5dd22d69f092e696f0693a84bc7df5ae5e0\",\n              \"a92f553c2d430e2f4114cfadc8e3a468e78bdadc7d8fc5112841c0fdb2009b2a\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"207.148.66.14\")\n// OR\nDeviceNetworkEvents | where RemoteUrl has_any (\"2026.zip\", \"dl.dropbox\", \"filedn.com\", \"final.zip\", \"fshare.vn\", \"goo.su\", \"pdf.rar\", \"tr.ee\", \"www.fshare\")"
  },
  "rule_count": 6
}