{
  "threat_id": "thr-90b71fee9c46",
  "title": "CVE-2026-33168 - Rails has a possible XSS vulnerability in its Action View tag h",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-33168 - Rails has a possible XSS vulnerability in i\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/24\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '7.2.3.1'\n            - '8.0.4.1'\n            - '8.1.2.1'\n    condition: selection_ip\nlevel: high",
    "suricata": [
      "alert ip any any -> 7.2.3.1 any (msg:\"CDB APEX \u2014 CVE_2026_33168___Rails_has_a_p\"; sid:3891952; rev:1;)",
      "alert ip any any -> 8.0.4.1 any (msg:\"CDB APEX \u2014 CVE_2026_33168___Rails_has_a_p\"; sid:8903110; rev:1;)",
      "alert ip any any -> 8.1.2.1 any (msg:\"CDB APEX \u2014 CVE_2026_33168___Rails_has_a_p\"; sid:2301499; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 7.2.3.1 any (msg:\"CDB APEX CVE_2026_33168___Rails_has_a_p\"; sid:8262549; rev:1;)",
      "alert ip any any -> 8.0.4.1 any (msg:\"CDB APEX CVE_2026_33168___Rails_has_a_p\"; sid:9122041; rev:1;)",
      "alert ip any any -> 8.1.2.1 any (msg:\"CDB APEX CVE_2026_33168___Rails_has_a_p\"; sid:5274156; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"7.2.3.1\",\n              \"8.0.4.1\",\n              \"8.1.2.1\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"7.2.3.1\", \"8.0.4.1\", \"8.1.2.1\")"
  },
  "rule_count": 9
}