{
  "threat_id": "thr-8605fb91943b",
  "title": "CVE-2026-32760 - File Browser Self Registration Grants Any User Admin Access Whe",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-32760 - File Browser Self Registration Grants Any U\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/21\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*defaults.perm.admin*'\n            - '*perm.admin*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"defaults.perm.admin\",\n              \"perm.admin\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"defaults.perm.admin\", \"perm.admin\")"
  },
  "rule_count": 3
}