{
  "threat_id": "thr-8403ce713326",
  "title": "A laughing RAT: CrystalX combines spyware, stealer, and prankware features",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - A laughing RAT: CrystalX combines spyware, stealer, and pran\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/04\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*content.js*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"content.js\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"content.js\")"
  },
  "rule_count": 3
}