{
  "threat_id": "thr-e5311cb47db3",
  "title": "Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 Building a Native Windows Expos",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Official Launch: CYBERDUDEBIVASH\u00ae CyberTwin v1.0 Building a \nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/20\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*cyberdudebivash.gumroad.com*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"cyberdudebivash.gumroad.com\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"cyberdudebivash.gumroad.com\")"
  },
  "rule_count": 3
}