{
  "threat_id": "thr-54d90495b2a4",
  "title": "Exposing the Undercurrent: Disrupting the GRIDTIDE Global Cyber Espionage Campai",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Exposing the Undercurrent: Disrupting the GRIDTIDE Global Cy\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/20\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*amp.tar.gz*'\n            - '*apt.tar.gz*'\n            - '*pmp.cfg*'\n            - '*principal.process.file*'\n            - '*target.file*'\n            - '*target.process.file*'\n            - '*target.url*'\n            - '*update.tar*'\n            - '*update.tar.gz*'\n            - '*xapt.cfg*'\n            - '*xapt.service*'\n    condition: selection_ip\nlevel: high",
    "yara": "rule CDB_APEX_Exposing_the_Undercurrent__Disrupting_th {\n    meta:\n        description = \"Exposing the Undercurrent: Disrupting the GRIDTIDE Global Cy\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"01fc3bd5a78cd59255a867ffb3dfdd6e0b7713ee90098ea96cc01c640c6495eb\" ascii nocase\n        $h1 = \"4eb994b816a1a24cf97bfd7551d00fe14b810859170dbf15180d39e05cd7c0f9\" ascii nocase\n        $h2 = \"669917bad46a57e5f2de037f8ec200a44fb579d723af3e2f1be1e8479a267966\" ascii nocase\n        $h3 = \"ce36a5fc44cbd7de947130b67be9e732a7b4086fb1df98a5afd724087c973b47\" ascii nocase\n        $h4 = \"d25024ccea8eac85a9522289cfb709f2ed4e20176dd37855bacc2cd75c995606\" ascii nocase\n        $h5 = \"eb08c840f4c95e2fa5eff05e5f922f86c766f5368a63476f046b2b9dbffc2033\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"amp.tar.gz\",\n              \"apt.tar.gz\",\n              \"pmp.cfg\",\n              \"principal.process.file\",\n              \"target.file\",\n              \"target.process.file\",\n              \"target.url\",\n              \"update.tar\",\n              \"update.tar.gz\",\n              \"xapt.cfg\",\n              \"xapt.service\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"01fc3bd5a78cd59255a867ffb3dfdd6e0b7713ee90098ea96cc01c640c6495eb\",\n              \"4eb994b816a1a24cf97bfd7551d00fe14b810859170dbf15180d39e05cd7c0f9\",\n              \"669917bad46a57e5f2de037f8ec200a44fb579d723af3e2f1be1e8479a267966\",\n              \"ce36a5fc44cbd7de947130b67be9e732a7b4086fb1df98a5afd724087c973b47\",\n              \"d25024ccea8eac85a9522289cfb709f2ed4e20176dd37855bacc2cd75c995606\",\n              \"eb08c840f4c95e2fa5eff05e5f922f86c766f5368a63476f046b2b9dbffc2033\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"amp.tar.gz\", \"apt.tar.gz\", \"pmp.cfg\", \"principal.process.file\", \"target.file\", \"target.process.file\", \"target.url\", \"update.tar\", \"update.tar.gz\", \"xapt.cfg\")"
  },
  "rule_count": 4
}