{
  "threat_id": "thr-766f1b160168",
  "title": "Kamasers\u00a0Analysis: A Multi-Vector DDoS Botnet Targeting Organizations Worldwide",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Kamasers\u00a0Analysis: A Multi-Vector DDoS Botnet Targeting Orga\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/27\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*api.etherscan.io*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_Kamasers_Analysis__A_Multi_Vector_DDoS_B {\n    meta:\n        description = \"Kamasers\u00a0Analysis: A Multi-Vector DDoS Botnet Targeting Orga\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"071a1960fbd7114ca87d9da138908722d7f1c02af90ea2db1963915fbe234c52\" ascii nocase\n        $h1 = \"Dd305f7f1131898c736c97f43c6729bf57d3980fc269400d23412a282ee71a9a\" ascii nocase\n        $h2 = \"F6c6e16a392be4dbf9a3cf1085b4ffc005b0931fc8eeb5fedf1c7561b2e5ad6b\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"api.etherscan.io\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"071a1960fbd7114ca87d9da138908722d7f1c02af90ea2db1963915fbe234c52\",\n              \"Dd305f7f1131898c736c97f43c6729bf57d3980fc269400d23412a282ee71a9a\",\n              \"F6c6e16a392be4dbf9a3cf1085b4ffc005b0931fc8eeb5fedf1c7561b2e5ad6b\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"api.etherscan.io\")"
  },
  "rule_count": 4
}