{
  "threat_id": "thr-e929c1692aab",
  "title": "DShield (Cowrie) Honeypot Stats and When Sessions Disconnect, (Mon, Mar 30th)",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - DShield (Cowrie) Honeypot Stats and When Sessions Disconnect\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*commands.command*'\n            - '*commands.session*'\n            - '*containerd.io*'\n            - '*cowrie.zip*'\n            - '*docker.asc*'\n            - '*docker.list*'\n            - '*docs.cowrie.org*'\n            - '*download.docker.com*'\n            - '*isc.sans.edu*'\n            - '*sessions.session*'\n            - '*shstrtab.text*'\n            - '*sources.list*'\n            - '*userdb.example*'\n            - '*www.dshield.org*'\n    condition: selection_ip\nlevel: high",
    "yara": "rule CDB_APEX_DShield__Cowrie__Honeypot_Stats_and_When {\n    meta:\n        description = \"DShield (Cowrie) Honeypot Stats and When Sessions Disconnect\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"646af726da8182da9910c4a50aac4f648808de4f9f98bc26058ea190e9bf8e20\" ascii nocase\n        $h1 = \"b0d1282989c786cffe85093947f307a26f20601c2f039efc88e3b692d670d076\" ascii nocase\n        $h2 = \"bb403e1761fed33c966d99393630c16ae138ec887b9b32befe6f1bae5f2bc13d\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"commands.command\",\n              \"commands.session\",\n              \"containerd.io\",\n              \"cowrie.zip\",\n              \"docker.asc\",\n              \"docker.list\",\n              \"docs.cowrie.org\",\n              \"download.docker.com\",\n              \"isc.sans.edu\",\n              \"sessions.session\",\n              \"shstrtab.text\",\n              \"sources.list\",\n              \"userdb.example\",\n              \"www.dshield.org\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"646af726da8182da9910c4a50aac4f648808de4f9f98bc26058ea190e9bf8e20\",\n              \"b0d1282989c786cffe85093947f307a26f20601c2f039efc88e3b692d670d076\",\n              \"bb403e1761fed33c966d99393630c16ae138ec887b9b32befe6f1bae5f2bc13d\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"commands.command\", \"commands.session\", \"containerd.io\", \"cowrie.zip\", \"docker.asc\", \"docker.list\", \"docs.cowrie.org\", \"download.docker.com\", \"isc.sans.edu\", \"sessions.session\")"
  },
  "rule_count": 4
}