{
  "threat_id": "thr-23b9f185575d",
  "title": "Silver Dragon Targets Organizations in Southeast Asia and Europe",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Silver Dragon Targets Organizations in Southeast Asia and Eu\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/18\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '104.21.51.8'\n    selection_dns:\n        query:\n            - '*backup.sdb*'\n            - '*dfsvc.exe.config*'\n            - '*drivefrontend.pa-clients.workers*'\n            - '*events.rbs*'\n            - '*ns1.exchange4study.com*'\n            - '*ns1.onedriveconsole*'\n            - '*ns2.onedriveconsole.com*'\n            - '*simhei.dat*'\n            - '*wiatrace.bak*'\n            - '*wise-baton-452610-i5.iam.gserviceaccount.com*'\n    condition: selection_ip or selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_Silver_Dragon_Targets_Organizations_in_S {\n    meta:\n        description = \"Silver Dragon Targets Organizations in Southeast Asia and Eu\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"166e777cb72a7c4e126f8ed97e0a82e7ca9e87df7793fea811daf34e1e7e47a6\" ascii nocase\n        $h1 = \"16b9a7358be88632378ba20ba1430786f3b844694b1f876211ecdbecf5cccbc2\" ascii nocase\n        $h2 = \"19139a525ee9c22efd6a4842c4cd50ab2c5f9ee391e5531071df0bb4e685f55d\" ascii nocase\n        $h3 = \"2f787c1454891b242ab221b8b8b420373c3eb1a0c1fdcb624dd800c50758bbb0\" ascii nocase\n        $h4 = \"3128bdb8efaaa04c0ba96337252f4cc2dc795021cbc410f74ace9dde958bac1d\" ascii nocase\n        $h5 = \"37b485ed8d150d022c41e5e307b8c54c34ef806625b44d0c940b18be7d5b29ce\" ascii nocase\n        $h6 = \"3a2df7a2cfeca5ba315a29cf313268a53a22316c925e6b9760ead8f4df0d1f75\" ascii nocase\n        $h7 = \"3e2a0bafbd44e24b17fd7b17c9f2b2a3727349971d42612d55bbc1732082619a\" ascii nocase\n        $h8 = \"43f8f94ca5aa0af7bfb0cc1d2f664a46500a161b2d082b48b516d084ef485348\" ascii nocase\n        $h9 = \"44e769efed3e4f9f04c52dcd13f15cead251a1a08827a2cb6ea68427522c7fbb\" ascii nocase\n    condition:\n        any of them\n}",
    "suricata": [
      "alert ip any any -> 104.21.51.8 any (msg:\"CDB APEX \u2014 Silver_Dragon_Targets_Organiza\"; sid:7343317; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 104.21.51.8 any (msg:\"CDB APEX Silver_Dragon_Targets_Organiza\"; sid:1890755; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"104.21.51.8\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"backup.sdb\",\n              \"dfsvc.exe.config\",\n              \"drivefrontend.pa-clients.workers\",\n              \"events.rbs\",\n              \"ns1.exchange4study.com\",\n              \"ns1.onedriveconsole\",\n              \"ns2.onedriveconsole.com\",\n              \"simhei.dat\",\n              \"wiatrace.bak\",\n              \"wise-baton-452610-i5.iam.gserviceaccount.com\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"166e777cb72a7c4e126f8ed97e0a82e7ca9e87df7793fea811daf34e1e7e47a6\",\n              \"16b9a7358be88632378ba20ba1430786f3b844694b1f876211ecdbecf5cccbc2\",\n              \"19139a525ee9c22efd6a4842c4cd50ab2c5f9ee391e5531071df0bb4e685f55d\",\n              \"2f787c1454891b242ab221b8b8b420373c3eb1a0c1fdcb624dd800c50758bbb0\",\n              \"3128bdb8efaaa04c0ba96337252f4cc2dc795021cbc410f74ace9dde958bac1d\",\n              \"37b485ed8d150d022c41e5e307b8c54c34ef806625b44d0c940b18be7d5b29ce\",\n              \"3a2df7a2cfeca5ba315a29cf313268a53a22316c925e6b9760ead8f4df0d1f75\",\n              \"3e2a0bafbd44e24b17fd7b17c9f2b2a3727349971d42612d55bbc1732082619a\",\n              \"43f8f94ca5aa0af7bfb0cc1d2f664a46500a161b2d082b48b516d084ef485348\",\n              \"44e769efed3e4f9f04c52dcd13f15cead251a1a08827a2cb6ea68427522c7fbb\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"104.21.51.8\")\n// OR\nDeviceNetworkEvents | where RemoteUrl has_any (\"backup.sdb\", \"dfsvc.exe.config\", \"drivefrontend.pa-clients.workers\", \"events.rbs\", \"ns1.exchange4study.com\", \"ns1.onedriveconsole\", \"ns2.onedriveconsole.com\", \"simhei.dat\", \"wiatrace.bak\", \"wise-baton-452610-i5.iam.gserviceaccount.com\")"
  },
  "rule_count": 6
}