{
  "threat_id": "thr-65c7549aa597",
  "title": "PX4 Autopilot",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - PX4 Autopilot\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/03\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*docs.px4.io*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"docs.px4.io\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"docs.px4.io\")"
  },
  "rule_count": 3
}