{
  "threat_id": "thr-5ff53804cba1",
  "title": "Schneider Electric EcoStruxure Automation Expert",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Schneider Electric EcoStruxure Automation Expert\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/20\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*overview.jsp*'\n            - '*product-help.se.com*'\n            - '*www.se.com*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"overview.jsp\",\n              \"product-help.se.com\",\n              \"www.se.com\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"overview.jsp\", \"product-help.se.com\", \"www.se.com\")"
  },
  "rule_count": 3
}