{
  "threat_id": "thr-b0ca9e12005f",
  "title": "CVE-2026-27508 - Smoothwall Express < 3.1 Update 13 Reflected XSS in redirect.cg",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - CVE-2026-27508 - Smoothwall Express < 3.1 Update 13 Reflecte\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/04/01\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*redirect.cgi*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"redirect.cgi\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"redirect.cgi\")"
  },
  "rule_count": 3
}