{
  "threat_id": "thr-d450dfda9a15",
  "title": "Divide and conquer: how the new Keenadu backdoor exposed links between major And",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Divide and conquer: how the new Keenadu backdoor exposed lin\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/16\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*android.shopping*'\n            - '*android.util*'\n            - '*app-download.cn-wlcb.ufileos*'\n            - '*com.action*'\n            - '*com.aiworks.faceidservice*'\n            - '*com.aiworks.lock.face.service*'\n            - '*com.ak*'\n            - '*com.ak.p.wp*'\n            - '*com.arcsoft.closeli.service*'\n            - '*com.einnovation.temu*'\n            - '*com.extlib.apps*'\n            - '*com.hs.client*'\n            - '*com.hs.helper*'\n            - '*com.pri.appcenter.service*'\n            - '*com.taismart.global*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"android.shopping\",\n              \"android.util\",\n              \"app-download.cn-wlcb.ufileos\",\n              \"com.action\",\n              \"com.aiworks.faceidservice\",\n              \"com.aiworks.lock.face.service\",\n              \"com.ak\",\n              \"com.ak.p.wp\",\n              \"com.arcsoft.closeli.service\",\n              \"com.einnovation.temu\",\n              \"com.extlib.apps\",\n              \"com.hs.client\",\n              \"com.hs.helper\",\n              \"com.pri.appcenter.service\",\n              \"com.taismart.global\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"android.shopping\", \"android.util\", \"app-download.cn-wlcb.ufileos\", \"com.action\", \"com.aiworks.faceidservice\", \"com.aiworks.lock.face.service\", \"com.ak\", \"com.ak.p.wp\", \"com.arcsoft.closeli.service\", \"com.einnovation.temu\")"
  },
  "rule_count": 3
}