{
  "threat_id": "thr-50647f9dba51",
  "title": "#StopRansomware: Interlock",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 #StopRansomware: Interlock\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/22\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*blog.sekoia.io*'\n            - '*blog.talosintelligence.com*'\n            - '*cisecurity.org*'\n            - '*clickfix-attacks-sector-alert-tlpclear.pdf*'\n            - '*hhs.gov*'\n            - '*mail.cisa.dhs.gov*'\n            - '*processhacker-2.39-bin.zip*'\n            - '*qrpce91.exe.asd*'\n            - '*stopransomware.gov*'\n            - '*tmp41.wasd*'\n            - '*webujgd.lnk*'\n            - '*www.darkreading.com*'\n            - '*www.hhs.gov*'\n            - '*www.mcafee.com*'\n            - '*www.tripwire.com*'\n    condition: selection_ip\nlevel: high",
    "yara": "rule CDB_APEX__StopRansomware__Interlock {\n    meta:\n        description = \"#StopRansomware: Interlock\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"078163d5c16f64caa5a14784323fd51451b8c831c73396b967b4e35e6879937b\" ascii nocase\n        $h1 = \"1845a910dcde8c6e45ad2e0c48439e5ab8bbbeb731f2af11a1b7bbab3bfe0127\" ascii nocase\n        $h2 = \"18a507bf1c533aad8e6f2a2b023fbbcac02a477e8f05b095ee29b52b90d47421\" ascii nocase\n        $h3 = \"1a70f4eef11fbecb721b9bab1c9ff43a8c4cd7b2cafef08c033c77070c6fe069\" ascii nocase\n        $h4 = \"1d04e33009bcd017898b9e1387e40b5c04279c02ebc110f12e4a724ccdb9e4fb\" ascii nocase\n        $h5 = \"2814b33ce81d2d2e528bb1ed4290d665569f112c9be54e65abca50c41314d462\" ascii nocase\n        $h6 = \"28c3c50d115d2b8ffc7ba0a8de9572fbe307907aaae3a486aabd8c0266e9426f\" ascii nocase\n        $h7 = \"44887125aa2df864226421ee694d51e5535d8c6f70e327e9bcb366e43fd892c1\" ascii nocase\n        $h8 = \"4b036cc9930bb42454172f888b8fde1087797fc0c9d31ab546748bd2496bd3e5\" ascii nocase\n        $h9 = \"64a0ab00d90682b1807c5d7da1a4ae67cde4c5757fc7d995d8f126f0ec8ae983\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"blog.sekoia.io\",\n              \"blog.talosintelligence.com\",\n              \"cisecurity.org\",\n              \"clickfix-attacks-sector-alert-tlpclear.pdf\",\n              \"hhs.gov\",\n              \"mail.cisa.dhs.gov\",\n              \"processhacker-2.39-bin.zip\",\n              \"qrpce91.exe.asd\",\n              \"stopransomware.gov\",\n              \"tmp41.wasd\",\n              \"webujgd.lnk\",\n              \"www.darkreading.com\",\n              \"www.hhs.gov\",\n              \"www.mcafee.com\",\n              \"www.tripwire.com\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"078163d5c16f64caa5a14784323fd51451b8c831c73396b967b4e35e6879937b\",\n              \"1845a910dcde8c6e45ad2e0c48439e5ab8bbbeb731f2af11a1b7bbab3bfe0127\",\n              \"18a507bf1c533aad8e6f2a2b023fbbcac02a477e8f05b095ee29b52b90d47421\",\n              \"1a70f4eef11fbecb721b9bab1c9ff43a8c4cd7b2cafef08c033c77070c6fe069\",\n              \"1d04e33009bcd017898b9e1387e40b5c04279c02ebc110f12e4a724ccdb9e4fb\",\n              \"2814b33ce81d2d2e528bb1ed4290d665569f112c9be54e65abca50c41314d462\",\n              \"28c3c50d115d2b8ffc7ba0a8de9572fbe307907aaae3a486aabd8c0266e9426f\",\n              \"44887125aa2df864226421ee694d51e5535d8c6f70e327e9bcb366e43fd892c1\",\n              \"4b036cc9930bb42454172f888b8fde1087797fc0c9d31ab546748bd2496bd3e5\",\n              \"64a0ab00d90682b1807c5d7da1a4ae67cde4c5757fc7d995d8f126f0ec8ae983\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"blog.sekoia.io\", \"blog.talosintelligence.com\", \"cisecurity.org\", \"clickfix-attacks-sector-alert-tlpclear.pdf\", \"hhs.gov\", \"mail.cisa.dhs.gov\", \"processhacker-2.39-bin.zip\", \"qrpce91.exe.asd\", \"stopransomware.gov\", \"tmp41.wasd\")"
  },
  "rule_count": 4
}