{
  "threat_id": "thr-611ef719415b",
  "title": "Exploits and vulnerabilities in Q4 2025",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Exploits and vulnerabilities in Q4 2025\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/18\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*cve.org*'\n            - '*ltmdm64.sys*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"cve.org\",\n              \"ltmdm64.sys\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"cve.org\", \"ltmdm64.sys\")"
  },
  "rule_count": 3
}