{
  "threat_id": "thr-d149dfc891ae",
  "title": "Countering Chinese State-Sponsored Actors Compromise of Networks Worldwide to Fe",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 Countering Chinese State-Sponsored Actors Compromise of Netw\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/22\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*1.pcap*'\n            - '*bfv.bund.de*'\n            - '*bnd.bund.de*'\n            - '*bsi.bund.de*'\n            - '*cert.incident*'\n            - '*cyber.gc.ca*'\n            - '*cyber.go.jp*'\n            - '*cyber.gov.au*'\n            - '*cyber.int*'\n            - '*cyber.nsa.gov*'\n            - '*mail.cisa.dhs.gov*'\n            - '*map.tcl*'\n            - '*mycap.pcap*'\n            - '*ncsc.govt.nz*'\n            - '*nsa.gov*'\n    condition: selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_Countering_Chinese_State_Sponsored_Actor {\n    meta:\n        description = \"Countering Chinese State-Sponsored Actors Compromise of Netw\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"8b448f47e36909f3a921b4ff803cf3a61985d8a10f0fe594b405b92ed0fc21f1\" ascii nocase\n        $h1 = \"a1abc3d11c16ae83b9a7cf62ebe6d144dfc5e19b579a99bad062a9d31cf30bfe\" ascii nocase\n        $h2 = \"da692ea0b7f24e31696f8b4fe8a130dbbe3c7c15cea6bde24cccc1fb0a73ae9e\" ascii nocase\n        $h3 = \"f2bbba1ea0f34b262f158ff31e00d39d89bbc471d04e8fca60a034cabe18e4f4\" ascii nocase\n    condition:\n        any of them\n}",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"1.pcap\",\n              \"bfv.bund.de\",\n              \"bnd.bund.de\",\n              \"bsi.bund.de\",\n              \"cert.incident\",\n              \"cyber.gc.ca\",\n              \"cyber.go.jp\",\n              \"cyber.gov.au\",\n              \"cyber.int\",\n              \"cyber.nsa.gov\",\n              \"mail.cisa.dhs.gov\",\n              \"map.tcl\",\n              \"mycap.pcap\",\n              \"ncsc.govt.nz\",\n              \"nsa.gov\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"8b448f47e36909f3a921b4ff803cf3a61985d8a10f0fe594b405b92ed0fc21f1\",\n              \"a1abc3d11c16ae83b9a7cf62ebe6d144dfc5e19b579a99bad062a9d31cf30bfe\",\n              \"da692ea0b7f24e31696f8b4fe8a130dbbe3c7c15cea6bde24cccc1fb0a73ae9e\",\n              \"f2bbba1ea0f34b262f158ff31e00d39d89bbc471d04e8fca60a034cabe18e4f4\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"1.pcap\", \"bfv.bund.de\", \"bnd.bund.de\", \"bsi.bund.de\", \"cert.incident\", \"cyber.gc.ca\", \"cyber.go.jp\", \"cyber.gov.au\", \"cyber.int\", \"cyber.nsa.gov\")"
  },
  "rule_count": 4
}