{
  "threat_id": "thr-8f1aa79515c0",
  "title": "Bogus Avast website fakes virus scan, installs Venom Stealer instead",
  "rules": {
    "sigma": "title: CDB APEX v37.0 - Bogus Avast website fakes virus scan, installs Venom Stealer\nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/30\nlogsource:\n    category: firewall\ndetection:\n    selection_ip:\n        dst_ip:\n            - '104.21.14.89'\n    selection_dns:\n        query:\n            - '*avast.com*'\n            - '*cookies.sqlite*'\n    condition: selection_ip or selection_dns\nlevel: high",
    "yara": "rule CDB_APEX_Bogus_Avast_website_fakes_virus_scan__in {\n    meta:\n        description = \"Bogus Avast website fakes virus scan, installs Venom Stealer\"\n        author = \"CyberDudeBivash\"\n    strings:\n        $h0 = \"ecbeaa13921dbad8028d29534c3878503f45a82a09cf27857fa4335bd1c9286d\" ascii nocase\n    condition:\n        any of them\n}",
    "suricata": [
      "alert ip any any -> 104.21.14.89 any (msg:\"CDB APEX - Bogus_Avast_website_fakes_viru\"; sid:9125057; rev:1;)"
    ],
    "snort": [
      "alert ip any any -> 104.21.14.89 any (msg:\"CDB APEX Bogus_Avast_website_fakes_viru\"; sid:6507149; rev:1;)"
    ],
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"destination.ip\": [\n              \"104.21.14.89\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"avast.com\",\n              \"cookies.sqlite\"\n            ]\n          }\n        },\n        {\n          \"terms\": {\n            \"file.hash.sha256\": [\n              \"ecbeaa13921dbad8028d29534c3878503f45a82a09cf27857fa4335bd1c9286d\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteIP in (\"104.21.14.89\")\n// OR\nDeviceNetworkEvents | where RemoteUrl has_any (\"avast.com\", \"cookies.sqlite\")"
  },
  "rule_count": 6
}