{
  "threat_id": "thr-05143204437e",
  "title": "CVE-2026-3744 - code-projects Student Web Portal signup.php valreg_passwdation s",
  "rules": {
    "sigma": "title: CDB APEX v37.0 \u2014 CVE-2026-3744 - code-projects Student Web Portal signup.php \nstatus: experimental\nauthor: CyberDudeBivash SENTINEL APEX\ndate: 2026/03/08\nlogsource:\n    category: firewall\ndetection:\n    selection_dns:\n        query:\n            - '*signup.php*'\n    condition: selection_dns\nlevel: high",
    "elastic": "{\n  \"query\": {\n    \"bool\": {\n      \"should\": [\n        {\n          \"terms\": {\n            \"dns.question.name\": [\n              \"signup.php\"\n            ]\n          }\n        }\n      ],\n      \"minimum_should_match\": 1\n    }\n  }\n}",
    "kql": "DeviceNetworkEvents | where RemoteUrl has_any (\"signup.php\")"
  },
  "rule_count": 3
}