title: CDB APEX — Network IOC Detection — SentinelOne Intelligence Brief: Iranian Cyber Activity Outlook
id: 06367c8a-0cd2-9a19-4892-0cd29a194892
status: experimental
description: Detects network connections to IOCs from SentinelOne Intelligence Brief: Iranian Cyber Activity Outlook
references:
    - https://intel.cyberdudebivash.com/
author: CyberDudeBivash SENTINEL APEX v33.0
date: 2026/03/06
tags:
    - attack.command_and_control
    - attack.cdb-apt-22
logsource:
    category: firewall
detection:
    selection_ip:
        dst_ip:
    selection_dns:
        query:
            - '*www.sentinelone.com*'
    condition: selection_dns
falsepositives:
    - Legitimate traffic to shared infrastructure
level: high